{"name": "jasonwc22", "posts": [{"subreddit": "democrats", "text": "How many people have you infected? We'll never know.", "time": 1607224301.0}, {"subreddit": "democrats", "text": "And goodbye.......dies of covid", "time": 1607216523.0}, {"subreddit": "democrats", "text": "Of all the non masked people in the audience at a trump \"rally\" is it so unbelievable that even one would sneeze?", "time": 1607216474.0}, {"subreddit": "democrats", "text": "Nice reply. To the point. I stand corrected.", "time": 1607214346.0}, {"subreddit": "democrats", "text": "This is why Biden won. How many old Trumpers were dead or in critical condition and couldnt vote. Trump killed too much of his base.", "time": 1607176547.0}, {"subreddit": "democrats", "text": "But but but Joe kissed a woman on the head.", "time": 1606894751.0}, {"subreddit": "democrats", "text": "Tiny hands and stubby mushroom tip sold separately.", "time": 1606546471.0}, {"subreddit": "democrats", "text": "Well theyre perfectly fine with 263,000 deaths from COVID. Its the price if doing business. They would be fine with millions dead if it meant a re-election win. Rotten to the core.", "time": 1606432392.0}, {"subreddit": "democrats", "text": "Nice response. Im going to echo Bidens \"we need more love\" in this country speech and stop saying \"Trumptard\".   Even though its a great word and they call us worse.... no more \"Trumptard\" for me.", "time": 1606339120.0}, {"subreddit": "democrats", "text": "Ok that makes sense. He loses is power at noon on the 20th so he becomes a citizen and is no longer in control of the military. Biden will be Commander in Chief and can have him thrown out. Secret Service follow ex Presidents but ex's dont control the Secret Service either. Would Trumps Secret Service really be willing to take on military? Shit IDK, maybe?", "time": 1605546233.0}, {"subreddit": "democrats", "text": "But it did work. We have a clear winner. The process for booting out an unAmerican wanna be dictator needs to be adressed. Hes hurting the country by not allowing a peaceful transfer of power.", "time": 1605538180.0}, {"subreddit": "democrats", "text": "His cult followers have lost their mind even worse. Many of them do not suffer from mental disability but still chose to follow/worship him and ignore facts. Very unAmerican to try to delegitimize our election process(while waving a flag).", "time": 1605537866.0}, {"subreddit": "democrats", "text": "Cornholia?", "time": 1605089052.0}], "republican_score": 0, "democrat_score": 13}