{"name": "Dls95405", "posts": [{"subreddit": "democrats", "text": "Trump's wild desperation hints that he knows he's in a world of hurt the moment he's no longer protected by the office.", "time": 1607115786.0}, {"subreddit": "democrats", "text": "All other demographics, including white men, voted more for Biden than Trump. And yeah, I'm definitely biased against millions of women who wanted four more years of Trump, that's for sure. It's surreal. Nightmarish. It's mind boggling. It's mass insanity. And that even bringing it up is laughably considered \"bias against women\" means we won't learn a thing, again.", "time": 1606864402.0}, {"subreddit": "democrats", "text": "52%. Discussed ad infinium too. In either case, it's appalling that women are identified as a liberal democrat block yet half of them wanted four more years of an unfettered Trump. America is not what we think it is.", "time": 1606857595.0}, {"subreddit": "democrats", "text": "And no deplorable revolution. Trump is such a loser.", "time": 1606852614.0}, {"subreddit": "democrats", "text": "We on the left ignore this counterintuitive shocker at our own peril.", "time": 1606850228.0}, {"subreddit": "democrats", "text": "The most shocking fact of all is that the majority of white women voted for him in 2016, then, in 2020, even MORE white women voted for him.", "time": 1606848899.0}, {"subreddit": "democrats", "text": "Deplorable stupidity is now irrelevant.", "time": 1606528498.0}, {"subreddit": "democrats", "text": "So well said. This nightmare will end soon and Trump's fall will be glorious.", "time": 1606528438.0}, {"subreddit": "democrats", "text": "The innocent always demand pardons in Dumbfuckistan, nothing to see here.", "time": 1606405383.0}, {"subreddit": "democrats", "text": "You and I are irrelevant. The wheel of justice grinds slowly, but finely. America has just begun with this psychopathic traitor and all his evil minions.", "time": 1606257504.0}], "republican_score": 0, "democrat_score": 10}