{"name": "walter1950", "posts": [{"subreddit": "democrats", "text": "Trump demands names of the congressional Republicans who said they recognize Biden as winner Hey Melania “ BE BEST “\n", "time": 1607196894.0}, {"subreddit": "democrats", "text": "What you need to know: Gov. Ducey announces free COVID-19 vaccines for Arizonans, more funding for hospitals\n", "time": 1607003094.0}, {"subreddit": "democrats", "text": "Tracking the Trump Administration’s “Midnight Regulations” ( what Pandemic )\n", "time": 1606949100.0}, {"subreddit": "democrats", "text": "Just another Trumper Governor, Arizona uses federal COVID-19 money to reduce state spending not to those in need.\n", "time": 1606681533.0}, {"subreddit": "democrats", "text": "A Rush to Expand the Border Wall That Many Fear Is Here to Stay | so anybody out there waiting for a stimulus check? Priorities of the President.\n", "time": 1606596794.0}, {"subreddit": "democrats", "text": "Washington Post: White House Budget office moving to reclassify key roles under Trump executive order, wow Republicans priorities during pandemic?\n", "time": 1606587717.0}, {"subreddit": "democrats", "text": "New rule could allow gas, firing squads for US executions, Presidential priorities during a pandemic\n", "time": 1606587417.0}, {"subreddit": "democrats", "text": "Trump Races to Weaken Environmental and Worker Protections Before January 20th, hey Trumpers he like us, he understands the common man, make America great again\n", "time": 1606417692.0}, {"subreddit": "democrats", "text": "Donald Trump Echoes Call To Pardon Whole Administration, And Himself, so even Republicans know he’s guilty.\n", "time": 1606398385.0}, {"subreddit": "democrats", "text": "Governor Ducey says Arizona could see COVID-19 vaccine in December, for public in early 2021, I’ll wait and see.\n", "time": 1606262488.0}, {"subreddit": "democrats", "text": "Number of COVID-19 'long haulers,' survivors with lasting virus symptoms, is growing, what they don’t tell you.\n", "time": 1606162198.0}, {"subreddit": "democrats", "text": "Methinks the BunkerBitch doth protest too much.’Keilar rolls the tape on Trump's history of baselessly claiming fraud,\n", "time": 1605927641.0}, {"subreddit": "democrats", "text": "Trump administration overrules Jerome Powell and cuts off Fed emergency lending programs, and it starts.\n", "time": 1605899760.0}, {"subreddit": "democrats", "text": "The Republicans must be so proud of their Party. Giuliani Claims He Has Evidence of ‘National Conspiracy’ to Steal Election, But Can’t Release It Yet\n", "time": 1605885952.0}, {"subreddit": "democrats", "text": "What’s next for markets after Treasury Secretary Steven Mnuchin pulls the $455 billion plug\n", "time": 1605885142.0}, {"subreddit": "democrats", "text": "Arizona Secretary of State Accuses Governor of 'Deafening Silence' After Threats Against Her Family, he’s a Trumper all the way.\n", "time": 1605819153.0}, {"subreddit": "democrats", "text": "Hey Trump supporters this is your guy your Republicans. Here's how the Senate tax bill affects people earning less than $100,000\n", "time": 1605806096.0}, {"subreddit": "democrats", "text": "Arizona is in COVID-19 crisis and Gov. Doug Ducey fails to show up, even when he shows up, ( still a Trumper. )\n", "time": 1605790918.0}, {"subreddit": "democrats", "text": "Trump campaign sues homeless Nevada presidential elector in the latest push to challenge results\n", "time": 1605706931.0}, {"subreddit": "democrats", "text": "Pelosi, Schumer Urge McConnell to 'Come to the Table' and Work on a COVID-19 Relief Bill Are you listening Georgia.\n", "time": 1605706509.0}, {"subreddit": "democrats", "text": "Another “ Art of the Deal “ by Trump. A gigantic new trade bloc shows how the US ceded influence to China under Trump\n", "time": 1605621398.0}, {"subreddit": "democrats", "text": "Dr. Atlas Urges People To Spend Thanksgiving With Elderly Despite COVID Because They May Die Soon. Trump Dr is a real National treasure.\n", "time": 1605620019.0}, {"subreddit": "democrats", "text": "So let’s talk about rigged elections guys Georgia secretary of state says Graham, other Republicans have pressured him to toss legal ballots\n", "time": 1605571364.0}, {"subreddit": "democrats", "text": "COVID-19 Event Risk Assessment Planning Tool\n", "time": 1605550607.0}, {"subreddit": "democrats", "text": "Jesus Christ who elected this moron.....Texas senator suggests it's too soon to declare Biden the winner because Puerto Rico is still counting votes. WTF\n", "time": 1605370147.0}, {"subreddit": "democrats", "text": "Hello Reality......Trump to face ‘subpoenas and seizures’ following presidency, ex-Manhattan prosecutor says\n", "time": 1605317035.0}, {"subreddit": "democrats", "text": "This is why you got voted out... your a self serving SOB, AMERICA IS LAST is on your hat. Trump spends post-election week spreading misinformation and chaos as virus rages on\n", "time": 1605280807.0}, {"subreddit": "democrats", "text": "Security officials say the US will be a 'crippled world power' until Biden takes over and fear Trump will declassify intelligence that will help Putin, Trump has a Scorched Earth Policy, he’s done it all his life.\n", "time": 1605136083.0}, {"subreddit": "politics", "text": "They’re still afraid of Trump, they are in his cult and to go against him means a tweet storm bash down along with loss of supporters, think about that , grown men afraid of standing up for Democracy, just like Ted Spineless Cruz. Pathetic\n\nEdit: just saw this on The Hill : \n\nTrump demands names of the congressional Republicans who said they recognize Biden as winner\n\nhttps://www.msn.com/en-us/news/politics/trump-demands-names-of-the-congressional-republicans-who-said-they-recognize-biden-as-winner/ar-BB1bEWaB", "time": 1607196514.0}, {"subreddit": "politics", "text": "The pandemic doesn’t concern him now, it only did prior to the election, ( and that’s a loose thought) remember it’s a “ Me “ thing, his only interest is in those things that concern him period, a pure Narcissist.", "time": 1607179135.0}, {"subreddit": "politics", "text": "This video is big on r/conservative, they’re claiming here’s proof you can’t deny, J 20th can’t come soon enough", "time": 1607171093.0}, {"subreddit": "politics", "text": "The crack down should be to ignore him, persona non Grata, big news won’t do it but it would be great if they just didn’t talk about him, the more they do the mor he goes of the rails.", "time": 1607168994.0}, {"subreddit": "politics", "text": "So tired of winning, so much winning it’s Exhausting.", "time": 1607120299.0}, {"subreddit": "politics", "text": "Just read Disloyal by Cohen, Trump saw Presidency as Power and a way to make money, nothing else.", "time": 1607120179.0}, {"subreddit": "politics", "text": "Trump: I have a great idea, all you kids take responsibility for everything then I will have a pardon party for all of you.", "time": 1607005661.0}, {"subreddit": "politics", "text": "I give you the new Republican Party, there’s no bad \nLies no matter how crazy, win at all cost even destroying your party.", "time": 1607005351.0}, {"subreddit": "democrats", "text": "Also Governor Dooshy where’s the $400 million ????\n\nhttps://www.kold.com/2020/11/27/gov-ducey-reduces-state-spending-with-federal-covid-money/", "time": 1607003141.0}, {"subreddit": "politics", "text": "No comment other than the Republicans are a joke.", "time": 1607002752.0}, {"subreddit": "politics", "text": "From don’t vote to vote, what a joke.", "time": 1606959769.0}, {"subreddit": "politics", "text": "Lowering Wages for Immigrant Farmworkers, nice, the jobs no American wants or will do.", "time": 1606948965.0}, {"subreddit": "politics", "text": "Ignorance, fear, lies, misinformation and Fake promises, this all appeals to a certain sector of society, tell them what they want to hear, who to blame and I can only fix it and only me, they buy in.", "time": 1606948810.0}, {"subreddit": "politics", "text": "Aid accounts for 39% of $119.6 billion in net farm income, Trump will probably take credit for the 7 yr high leaving out the 39% aid.", "time": 1606948398.0}, {"subreddit": "politics", "text": "Stimulus what stimulus, they want to hang the next stimulus on the Democrats, soon to be heard \nWhat about the debt, it to high, how can you do this, this is so irresponsible.", "time": 1606945316.0}, {"subreddit": "politics", "text": "Unbelievable, they just can’t get it right", "time": 1606944383.0}, {"subreddit": "politics", "text": "To me that just enforces they did commit crimes they could be held accountable for, the “ greatest President in history” HaHaHa", "time": 1606917896.0}, {"subreddit": "politics", "text": "As Trump has said many times “ I don’t want to talk to anyone, I know more than anybody, I know more than they do”  \nThis was said to Kelly when Trump didn’t want intelligence briefings. It’s been a theme through his entire life and Presidency.", "time": 1606917545.0}, {"subreddit": "politics", "text": "Good be, but Trump has  Don. Jr  I quote “ fucking stupid & worthless “ Jr. wanted to be in Montana hunting fishing raising Buffalo on a ranch , but Trump said work for me or lose everything, Trump has treated his son just like Fred Sr. treated Fred Jr.", "time": 1606863941.0}, {"subreddit": "politics", "text": "Sure why not , here in Arizona we had 10,332 infected on Monday, such fucking idiots , some research has shown long term effects that don’t show up until 3-4 months later, my friend got infected in April, went in the hospital September ( Covid free ) with headaches and body aches, out now but get exhausted easily, the term used they said was a Long Hauler, people don’t realize.", "time": 1606847680.0}, {"subreddit": "politics", "text": "I read the first book and really gave me an insight into why and what made trump the way he is today, everyone can say yeah hies corrupt, cruel, cheater etc etc but what made him that way, I probably won’t read the second book, I read both of Woodward’s books, and Trump is truly one fucked up individual. The saying “ win at all cost “ is true and I mean All Costs.", "time": 1606847165.0}, {"subreddit": "politics", "text": "The media just needs to make Trump and his idiots \nPersona non Grata, just stop, ignore the B. S. The more attention they receive the more outlandish they become just like Trump. I think I’ve hit that point today where when I see this crap I will thumb over it and ignore it, the only way to control Trump is to ignore him, one that drives him up a wall, two it will give America a well deserved break, a mental health break from the crazies.", "time": 1606846841.0}, {"subreddit": "politics", "text": "You want to talk about Fraud look no further that \nScott Atlas.", "time": 1606834239.0}, {"subreddit": "politics", "text": "Watch out, you might get what you're after\nCool babies, strange but not a stranger\nI'm an ordinary guy\nBurning down the house\n\nHold tight, wait 'til the party's over\nHold tight, we're in for nasty weather\nThere has, got to be a way\nBurning down the house", "time": 1606827735.0}, {"subreddit": "democrats", "text": "Ducey is a huge Trump supporter, loves the guy and kissed his ass for 4 yrs. now Trump rolls the bus over Ducey ( well deserved ) as he does anybody who doesn’t agree with him and the bus hasn’t stopped yet.", "time": 1606789281.0}, {"subreddit": "politics", "text": "Thank you corrected.", "time": 1606777197.0}, {"subreddit": "politics", "text": "Representative Andy Biggs “ Unmask Arizona “ his slogan,  and Ducey won’t mandate masks but he will divert Covid monies away from those in need. \n\nhttps://apnews.com/article/arizona-coronavirus-pandemic-d3a331c183337ac8d1630e9bff1aca4a", "time": 1606776481.0}, {"subreddit": "politics", "text": "If he runs in 2024 will he get republicans support after this circus show ? Probably because they’re scared of the cult", "time": 1606742416.0}, {"subreddit": "politics", "text": "So it’s fuck one person one vote , name another election in the United States where the winner has the fewest votes.", "time": 1606704661.0}, {"subreddit": "politics", "text": "Any judge who lets them in his or her court will be looked at in the same light that these so called lawyers are.", "time": 1606704351.0}, {"subreddit": "politics", "text": "They will kiss his ass, they need the ratings, Jesus Faux  is scared of him, Republicans, Congressmen, and governors all scared of him, it’s pathetic. Even his advisors were afraid to give him bad news they didn’t want to endure his wrath.", "time": 1606680603.0}, {"subreddit": "politics", "text": "Correct me if I’am wrong but aren’t the heads of those departments Trumps people?", "time": 1606680104.0}, {"subreddit": "politics", "text": "You mean people who know how to run their departments. Ok 👍", "time": 1606680018.0}, {"subreddit": "politics", "text": "Rudy.......Rudy.......Rudy......send me in coach, what a complete embarrassment.", "time": 1606669276.0}, {"subreddit": "politics", "text": "Sums up this entire administration.", "time": 1606653532.0}, {"subreddit": "politics", "text": "Hello Georgia, help us out!", "time": 1606598043.0}, {"subreddit": "politics", "text": "Good don’t vote", "time": 1606597510.0}, {"subreddit": "democrats", "text": "Joining the league of Shithole country’s.", "time": 1606592569.0}, {"subreddit": "politics", "text": "This has to be intentional, I mean are they really that fucking stupid............. ok ok yes they are.", "time": 1606591853.0}, {"subreddit": "politics", "text": "If it was Mossad it looked like a sloppy job which usually isn’t the way they normally operate. IMO", "time": 1606591487.0}, {"subreddit": "politics", "text": "True", "time": 1606501759.0}, {"subreddit": "politics", "text": "For once Go Trump keep talking buddy.", "time": 1606498806.0}, {"subreddit": "politics", "text": "Ivanka \nFACT: Greenhouse gases generated by the U.S. will slide 9.2% this year, tumbling to the lowest level in at least three decades. @EPA\n\nFact : at this very moment your Daddy is weakening environment laws and worker protection, IDK what the fuck your talking about, besides did you forget who’s in charge of the EPA. I truly hope society makes you Persona non Grata, you can hang with the Cult.", "time": 1606498624.0}, {"subreddit": "democrats", "text": "Yes  E. O.", "time": 1606498293.0}, {"subreddit": "politics", "text": "The question is “ Is Georgia listening “ and do they care?", "time": 1606487520.0}, {"subreddit": "politics", "text": "4 years of never once excepting responsibility, always blaming someone else for his failures, that’s how he was raised.", "time": 1606487112.0}, {"subreddit": "politics", "text": "That’s his out, so much for tough guy.", "time": 1606438571.0}, {"subreddit": "politics", "text": "Who fucking cares, to all news media, forget him, ignore him, make him persona non grata, the whole damn family , make it all about Biden, Georgia and what congress is doing , just fuck off Trump, the more attention you give them the worse they get.", "time": 1606430090.0}, {"subreddit": "democrats", "text": "👍👍👍", "time": 1606417388.0}, {"subreddit": "democrats", "text": "Making him look like an idiot, he is an idiot as stated by many of his top advisers, or moron take your pick.", "time": 1606416870.0}], "republican_score": 0, "democrat_score": 34}