{"name": "seriousbangs", "posts": [{"subreddit": "politics", "text": "Up is down: Trump lies that Biden would 'destroy' Obamacare's protections for pre-existing conditions\n", "time": 1599857474.0}, {"subreddit": "politics", "text": "Wisconsin Supreme Court temporarily blocks absentee ballots from being mailed a week before deadline\n", "time": 1599784172.0}, {"subreddit": "politics", "text": "D.C. Circuit panel guts House subpoena power\n", "time": 1598914980.0}, {"subreddit": "politics", "text": "Former DHS Employee: Trump wanted to gas migrants\n", "time": 1598385656.0}, {"subreddit": "democrats", "text": "We should be hammering the damage done to small businesses by Trump & Dejoy\n", "time": 1597886254.0}, {"subreddit": "democrats", "text": "For everyone making fun of Trump's comments about sinks & dishwashers\n", "time": 1596754448.0}, {"subreddit": "democrats", "text": "Why voting for Democrats matters\n", "time": 1596301853.0}, {"subreddit": "democrats", "text": "Democrats seem to be backing down on the $600/wk unemployment\n", "time": 1595975639.0}, {"subreddit": "democrats", "text": "They've done the math\n", "time": 1595710704.0}, {"subreddit": "democrats", "text": "A good point\n", "time": 1595112732.0}, {"subreddit": "democrats", "text": "Is it just me or are Biden & the DNC not doing enough to combat voter suppression?\n", "time": 1594252318.0}, {"subreddit": "democrats", "text": "Let's talk about Trump's warrants and an inside joke....\n", "time": 1593478812.0}, {"subreddit": "democrats", "text": "I'm getting flashbacks to Section 230\n", "time": 1593132340.0}, {"subreddit": "democrats", "text": "Trump scrolls through his phone while small business owners share pandemic stories.\n", "time": 1592572805.0}, {"subreddit": "politics", "text": "Are they in the Senate? No? Then it doesn't matter. Wake me when there's a chance of it passing the Senate. Meanwhile these guys are just playing it safe.", "time": 1607220846.0}, {"subreddit": "politics", "text": "By now he's raised over half a billion dollars since the election ended. It's not narcissism, it's profit.", "time": 1607220792.0}, {"subreddit": "politics", "text": "Mostly \"can not\" because there are laws preventing it that were passed ages ago because people knew damn well they'd try.", "time": 1607220458.0}, {"subreddit": "democrats", "text": "You know, that's genius. Seriously, make it a law. Have them wear robes and the more money they take the bigger and more visible the patch they have to wear.", "time": 1607198608.0}, {"subreddit": "politics", "text": "he went on to say \"Sure, I voted with Trump 100% of the times it mattered, but I sure hope you'll forget that when I run for president in 4 years\".", "time": 1607137521.0}, {"subreddit": "politics", "text": "It just comes down to GA. If the Dems win both seats we'll see more stimulus. If not the GOP will block it.", "time": 1607137455.0}, {"subreddit": "politics", "text": "Unless a miracle happens and the Dems take 2 seats it GA it won't matter.", "time": 1607115437.0}, {"subreddit": "politics", "text": "Christ I wish this were true, but he's still blathering on endlessly, just not about anything that matters.\n\nHe's raising plenty of money though. Plenty of money.", "time": 1607055815.0}, {"subreddit": "politics", "text": "That doesn't seem like very many. I figured he'd bleed more since people don't need to listen to him anymore.", "time": 1607024945.0}, {"subreddit": "politics", "text": "Subby, you've got the quotes in the wrong place. They should be around the word \"Joke\".", "time": 1607024887.0}, {"subreddit": "politics", "text": "Not really. I think all told about 50,000 votes decided the election. Out of 156 million. That's 0.03%. If that's not a nail biter I don't know what is.", "time": 1606971311.0}, {"subreddit": "politics", "text": "So what? He won. He's still a Senator for the next 6 years.. He'll die in office. \n\nMeanwhile the left is eating their own.", "time": 1606953915.0}, {"subreddit": "politics", "text": "I like that Biden won by around 7 million votes and thanks to the EC it was a nail biter. \n\nThe only reason Trump can't steal it is Biden is ahead in multiple states by reasonable margins, so Trump can't just focus on cheating in one state like Bush did in FL", "time": 1606949714.0}, {"subreddit": "democrats", "text": "Yep, he's right. We're not going to \"defund the police\". We *are* going to scare the shit out of suburban voters and lose Congress in 2022 if we keep this up. \n\nBLM should be focusing on voting rights. Go register people to vote if you've got time. Of course that's not nearly as fun and exciting as a big 'ole protest...", "time": 1606949492.0}, {"subreddit": "democrats", "text": "Unless the Dems win GA McConnell's just going to block it. The GOP want to hurt the country so that voters will blame Biden. \n\nI wish the people of GA would figure that out, but I'm not gonna hold my breath. Youth turnout is usually lower in run offs, and the Dems need it to win.", "time": 1606880414.0}, {"subreddit": "politics", "text": "Well yeah, he kind of is. He's been part of the actual deep state for ages. \n\nYou know what i don't get, the right calls it the Deep State, the Left calls it the Ruling Class. It's the same people. You'd think we could come together on this.", "time": 1606879850.0}, {"subreddit": "politics", "text": "About time the Dems started properly fear mongering. It's OK when there's something real to be afraid of.", "time": 1606872216.0}, {"subreddit": "politics", "text": "Trump's made $150 million from donations claiming fraud. He's not gonna stop until the money does.\n\nEdit: He's up to $498 million. Nice work if you can get it. I think they're putting the breaks on it now because it's hurting the GA run offs.", "time": 1606862243.0}, {"subreddit": "politics", "text": "The best part is the bastards are going to spread the virus at their bullshit events.", "time": 1606780387.0}], "republican_score": 0, "democrat_score": 13}