{"name": "cuckfancer11", "posts": [{"subreddit": "politics", "text": "Lawsuit Seeks To Throw Out Votes In 3 Wisconsin Counties That Supported Joe Biden\n", "time": 1605298971.0}, {"subreddit": "democrats", "text": "The family played Trivial Pursuit today. Pink was my question.\n", "time": 1604790901.0}, {"subreddit": "democrats", "text": "The family played Trivial Pursuit today. Pink was my question.\n", "time": 1604790194.0}, {"subreddit": "democrats", "text": "Let's Welcome the 2A Dems and Others\n", "time": 1598652482.0}, {"subreddit": "democrats", "text": "Holy shit that is well done. Captions match the energy of the film.", "time": 1607066676.0}, {"subreddit": "politics", "text": "I can't see fuck-all in that video.", "time": 1607055565.0}, {"subreddit": "politics", "text": "Or firing paintball rounds into the crowd from a moving vehicle.", "time": 1607039120.0}, {"subreddit": "politics", "text": "...no.", "time": 1607018133.0}, {"subreddit": "politics", "text": "Oddly enough, shooting people is breaking the law too.\n\nCriminals gonna crime.", "time": 1606966151.0}, {"subreddit": "democrats", "text": "Strange. It seems that when you're on a hurry to throw as many lawsuits at the wall with no evidence and hope that they stick you make a few mistakes.", "time": 1606961747.0}, {"subreddit": "democrats", "text": "Sadly, the /s is required.", "time": 1606961624.0}, {"subreddit": "politics", "text": "\"Are we the baddies?\"", "time": 1606956721.0}, {"subreddit": "politics", "text": "No, you'd just make them with cocoa, milk, and sugar.\n\nOr get them from someone who already has some.", "time": 1606940147.0}, {"subreddit": "politics", "text": "It's like trying to limit access to cookies by requiring an approval process to buy chocolate chips.", "time": 1606939499.0}, {"subreddit": "politics", "text": "Despite no chance of going anywhere in Florida, this is the entirely wrong way to go about it.", "time": 1606934646.0}, {"subreddit": "democrats", "text": "Wall of text. Every. Damn. Time.", "time": 1606765482.0}, {"subreddit": "democrats", "text": "To quote Joe: \"Then what?\"\n\nGoing to the SCOTUS isn't an automatic win. Throwing out the electoral votes would lead to a House contingent election. The House can simply delay seating a few Repub states until after the contingent election.\n\nEdit: Popular vote -> Electoral votes", "time": 1606531025.0}, {"subreddit": "democrats", "text": "If Democrats committed massive voter fraud, they would have easily won the Senate.\n\nMic drop.", "time": 1606520850.0}, {"subreddit": "democrats", "text": "All the T_D guys had to go somewhere.", "time": 1606450937.0}, {"subreddit": "democrats", "text": "Seems to me like you could just look at his Twitter feed.", "time": 1606253965.0}, {"subreddit": "politics", "text": "\"But mah freeze peach!!!\"", "time": 1606249149.0}, {"subreddit": "politics", "text": "Perfect. Use their own weapon against them. Hopefully with evidence, though.", "time": 1605931925.0}, {"subreddit": "democrats", "text": "I'm gonna start quoting every damn one of these (with username) before they run and delete.", "time": 1605926217.0}, {"subreddit": "politics", "text": "Wtf is going on.", "time": 1605898711.0}, {"subreddit": "democrats", "text": "When can we get these guys arrested for threats of domestic terrorism?", "time": 1605896910.0}, {"subreddit": "democrats", "text": "It's not childish what they're doing right now. Trump has been threatening it for months. I can guarantee almost everyone here saw it coming.\n\nYou say you're \"disappointed in Republican leaders.\" They have spent 4 years falling in line to a wannabe facist. It has been clearly evident since McCain's passing.\n\nThey will do better next time. They'll learn from this and bring someone to power who isn't quite the bafoon and knows how government works. That will be an authoritarian takeover that will be VERY difficult to put down.\n\nPlease take some time to do some introspection regarding how obvious the writing on the wall has been and what platform you chose to support. Many Democrats are extremely angry with you for setting aside democracy so that \"your guy\" can be in power, Constitution be damned. I can't blame them, I'm angry too. But if you are willing to denounce white supremacy, facism, xenophobia, and a 'no holds Barred' conservative takeover of our entire government, then we can start to have a conversation.\n\nAt the very least, we can agree Biden will be good for this country.", "time": 1605896687.0}, {"subreddit": "democrats", "text": "Holy hell.", "time": 1605896033.0}], "republican_score": 0, "democrat_score": 15}