{"name": "ragedandrumbled", "posts": [{"subreddit": "democrats", "text": "I live in a very red county in a very blue state, the flag laden truck caravans still remind everyone that their candidate was robbed of an election, so I wish I could share your observations.", "time": 1607107196.0}, {"subreddit": "politics", "text": "That was priceless, I am a wastewater operator as a job requirement one has to have a certain degree of potty humor. I haven't laughed that hard in a long time. And by the way your description of grease and it's discharge pose a big problem in our industry. Seriously, thanks for the laugh.", "time": 1606511977.0}, {"subreddit": "democrats", "text": "Edit SC GOP", "time": 1602437444.0}, {"subreddit": "democrats", "text": "On top of all the points brought up the Supreme Court ruled on the side of SC good that absentee ballots must also have a witness signature. With covid ballot requests numerous this decision could very well decide the election in Graham's favor.", "time": 1602437396.0}, {"subreddit": "democrats", "text": "You need to first look to 2006, during the Bush administration Congress passed the PAEA which forced the USPS to prefund it's retirement benefits 75 years in advance, this has placed an undue burden that no other entity private or public has to endure. It has up until that point been self funded.", "time": 1596511523.0}, {"subreddit": "democrats", "text": "Yes, rational thought is lost on modern conservatives. These are the same folks that often talk about the wisdom of the founding fathers but fail to notice that the USPS is one of the services that was created in the original Constitution.", "time": 1596511012.0}, {"subreddit": "democrats", "text": "I don't think it will go far in the Senate unfortunately, I don't think McConnell would bring it to the floor before the election.", "time": 1596505280.0}, {"subreddit": "democrats", "text": "Peter DeFazio D- Oregon has a bill ready to undo the changes to funding of the USPS that took place in 2006. Contact your local rep and see if they could support it.", "time": 1596469875.0}, {"subreddit": "democrats", "text": "As an Oregonian, congratulations to Jeff Merkley on his re-election.", "time": 1590203240.0}, {"subreddit": "democrats", "text": "The pendulum swung to the right since the Reagan administration, we are finally seeing a generational correction, and it probably won't get us back to the center. A Sanders administration will have to act through executive orders, pure and simple. It will then take the voters to push for candidates that support essentially New Deal programs that have popular support by voters. It will take a lot of work to undo Trump's damage.", "time": 1582475416.0}, {"subreddit": "democrats", "text": "It is interesting, this is the second post that has held negative views concerning Cenks' entry into the race. He would represent the district well.", "time": 1574564904.0}], "republican_score": 0, "democrat_score": 10}