{"name": "dakandy", "posts": [{"subreddit": "democrats", "text": "House passes historic bill to end federal marijuana prohibition\n", "time": 1607153605.0}, {"subreddit": "republicans", "text": "Trump still in denial about defeat as legal team mounts last-ditch challenges\n", "time": 1606812156.0}, {"subreddit": "democrats", "text": "Trump Flips Out At Reporter: 'Don't Ever Talk To The President That Way'\n", "time": 1606455463.0}, {"subreddit": "democrats", "text": "Forecast\n", "time": 1605658865.0}, {"subreddit": "democrats", "text": "Report: Sen. Graham pressured Ga. secretary of state to throw out legally cast ballots\n", "time": 1605588848.0}, {"subreddit": "democrats", "text": "McConnell rejects Dem demand for big Covid relief package, stands by push for 'highly targeted' bill\n", "time": 1605224959.0}, {"subreddit": "democrats", "text": "Is There a 'Hammer and Scorecard' Operation to Manipulate Vote Counts?\n", "time": 1605144788.0}, {"subreddit": "democrats", "text": "For Stacey Abrams, revenge is a dish best served blue\n", "time": 1604768320.0}, {"subreddit": "democrats", "text": "Mueller investigated -- but didn't charge -- Stone, WikiLeaks and Assange for Russian hack of Democrats in 2016, less-redacted report shows\n", "time": 1604406353.0}, {"subreddit": "democrats", "text": "Trump 2020: Using the courts after a decisive Biden victory.\n", "time": 1604141761.0}, {"subreddit": "democrats", "text": "Trump aide Stephen Miller preparing second-term immigration blitz\n", "time": 1603875116.0}, {"subreddit": "democrats", "text": "Decision on subpoena for Trump tax returns now in hands of Supreme Court\n", "time": 1603288695.0}, {"subreddit": "democrats", "text": "Delaware DOJ Punts Rudy’s Latest Hunter Biden Claim to FBI, Citing ‘Credibility’ Questions\n", "time": 1603286488.0}, {"subreddit": "democrats", "text": "In Ohio, a Printing Company Is Overwhelmed and Mail Ballots Are Delayed\n", "time": 1602903918.0}, {"subreddit": "democrats", "text": "Photoshop failure: Upstate N.Y. Republican Senate candidate adds fake cops into campaign mailer\n", "time": 1602494414.0}, {"subreddit": "democrats", "text": "DONALD TRUMP: The first time I ever heard of Black Lives Matter, I said, 'that's such a terrible term,' because it's such a racist term.\n", "time": 1602376741.0}, {"subreddit": "democrats", "text": "Just a reminder.\n", "time": 1602327417.0}, {"subreddit": "democrats", "text": "The Rose Garden Spreadification Ceremony.\n", "time": 1602270109.0}, {"subreddit": "democrats", "text": "The Notorious RBG\n", "time": 1601771659.0}, {"subreddit": "democrats", "text": "\"No, I pay tax,\" Trump responded. \"I pay a lot of tax. I just signed a big fat check recently for a lot of tax. I paid literally, I paid a lot of tax and you know, look, I don't mind. I'm proud to pay it up. If I owe it, I pay it.\"\n", "time": 1601345952.0}, {"subreddit": "democrats", "text": "Washington Post: Mueller prosecutor says special counsel 'could have done more' in new book\n", "time": 1601279175.0}, {"subreddit": "democrats", "text": "Ultra-Rich Sen. Kelly Loeffler’s Family Has Taken In $3 Million in Farm Subsidies\n", "time": 1601074197.0}, {"subreddit": "democrats", "text": "Trump got Keith Kellogg to lie about Olivia Troye’s resignation (she’s a lifelong Republican btw).\n", "time": 1601073466.0}, {"subreddit": "democrats", "text": "Donald Trump is low on money for campaign.\n", "time": 1601069522.0}, {"subreddit": "democrats", "text": "She wore a BLM mask to work at Whataburger. After a customer complained, she lost her job.\n", "time": 1601068875.0}, {"subreddit": "democrats", "text": "Sources: Trump intends to choose Amy Coney Barrett for Supreme Court\n", "time": 1601064888.0}, {"subreddit": "democrats", "text": "Kentucky AG Daniel Cameron regarding Breonna Taylor\n", "time": 1600885648.0}, {"subreddit": "democrats", "text": "H.R. McMaster\n", "time": 1600807165.0}, {"subreddit": "democrats", "text": "U.S. Covid-19 death toll surpasses 200,000\n", "time": 1600538626.0}, {"subreddit": "democrats", "text": "Federal Officials Considered Using a ‘Heat Ray’ Against D.C. Protestors: Report\n", "time": 1600330231.0}, {"subreddit": "democrats", "text": "Senior DHS official alleges in whistleblower complaint that he was told to stop providing intelligence analysis on threat of Russian interference\n", "time": 1599681493.0}, {"subreddit": "democrats", "text": "Trump laundering money from Putin\n", "time": 1599414478.0}, {"subreddit": "democrats", "text": "Justice Dept. Never Fully Examined Trump’s Ties to Russia, Ex-Officials Say\n", "time": 1598822720.0}, {"subreddit": "democrats", "text": "Super spreader event at the White House.\n", "time": 1598581445.0}, {"subreddit": "democrats", "text": "The Kenosha Shooting Suspect Was In The Front Row Of A Trump Rally In January\n", "time": 1598491025.0}, {"subreddit": "democrats", "text": "He’s the chosen one!\n", "time": 1598342945.0}, {"subreddit": "democrats", "text": "Caught red handed: A detailed report confirms Russia’s collusion and Trump’s lies\n", "time": 1597839607.0}, {"subreddit": "democrats", "text": "Michelle Obama is awesome!\n", "time": 1597719175.0}, {"subreddit": "democrats", "text": "Trump says he is considering pardon for leaker Edward Snowden\n", "time": 1597541883.0}, {"subreddit": "democrats", "text": "Appeals court likely to let judge decide whether to drop Michael Flynn charges\n", "time": 1597170265.0}, {"subreddit": "democrats", "text": "Trump says he will deliver convention speech from either Gettysburg or White House\n", "time": 1597146060.0}, {"subreddit": "democrats", "text": "More than 100 Black men urge Biden to pick Black woman as vice president\n", "time": 1597103842.0}, {"subreddit": "democrats", "text": "Trump insinuates that he’s going to use the DOJ against his political opponents in today’s ‘press briefing’ in the period before the election. He mention Barack Obama, Joe Biden, Susan Rice, Jim Comey, Lisa Page and Peter Strzok.\n", "time": 1597100261.0}, {"subreddit": "democrats", "text": "I wonder if Trump told over 100 lies during his ‘press briefing’ this evening.\n", "time": 1597099659.0}, {"subreddit": "democrats", "text": "D.A. Is Investigating Trump and His Company Over Fraud, Filing Suggests\n", "time": 1597099439.0}, {"subreddit": "democrats", "text": "Trump’s Bank Was Subpoenaed by N.Y. Prosecutors in Criminal Inquiry\n", "time": 1597099192.0}, {"subreddit": "democrats", "text": "Is Trump defunding Social Security and Medicare? Concerns mount after president's executive order\n", "time": 1597037579.0}, {"subreddit": "democrats", "text": "Opinion: Trump declares war on Social Security, Medicare\n", "time": 1597037351.0}, {"subreddit": "democrats", "text": "Trump's new executive orders will 'defund' Medicare and social security, critics warn\n", "time": 1597019860.0}, {"subreddit": "democrats", "text": "Did Cedric Richmond just give us a little hint about Joe’s VP choice?\n", "time": 1597004480.0}, {"subreddit": "democrats", "text": "Warning: Trump has a very very legitimate shot at winning.\n", "time": 1596508474.0}, {"subreddit": "democrats", "text": "Kim Kardashian addresses Kanye West's mental health and asks for compassion\n", "time": 1595508499.0}, {"subreddit": "politics", "text": "Federal law enforcement agencies worry their work is being politicized\n", "time": 1595508008.0}, {"subreddit": "politics", "text": "How John Lewis befriended a young boy and changed his life forever\n", "time": 1595334317.0}, {"subreddit": "democrats", "text": "John Lewis.\n", "time": 1595067907.0}, {"subreddit": "democrats", "text": "Civil rights legend Rep. John Lewis dead at 80\n", "time": 1595053801.0}, {"subreddit": "democrats", "text": "Former Russia special counsel Robert Mueller defends Roger Stone prosecution in wake of Trump commutation\n", "time": 1594509595.0}, {"subreddit": "democrats", "text": "More Suckers.", "time": 1607183373.0}, {"subreddit": "democrats", "text": "Secret weapon: Andrew Yang! How can you not love and trust this guy?", "time": 1607044991.0}, {"subreddit": "democrats", "text": "Thankfully, the codes change daily.", "time": 1606979763.0}, {"subreddit": "democrats", "text": "Short words. Each word one syllable. Lock her up. Send them back. USA. Stop The Steal. Hell no we won’t go. All Cops Are Bad. It’s got to be chantable.", "time": 1606973414.0}, {"subreddit": "democrats", "text": "Someone has to think of a catchy three word slogan.", "time": 1606964570.0}, {"subreddit": "democrats", "text": "That doesn’t have to be the case. I stand by my solution.", "time": 1606958336.0}, {"subreddit": "democrats", "text": "We have a series of policing issues, such as training, hiring, specialization, and many others. Solving these issues actually involves more funding, meetings, and brainstorming. \n\nIf AOC alienates voters from voting because ‘defunding the police tm’ is not what the goal is, then the country gets Donald Trump and his vicious type of law and order. With Biden, she is much closer to her goal. \n\nSo on a high level, Obama is correct. We all know what the goals should be, and shouting ‘defund’ (although ‘defunding really means something more specific. It really does!’, she says) is not going to win the House and the Senate. She has now created another counterproductive circular firing squad.", "time": 1606958089.0}, {"subreddit": "democrats", "text": "She does ask permission. Good.", "time": 1606953370.0}, {"subreddit": "democrats", "text": "It’s over. We’re just in the hangover phase. Thank you.", "time": 1606940160.0}, {"subreddit": "democrats", "text": "It’s Kyrsten Sinema. The purple wig is a statement to symbolize the ‘purpling’ of politics in Arizona.", "time": 1606940029.0}, {"subreddit": "democrats", "text": "For the life of me I have no predictions (yet) of who the three are. Someone with money that would live with being pardoned on their resume. Possibly NRA leadership or ex leadership. Wayne LaPierre.", "time": 1606908560.0}, {"subreddit": "democrats", "text": "“My own family members — those receiving Social Security and Medicare — repeat the dog whistle of “evil socialism”. “", "time": 1606908531.0}, {"subreddit": "democrats", "text": "Republican: It’s rude to use the n word in public now. What? No!", "time": 1606908296.0}, {"subreddit": "democrats", "text": "And he is. Very diverse in age, sex,  and race.", "time": 1606908235.0}, {"subreddit": "democrats", "text": "A little outdated but: https://www.brookings.edu/research/reducing-poverty-the-democratic-way/\n\nAnd by the way, Biden’s new economic team did introductions yesterday. The members had a lot to say in this regard. It was very encouraging. Listen: https://www.cbsnews.com/news/biden-economic-team-introduction-help/", "time": 1606907994.0}, {"subreddit": "democrats", "text": "I have no faith in Florida yet. Latino males thought Trump was macho. They like macho (isn’t Macho a Latino term?). But they are voting against their interest because Republicans bombarded this demographic with fear of Socialism taking hold, which it’s not. Power of propaganda. Democrats would be more about opportunity for the Latino community.", "time": 1606905998.0}, {"subreddit": "democrats", "text": "Most Democrats, Including the President-elect, will not defund the police. Biden has already stated this. The changes will be training, hiring, specialization. So it’s probably more funding and added initiatives to handle a situation with the proper resources. More Hill Street Blues, less Serpico.", "time": 1606905755.0}, {"subreddit": "republicans", "text": "It’s Yahoo. So Yahoo news is anti Trump propaganda?", "time": 1606853200.0}, {"subreddit": "democrats", "text": "This is so up in the air. Anything could happen.", "time": 1606810270.0}, {"subreddit": "democrats", "text": "I totally agree with this. FOX News was already the drug before Trump. I really don’t know specifically why and how Trump became the big thing, maybe that Trump just totally insulted Jeb Bush who was a very blah candidate right away and the Republicans were looking elsewhere in the lineup. Trump started saying what many racist or conspiracy theory minded Republicans were thinking.", "time": 1606806519.0}, {"subreddit": "democrats", "text": "This is, basically, propaganda. So propaganda people will now be spending the next four years making up and digging up bullshit. Why not bring back Tara Reade? Or other stupid fabrications. Welcome back trolls. Where have you been lately?", "time": 1606785293.0}, {"subreddit": "democrats", "text": "I can’t even understand you. I could care less about what you think of me. Your take sounds delusional. You appear to be trolling this sub.", "time": 1606785055.0}, {"subreddit": "democrats", "text": "Thank you!", "time": 1606776515.0}, {"subreddit": "democrats", "text": "Fix your grammar.", "time": 1606776443.0}, {"subreddit": "democrats", "text": "Fundamentally (fix your spelling, please), nothing will really change if you consider life in the US before Donald Trump. Things that existed then will be built back once again, but better. Taxes: only those that make over $400,000 a year will see a tax increase. Wall Street will continue to function. People will continue to get government assistance. Climate change has always been a priority for Democrats, you’re going to get nothing with Republicans in that regard. Biden DID change in this regard with a new cabinet position. Immigration reform was already another priority with Democrats, such as DACA and humanitarian efforts as well as limitations. I would doubt Biden is going to change the electoral college. We have institutions and Biden will bring back (better lol) those institutions so needed that Donald Trump just either gutted or abused. Basically, your complaint really doesn’t mean much.", "time": 1606776294.0}, {"subreddit": "democrats", "text": "A victim of their stop the steal effort. Benghazi will live on forever won’t it? I surprised the Clinton body count is not mentioned.", "time": 1606771156.0}, {"subreddit": "democrats", "text": "Is it too late to register?", "time": 1606770562.0}, {"subreddit": "democrats", "text": "He has immigrants and who hates the poor? Weird take. Different people for different roles. I wouldn’t mind seeing Yang in there though.", "time": 1606770424.0}, {"subreddit": "democrats", "text": "Hmmmm. Democrats that want Republicans in power. Well, I guess they are...Republicans.", "time": 1606754406.0}, {"subreddit": "democrats", "text": "Isn’t that ironic. Isn’t that Karma.", "time": 1606754298.0}, {"subreddit": "democrats", "text": "She doesn’t say diverse. She’s giving a cheer for woman, implying that more women means competence and integrity.", "time": 1606753693.0}, {"subreddit": "democrats", "text": "My teacher did this and recovered pretty quickly. He missed a stair going down.", "time": 1606753556.0}, {"subreddit": "democrats", "text": "He’s gonna do the white power. I’ll never forget that guy behind Trump at the rally that literally did it nonstop. HashtagFascistMemories...", "time": 1606753373.0}, {"subreddit": "democrats", "text": "I have to admit, Biden’s team kicks ass. Agree?", "time": 1606753329.0}, {"subreddit": "democrats", "text": "What?", "time": 1606753286.0}, {"subreddit": "democrats", "text": "If Trump runs again I will vote immediate. I would vote for a lampshade before Trump.", "time": 1606682661.0}, {"subreddit": "republicans", "text": "And you got ripped off by Bannon.", "time": 1606645973.0}, {"subreddit": "republicans", "text": "Fester Jr. ‘I love it’", "time": 1606645914.0}, {"subreddit": "democrats", "text": "Almost 7 million votes.", "time": 1606644886.0}, {"subreddit": "democrats", "text": "Missing: Devin Nunes", "time": 1606644693.0}], "republican_score": 4, "democrat_score": 91}