{"name": "Extractor41", "posts": [{"subreddit": "democrats", "text": "Department of Justice Ferguson Police\n", "time": 1594320308.0}, {"subreddit": "democrats", "text": "that hair is awesome!", "time": 1606947932.0}, {"subreddit": "democrats", "text": "It’s not enough.", "time": 1605675408.0}, {"subreddit": "democrats", "text": "100% agree.  I cannot believe I forgot guns.  For real... my conservative friends love guns.  The dems just need to let go of gun control as an issue.  They need to accept that fighting guns is a losing issue and they can address the crime rates by improving economic and home ownership in violent areas.", "time": 1604596114.0}, {"subreddit": "democrats", "text": "Honestly... I have lived in red states my whole life.  There are a lot of moderate republicans that are sick of the party, but they cannot leave over abortion, and they view democrats as communists.  On abortion, I think democrats have failed to explain that sex education actually lowers unwed pregnancies and lowers abortion rates.  For these people that think abortion is murder... you just will not convince them otherwise... so okay... lets all agree abortion isn't anyones first choice... so lets get together and get the lowest rate possible.  And on the issue of communism... The democrats have to make the case that expanding social programs, education, universal health care will not lead to take over of personal property and the government controlling the economy.  By opening the doors on abortion and communism you could move massive numbers of moderate  republicans.  EDIT:  Guns.  Dems need to soften on gun control.  It doesn't work and it pisses people off.  Focus on lowering crime rates by improving economic opportunity and housing in high crime areas.", "time": 1604588583.0}, {"subreddit": "democrats", "text": "Differences can be challenging.  However, if you only associate with people exactly like you... you might find yourself in a lonely world.  There is a wide range of belief and values even within the democrat party.  My family is largely conservative (mormon).  I disagree with much of what they stand for... yet... it I do see good things in conservativism as well.  I found that pointing out small areas where we agree goes so far in building common ground and keeping family relationships strong despite our different beliefs.", "time": 1603384741.0}, {"subreddit": "democrats", "text": "honest question... I thought \"tough on crime\" doesn't really work at solving social problems.  It didn't work for homelessness, or drugs... why would it work for LGBTQ?  I expect a better solution from Biden.", "time": 1602597923.0}, {"subreddit": "democrats", "text": "I'm also in KS and will be voting for Bollier!  :)", "time": 1602514350.0}, {"subreddit": "democrats", "text": "I will be voting for her!  There is change happening in kansas.  I have friends that are working in republican congressional races and they are very worried about losing.", "time": 1602510465.0}, {"subreddit": "democrats", "text": "I’m in Kansas.  I know people working on republican campaigns... they are scared of losing and I love it.", "time": 1602273738.0}, {"subreddit": "democrats", "text": "perfect", "time": 1602175400.0}, {"subreddit": "democrats", "text": "paying family as consultants, models, or paying \"rent\" to yourself to hold business meetings on your own properties are all common legal tax loopholes.  I know of a dozen people who routinely do this and save thousands on taxes.  It sounds like trump took it to the next level.", "time": 1601393380.0}], "republican_score": 0, "democrat_score": 12}