{"name": "boukatouu", "posts": [{"subreddit": "democrats", "text": "I'm hoping that once Biden sets a serious tone with the Congress, the Congress will respond by getting serious. This is a hope, but not really an expectation.", "time": 1607118480.0}, {"subreddit": "democrats", "text": "I hope it gets passed! Given how tough it would be to get a constitutional amendment through to establish the popular vote for president, the compact seems like the only remedy for the outdated Electoral College system. I almost always vote Democratic, and I'm tired of my vote being completely negated in predominantly Republican Ohio!", "time": 1594605626.0}, {"subreddit": "democrats", "text": "The National  Popular Vote Compact has to be passed by state legislatures. A Democratic U.S. House and Senate can't do it.", "time": 1594579240.0}, {"subreddit": "democrats", "text": "Too late. The Republican party belongs to Trump and they're stuck with him.", "time": 1589502914.0}, {"subreddit": "democrats", "text": "We've known he is unhinged all along, but the Cabinet is never going to invoke the 25 amendment. He should have been removed in the impeachment, but the Republicans sold their souls to keep him in office.", "time": 1588209141.0}, {"subreddit": "democrats", "text": "No, but Americans seem to believe that they are always just on the verge of becoming rich, so they don't want to vote for policies that would harm them once their ship comes in.", "time": 1583270060.0}, {"subreddit": "democrats", "text": "Buttigieg over Steyer--the last thing we need is another billionaire who has never held any elective office.", "time": 1582935710.0}, {"subreddit": "democrats", "text": "I am hoping that a massive turnout on the Democratic side will be fueled by an absolute repudiation of Trump and all he stands for. Trumps base will turnout, but I believe them to be a minority of the overall electorate. \n\nI will vote for the candidate who has a D after his or her name, regardless of who it is. I will also vote a straight Dem ticket all the way down the line. I used to be more independent and would sometimes vote for Republicans, but those days are over for the foreseeable future.", "time": 1582424561.0}, {"subreddit": "democrats", "text": "I agree, although I think most states have early voting and absentee voting that would allow most people to find a way to participate if they really wanted to.", "time": 1582421808.0}, {"subreddit": "democrats", "text": "Well, hell, yeah! It was never about \"the people having a say,\" it was about packing the Supreme  Court  with  conservative justices, wasn't it?", "time": 1581818990.0}, {"subreddit": "democrats", "text": "I agree. My senator, Rob Portman of Ohio, is a spineless worm who seems to have lost all integrity when faced with the demagogue Donald Trump.", "time": 1580961545.0}, {"subreddit": "democrats", "text": "\"Punishment\" is overkill. Politicians exaggerate their performance routinely.", "time": 1580830415.0}, {"subreddit": "democrats", "text": "A lot of Republicans left the party when whatshisname took over the party. The only ones left are the die-hard Trumpists.", "time": 1580756611.0}, {"subreddit": "democrats", "text": "She's already invited him for February 4.", "time": 1580497244.0}, {"subreddit": "democrats", "text": "Glad that you are so attentive to the affairs of government while you are in high school. I agree that the fact that so many Americans are supportive of Donald Trump sheds a discouraging light on our nation. Please do not give up, but prepare yourself to be the best, most enlightened voter you can be. Our country needs you going forward.", "time": 1580435742.0}, {"subreddit": "democrats", "text": "This proposal is rational and would help a lot of people who are now struggling to stay alive with the price gouging of the drug companies.\n\nPersonally, I'm in favor of universal health care. When people complain about the cost, they are overlooking the fact that WE ARE ALREADY SPENDING THE MONEY.  In fact, we are spending twice as much per person as some countries who cover everyone. We need to get what we are paying for.", "time": 1577582917.0}, {"subreddit": "democrats", "text": "Oh, boo-hoo!", "time": 1573005775.0}, {"subreddit": "democrats", "text": "You ARE making millions off your father's presidency, you dope!", "time": 1572532653.0}, {"subreddit": "democrats", "text": "And hopefully in prison.", "time": 1572396897.0}, {"subreddit": "democrats", "text": "And at least Trump would be out of office. I can't stand Pence, either, but I'm pretty sure that Trump's diehard base would not translate to Pence, thus making a Democratic victory more likely next November.", "time": 1572396870.0}, {"subreddit": "democrats", "text": "How anyone can doubt this man is a Russian asset, I do not know.", "time": 1572266011.0}, {"subreddit": "democrats", "text": "All these lifetime appointments need to be changed to some limited (20-year, for example) term. When the Constitution was written, people died in their 50's and 60's. Now we've got a bunch of justices who are older than dirt and there's no mechanism to get them off the bench until they die. I also think elected representatives should have a mandatory retirement age. Ffs, Dianne Feinstein is 85, Chuck  Grassley is 86. And anyone over 70 should not be allowed to run.", "time": 1571979960.0}, {"subreddit": "democrats", "text": "The elected Republican members of Congress didn't choose  Trump, he won the primaries. The actual members of the Republican party didn't feel they had a choice once he did that. It's  the Republican voters who are morons.", "time": 1571978908.0}, {"subreddit": "democrats", "text": "Yeah, but didn't we say this about Hillary?", "time": 1569786971.0}, {"subreddit": "democrats", "text": "I get what you're saying, but I'm done with Republicans. They all need to go to reeducation gulags.", "time": 1569614085.0}, {"subreddit": "democrats", "text": "I think  many \"independents\" are heavily  tilted one way or the other. I've always called myself  an independent, but I  almost  always  vote Democratic. It's the few times that I have voted for a Republican candidate that have kept me from identifying as a Democrat. Even now, when I can't  imagine voting for any Republican for the foreseeable future, I  still find it difficult to call myself a Democrat.", "time": 1569531331.0}, {"subreddit": "democrats", "text": "I think they've waited as long as they could, realistically. We're already running up against next year's elections.", "time": 1569440611.0}, {"subreddit": "democrats", "text": "Frankly, the more golf he plays, the less damage he is doing.", "time": 1565541569.0}, {"subreddit": "democrats", "text": "They know they can't win in an honestly run election. It takes foreign interference, gerrymandering, voter suppression, etc for Republicans to get a majority.", "time": 1564171474.0}, {"subreddit": "democrats", "text": "There's a long way to go until the election, but this allows me to have a little hope.", "time": 1564171238.0}, {"subreddit": "democrats", "text": "If the House Democrats don't have the courage to open an impeachment inquiry, they will share the blame.", "time": 1563915171.0}, {"subreddit": "democrats", "text": "She is, indeed, contemptible.", "time": 1563909846.0}], "republican_score": 0, "democrat_score": 32}