{"name": "jayclaw97", "posts": [{"subreddit": "politics", "text": "Democrats Are Already Looking Ahead to 2022 Midterms\n", "time": 1606858694.0}, {"subreddit": "politics", "text": "The race to get Georgia’s 23,000 17-year-olds registered to vote\n", "time": 1605728763.0}, {"subreddit": "democrats", "text": "Three burns in one tweet\n", "time": 1603389768.0}, {"subreddit": "democrats", "text": "Michigan would be carbon-neutral by 2050 under Whitmer climate change plan\n", "time": 1600964407.0}, {"subreddit": "democrats", "text": "Flint sheriff walks with protesters.\n", "time": 1591115450.0}, {"subreddit": "politics", "text": "Let’s be honest: This is either about continuing to marginalize minorities or complete ignorance of current science. Neither is a good look.", "time": 1607125476.0}, {"subreddit": "politics", "text": "Barack Obama is a wise man. He’s right.", "time": 1606958797.0}, {"subreddit": "politics", "text": "The last thing we need is to fight amongst ourselves.", "time": 1606958567.0}, {"subreddit": "politics", "text": "There was no pivot, no about-face. This is who Mitch McConnell has always been - a soulless, snake-licking, petty humanoid turtle.", "time": 1606958525.0}, {"subreddit": "democrats", "text": "I’m praying that we end up with two more come January, but for now, from Michigan to Arizona, thank you.", "time": 1606955798.0}, {"subreddit": "politics", "text": "Bag Man gets more and more applicable every day.", "time": 1606887354.0}, {"subreddit": "politics", "text": "Ladies and gentleman, that man *is a goober*.", "time": 1606864630.0}, {"subreddit": "politics", "text": "We will certainly lose if we don’t try.", "time": 1606864509.0}, {"subreddit": "politics", "text": "Unfortunately, the Trump administration has granted us loads of campaign fodder to utilize. We have to tie the rank-and-file GOP to Trumpism and make sure America doesn’t forget the connection. In the meantime, all I can do is pray that the GOP undergoes some kind of reformation so that they are again on the same plane of reality as the Dems are.", "time": 1606864461.0}, {"subreddit": "politics", "text": "Different subtypes of the parties fare better in certain areas. Sometimes you have to make some adjustments to get more accomplished.", "time": 1606864318.0}, {"subreddit": "politics", "text": "That is also true. If there’s one thing this whole debacle has taught us, it’s that history may be a guide, but it certainly isn’t an absolute prediction. After all, incumbent presidents very rarely lose in America, and yet one just did.", "time": 1606864208.0}, {"subreddit": "politics", "text": "Exactly. That’s why I’m already planning where my donations will go after Georgia’s runoffs are over. I’ll be volunteering nice and early.", "time": 1606864135.0}, {"subreddit": "politics", "text": "It’s gonna take a great deal of effort, especially if the Senate stays red.", "time": 1606864092.0}], "republican_score": 0, "democrat_score": 4}