{"name": "UserGuy29", "posts": [{"subreddit": "democrats", "text": "Best. Campaign. Line. Ever. 👍", "time": 1607143738.0}, {"subreddit": "politics", "text": "Cory Booker had a similar idea to give each baby a $1,000 \"savings bond\" or something similar with withdrawal restrictions until a certain age. Starting a 401k at birth would help. But I love this idea no matter how the program is structured.", "time": 1607109199.0}, {"subreddit": "politics", "text": "Either scenario would be wonderful. The only downside is her Orange County, California district was reliably Republican and I'm not sure there's another Katie Porter to take her place.", "time": 1607103307.0}, {"subreddit": "politics", "text": "Or change Election Day to Saturday or Sunday or even better Friday, Saturday AND Sunday.", "time": 1607102837.0}, {"subreddit": "politics", "text": "😂🤣😜😅👍", "time": 1607101542.0}, {"subreddit": "politics", "text": "With any luck, by 2024 he'll be in prison or dead. Either way works for me.", "time": 1607095346.0}, {"subreddit": "politics", "text": "Geez, I like her a lot. We need more like her. 😁👏💯", "time": 1606971047.0}, {"subreddit": "politics", "text": "Devil's Advocate here.... Maybe Barr made this appointment, knowing full well about the eligibility rule, just to placate Dear Orange Leader. Barr knows it won't last but Trump is so ignorant he'll think that the Russia hoax will be exposed by Durham. Barr met with Trump for 3 hours the other day and could hatched the plan. (I know what you're thinking \"Center-left conspiracy theorist\" here.) 😁", "time": 1606954823.0}, {"subreddit": "democrats", "text": "Everything you said spot-on and I fully agree. But if we have to go into this much explanation about what our slogan actually means, we've already lost the argument.", "time": 1606942815.0}, {"subreddit": "democrats", "text": "I live in Oklahoma and during the campaign I received several attack flyers in the mail targeting a Tulsa City Council race and one for a state Senate race that specifically used \"Defund the Police\" as their headline. When your \"rallying cry\" is used to delegitimize good Democrat candidates AND if you need to explain what your slogan actually means, then you have a bad/lousy/shitty (take your pick) slogan and you need a new one.\nP. S. The attack flyers both came from a group \"Oklahomans for MAGA\" but their address and phone number was fake.", "time": 1606942422.0}, {"subreddit": "politics", "text": "Can SCOTUS justices can be impeached and removed? I'm not suggesting that but it might be good to have a hammer in the toolbox if needed.", "time": 1606868210.0}, {"subreddit": "politics", "text": "Has Trump been interested in any other race other than his own? He could care less at this point about the Senate. It would require he talk about someone other than Trump...that'll never happen. 😏", "time": 1606257422.0}, {"subreddit": "politics", "text": "And all GOP voters should listen to him and comply. Not voting will sure show them we mean business on election fraud. 🙄. /s", "time": 1606160113.0}, {"subreddit": "politics", "text": "You go Brian!! 👍💯👌👆🎉", "time": 1606102935.0}, {"subreddit": "politics", "text": "Kelly Loeffler owns the Atlanta WNBA team. Favor for a friend? 🙄", "time": 1606005092.0}, {"subreddit": "democrats", "text": "Donated and Thank You for your good work.", "time": 1605813744.0}, {"subreddit": "politics", "text": "Isn't what Trump did in Michigan basically the same as what Lindsey Graham did in Georgia?", "time": 1605811548.0}, {"subreddit": "politics", "text": "Could a bipartisan commission be convened to ensure that \"election fraud\" (GOP words and arguments) doesn't happen again? The GOP have screamed fraud for weeks so shouldn't they want to eliminate it? I know this was the most secure election to date, but put the GOP on the back foot so they have to explain how they envision to avoid this in the future? 🙄", "time": 1605810264.0}, {"subreddit": "politics", "text": "I'll never forget or forgive the Presidential Medal of Freedom he gave to Rush Limbaugh.", "time": 1605807361.0}, {"subreddit": "politics", "text": "I just watched the video. I had no idea Trump was such an expert in so many topics...too bad he didn't use any of it while governing. 🙄\n\nI also clicked I on the YouTube suggested video of President Obama bestowing the Presidential Medal of Freedom (with Distinction!) to Joe Biden. The grace and humility of the now President-Elect is so moving. I wish all the Trump voters would watch this and understand that Joe Biden is our best hope for a better future. Thank you, Mr. President (both of you.) 😌", "time": 1605726818.0}, {"subreddit": "politics", "text": "Maybe he can get his old job back on Jan 21. Or sooner by joining the Biden transition. We need his talents and leadership.", "time": 1605718942.0}, {"subreddit": "politics", "text": "Question:  Could she issue the ascertainment against the President's order? What would happen? She's out of a job in 2 months anyway. Also, I think there are companies or organizations that are sympathetic to Trump and would be happy to welcome for her \"patriotic\" actions.", "time": 1605654161.0}, {"subreddit": "democrats", "text": "I heard a post-election interview with a Trump voter. He couldn't believe that 78mil people voted for Biden. He thought it had to be rigged because there couldn't be that many people that voted against Trump. That comment really amplified for me the gulf in truth between Dems and GOP  voters.", "time": 1605566253.0}, {"subreddit": "politics", "text": "In Oklahoma the GOP dominant legislature has been cutting back on education funding for 20-30 years and pushing for charter schools and vouchers . I'm not sure this is a conspiracy, but if you wanted you keep an electorate happy and dumb, cutting and messing with public education would be a way to go. Just sayin'. 🤔", "time": 1605208790.0}, {"subreddit": "politics", "text": "Thank you, Senator Lankford.  I don't agree with all of your actions but I feel you are a man of character and will do this.", "time": 1605164897.0}, {"subreddit": "politics", "text": "Good advice. I'll remember that when I run for president. 😅", "time": 1605164403.0}, {"subreddit": "politics", "text": "I heard Lt Gov Patrick would pay it out of his campaign funds.", "time": 1605131028.0}, {"subreddit": "politics", "text": "I don't think Trump gets embarrassed, just angry. He knows it's a losing proposition. It may be that he's setting things up so he can use this \"corrupt election\" to claim he's a victim of the treasonous Dems in the future.", "time": 1605128604.0}, {"subreddit": "democrats", "text": "Asking for a friend... Could/Should Ossoff and Warnock run a joint campaign?", "time": 1605122208.0}, {"subreddit": "politics", "text": "PBS is running a a series called \"Rise of the Nazis\" on Tuesdays @ 9:00E/8:00C or stream on the PBS app or Roku. The first episode covers how Hitler was able to get into power. It has a lot of background I didn't know about but is disturbingly parallel to current events. The only thing that Hitler had going for him that Trump doesn't was a parliamentary system allowing elections to be called whenever. Also, he was much smarter politically than Trump (obviously) will ever be.", "time": 1605120981.0}, {"subreddit": "politics", "text": "😂", "time": 1605108530.0}, {"subreddit": "politics", "text": "You know, I wonder if it was a disgruntled Trump staffer that booked Four Seasons Landscaping....on purpose. 🙄", "time": 1605106314.0}], "republican_score": 0, "democrat_score": 6}