{"name": "thetribuneoftheplebs", "posts": [{"subreddit": "democrats", "text": "Spotted in Boston... because \"Fuck your feelings\" is a coherent policy platform 🙄🙄🙄\n", "time": 1603647700.0}, {"subreddit": "democrats", "text": "I didn't mean to say there was a moral equivalency, but there is a maturity equivalency and how Democrats conduct ourselves in victory is important in how the country moves forward from this election. It's quite hypocritical to whine about how Trump supporters behave and then turn around and be excited to act the same exact way. Like just grow up lol. 80 million people voted for Biden in part because they are sick of shit like this. And it seems like a lot of people who voted for him are happy to ignore the message of unity and seriousness he is trying to send. This is a serious moment for the country and we should all be taking it a little more seriously instead of treating it like your team just won the Super Bowl.", "time": 1607218139.0}, {"subreddit": "democrats", "text": "If you are relishing the thought of treating Trump supporters the way they treat others, you are no better than them and helping to raise the political temperature. Pretty simple actually.", "time": 1607179977.0}, {"subreddit": "democrats", "text": "Congratulations! You are part of the problem.", "time": 1607176349.0}, {"subreddit": "democrats", "text": "It is on BU campus, could very well be dorms", "time": 1603653281.0}, {"subreddit": "democrats", "text": "Wow that's a great eye!", "time": 1603653257.0}, {"subreddit": "democrats", "text": "Trump and Biden fighting, very very frightening!", "time": 1595004637.0}, {"subreddit": "democrats", "text": "Hey I totally get that, every family is different and like I said in my initial comment, it's really about how you're going to feel about it later. Seems like you'd be fairly comfortable so I say follow your heart on this one. And keep up that work! It's always good to see people rolling up their sleeves and getting involved. Gives me hope for November.", "time": 1593612088.0}, {"subreddit": "democrats", "text": "My grandmother is a a Trump supporter and I totally understand the frustration but I would never call her \"fucking stupid\" to her face. I'm almost 30 and my mother would probably still slap the shit out of me. I would also consider how you might feel about treating your grandparents this way once they die. My other grandmother died in September, she was a dyed-in-the-wool Democrat but I had inadvertently drifted away from her in recent years and felt like shit over it when she died. It definitely changed my perspective on how I treat my Trump supporting grandparents as I had skipped some holidays and generally steered clear of them to avoid the Trump talk. Personally, I would just let it roll off my back. I noticed in another comment on this thread that you are involved with the local party and politically active. Keep that up, that's amazing. But calling grandma \"fucking stupid\" at this years 4th of July picnic isn't going to advance anyone's cause or make anyone change their minds. But hey, if you want to cut your familial ties over it that's up to you, it doesn't make you a better or worse person, you've just gotta live with your choice.", "time": 1593611156.0}], "republican_score": 0, "democrat_score": 9}