{"name": "R6IqicyThiccyMain", "posts": [{"subreddit": "democrats", "text": "Guys he's just sharing. Sharing is caring", "time": 1607172571.0}, {"subreddit": "democrats", "text": "What? I swear to God my party gets dumber everyday.", "time": 1606897403.0}, {"subreddit": "democrats", "text": "I AM NOT A CROOK -Nixon", "time": 1606584641.0}, {"subreddit": "democrats", "text": "Well the top 20% already pay 87% of  income taxes and they are really good for our economy you have to realize If they can save a dollar they will so there would be a high chance they leave and stop paying income tax that's ALOT of money if several of them do that.", "time": 1606413356.0}, {"subreddit": "democrats", "text": "Love the fact I was upvoted then when this post became popular I was downvoted for saying I was a republican", "time": 1606412836.0}, {"subreddit": "democrats", "text": "I called her a Karen", "time": 1606412561.0}, {"subreddit": "democrats", "text": "Was that not a joke I genuinely thought it was", "time": 1606383763.0}, {"subreddit": "democrats", "text": "Lol", "time": 1606382309.0}, {"subreddit": "democrats", "text": "Ok Karen are you gonna report me. Also it technically is cause we're talking about bezos", "time": 1606381591.0}, {"subreddit": "democrats", "text": "We weren't talking about him we were talking about the general topic and posts? Unless you mean comments I've said nothing about him.", "time": 1606380639.0}, {"subreddit": "democrats", "text": "Thank you I'm a republican and I can't understand why people crucify people like bill gates or big ceos even though they worked hard to get where they are most grew up poor like warren buffett he was extremely poor and spent the little money he had investing in the stock market. Or bill gates who started in his garage.", "time": 1606371166.0}, {"subreddit": "democrats", "text": "Okay so I am a republican but I don't believe there was any voter fraud but this is where fraud would actually change the outcome. I don't know or believe there is fraud in this but this is something I could kinda get if you wanted a recount.", "time": 1606346124.0}, {"subreddit": "democrats", "text": "Thanks for the new background lol", "time": 1606227853.0}, {"subreddit": "democrats", "text": "Nah the biggest loser is Alf Landon who only won vermont and maine biggest sore loser maybe", "time": 1606227826.0}, {"subreddit": "democrats", "text": "To be honest I really don't believe Trump is gonna win and I'm fine with that", "time": 1606219184.0}, {"subreddit": "democrats", "text": "I glanced at that and was like \"oh God another democrat who says biden is president\" but the I saw elect I respect you for that man.", "time": 1606109490.0}, {"subreddit": "democrats", "text": "I mean to be fair every politician lies", "time": 1606089305.0}, {"subreddit": "democrats", "text": "When they realize Christmas was started by pagans and Jesus was probably born in the summer", "time": 1606084332.0}, {"subreddit": "democrats", "text": "Is this real? Shit I don't like trump as much anymore", "time": 1606026004.0}], "republican_score": 0, "democrat_score": 19}