{"name": "goodthingsinside_80", "posts": [{"subreddit": "democrats", "text": "It’s the truth.\n", "time": 1606420907.0}, {"subreddit": "democrats", "text": "I am dying at this ornament. 😂\n", "time": 1605317840.0}, {"subreddit": "democrats", "text": "Everyone said my last sticker of Trump was too nice. Is this better?\n", "time": 1605142972.0}, {"subreddit": "democrats", "text": "Duh.\n", "time": 1604713084.0}, {"subreddit": "democrats", "text": "The only red hat you’ll see me wearing, by me.\n", "time": 1604538547.0}, {"subreddit": "democrats", "text": "This is lovely!", "time": 1607124677.0}, {"subreddit": "democrats", "text": "Yes and tantrums often involve tears. I’ve seen pictures of Trumpers crying on election night.", "time": 1606683417.0}, {"subreddit": "democrats", "text": "Yes, because they lack empathy and compassion. I don’t think that’s a selling point.", "time": 1606683085.0}, {"subreddit": "democrats", "text": "Bull Fucking Shit. He openly courts the Proud Boys. He calls white supremacists good people. He employs people like Stephen Miller who is KNOWN white supremacist and who created his abhorrent immigration policies of separating families and children. If you don’t think Trump supporters are just as racist as he is YOU are fucking blind. These people would absolutely\ndo worse if they thought they could get away with it.", "time": 1606439381.0}, {"subreddit": "democrats", "text": "That’s exactly why I made this. There have been quite a few images in the media where Trump supporters fly actual Nazi flags along their Trump flags. Not to mention that he employs white nationalists like Stephen Miller and refuses to denounce the Proud Boys. He’s a fucking white supremacist and if he could get away with doing even worse things to people of color he would.", "time": 1606439216.0}, {"subreddit": "democrats", "text": "He definitely was. I just think Trump wouldn’t hesitate to be just as bad if he thought he could get away with it.", "time": 1606429694.0}, {"subreddit": "democrats", "text": "Yeah.", "time": 1606429659.0}, {"subreddit": "democrats", "text": "I don’t watch Fox news but I see what those people post. They’ve completely lost touch with reality.", "time": 1606429627.0}, {"subreddit": "democrats", "text": "Do you really believe that Trump and Stephen Miller wouldn’t have killed people if they thought they could get away with it? They don’t mind splitting up families and caging children for months on end - and didn’t even bother to document who these children came with so that they could eventually be returned to their families. They don’t value anything but themselves and money. They may not have committed the same level of atrocities, but I absolutely believe they would if they thought they could get away with it. I have no doubt.", "time": 1606429546.0}, {"subreddit": "democrats", "text": "I’m truly sorry for what your grandparents went through. I agree that in the end Hitler was much much worse, and we must remember the true weight of his crimes. However, my belief is that if they were allowed to - Trump and Stephen Miller would absolutely allow similar atrocities to happen today. They are horrible, extremely racist people who hate anyone who isn’t like them. To me they deserve this awful comparison, and the people who support them and allow them to separate families and cage children deserve to know that they are in the same league with nazis, the people who committed the ultimate atrocities. \n\nSo really my point is not that they are exactly the same, but that the people who support Trump are absolutely the people who would have supported Hitler. And fuck those racist assholes.", "time": 1606429315.0}, {"subreddit": "democrats", "text": "There are still so many homes with Trump flags in my community. I really hope they start to come down but I doubt it.", "time": 1606423604.0}], "republican_score": 0, "democrat_score": 16}