{"name": "BlyKowski48", "posts": [{"subreddit": "democrats", "text": "Can someone point me to the article that stated that the Federal Government took coronavirus relief supplies and gave them to companies that sold them back to states.\n", "time": 1606285224.0}, {"subreddit": "democrats", "text": "Trump winning, Democrats:\n", "time": 1604817950.0}, {"subreddit": "republicans", "text": "Funniest thing I’ve seen all day\n", "time": 1604817497.0}, {"subreddit": "democrats", "text": "Ok Trumps a dictator\n", "time": 1604475145.0}, {"subreddit": "democrats", "text": "Fox News is so boring right now\n", "time": 1604469842.0}, {"subreddit": "democrats", "text": "No wonder she can’t get a job", "time": 1607100379.0}, {"subreddit": "democrats", "text": "Make them part of the FBI, the concept makes since, but there’s no value to have a whole department dedicated to it, you could cut costs by making it part of the FBI. Maybe even have it be the CIA.", "time": 1607100182.0}, {"subreddit": "democrats", "text": "Beautiful", "time": 1607093906.0}, {"subreddit": "democrats", "text": "Ladies and gentlemen, we are officially dealing with fascists", "time": 1606853926.0}, {"subreddit": "politics", "text": "This is how democracy dies", "time": 1606840563.0}, {"subreddit": "democrats", "text": "He needs to be arrested for that", "time": 1606840272.0}, {"subreddit": "democrats", "text": "Here’s what I don’t get, how can he block bills from going through without legal repercussions? This is obstruction of democracy. We need to put in a protocol that directs law makers on how and when to vote on bills so this doesn’t happen.", "time": 1606838648.0}, {"subreddit": "politics", "text": "Just because we take this stuff doesn’t mean we have to forget it", "time": 1606838416.0}, {"subreddit": "democrats", "text": "The electoral college was an old solution to an old problem", "time": 1606705541.0}, {"subreddit": "politics", "text": "Lol, can’t wait to see trump in cuffs", "time": 1605045638.0}, {"subreddit": "politics", "text": "Fuck Comcast", "time": 1604953752.0}, {"subreddit": "politics", "text": "Looks like Biden’s getting more votes", "time": 1604615111.0}, {"subreddit": "democrats", "text": "This is one of the funniest things I’ve ever seen", "time": 1604557890.0}, {"subreddit": "democrats", "text": "My freedom to life trumps their freedom not to wear a mask", "time": 1604528844.0}, {"subreddit": "democrats", "text": "Americans don’t understand freedom anymore", "time": 1604503394.0}, {"subreddit": "democrats", "text": "I thought I was part of a smarter, greater country. I was wrong", "time": 1604498449.0}, {"subreddit": "politics", "text": "Looks like we’re fucked either way", "time": 1604476982.0}, {"subreddit": "politics", "text": "If we last that long", "time": 1604476788.0}, {"subreddit": "politics", "text": "Shitshows a little too nice, how about fucking facist?", "time": 1604476678.0}, {"subreddit": "politics", "text": "It’s getting late, they’ll continue tomorrow morning", "time": 1604476652.0}, {"subreddit": "democrats", "text": "This piece of slime is destroying our democracy", "time": 1604475184.0}, {"subreddit": "democrats", "text": "Remember guys, the Republicans gerrymander with the congressional districts.", "time": 1604470588.0}, {"subreddit": "democrats", "text": "Ok but what about the United Sates, great for your country but if there’s no United States left to keep helping your country, what’s the point?", "time": 1604469278.0}, {"subreddit": "democrats", "text": "Looks like we agree on pretty much the same stuff, I agree that if you can use non lethal you should, but I’m just saying, if you run at a cop and he’s got a gun out, he may not have time to use the taser. If people didn’t resist police, we wouldn’t have this problem", "time": 1604356702.0}, {"subreddit": "democrats", "text": "If someone runs at a cop when there at gun point, what do you think is going to happen?", "time": 1604348219.0}, {"subreddit": "democrats", "text": "In my opinion, I think we need to make it mandatory for police to wear body cameras, we also need to refund the police academies so they have more money to train police. They’ll be able to deal with everything we are talking about now. Defunding the police is the worst thing possible right now. We need to make training more extensive so police can deal with all situations better. The last thing I have to say, if you’re being held at gun point by a cop, are you gonna run at the cop?", "time": 1604346964.0}, {"subreddit": "politics", "text": "I hate to defend these guys but unless they use violence, they’re not terrorist, I know they have, but a majority of the guys there are out there because they support trump and are stupid. It’s close terrorism but not quite there", "time": 1604346254.0}, {"subreddit": "politics", "text": "I usually defend the police, but this is just flat out wrong. Someone needs to be fired", "time": 1604346101.0}, {"subreddit": "democrats", "text": "I agree we need body cameras for all officers, but our ass of a President is dumb and hasn’t done anything. If someone runs from a cop with a knife he could take a hostage, if the hostage dies guess who’s fault it is, the police. If the cop shot the guy there would be a person still alive", "time": 1604345827.0}, {"subreddit": "democrats", "text": "That’s not right to assume they’re guilty just because they don’t have a body camera. That’s like saying you’re guilty of breaking into my house because you don’t have video evidence showing that you were at home", "time": 1604344928.0}, {"subreddit": "democrats", "text": "You are right, police are to protect and serve, and they need to try to protect the criminals too,  but they also have a duty to protect us. Often times they’re put in positions where they have to chose to protect us and themselves, or the criminal. Which one would you choose?", "time": 1604337033.0}, {"subreddit": "democrats", "text": "Tasers don’t always work, if you fire a gun it is considered lethal force wether it is meant as lethal force or not. Police are trained to shoot for center mass because that will eliminate the threat the fastest and the bullet has the least chance of going through and hitting someone else. Police can’t aim for a certain place on the body, if they miss they could hit a bystander. The thing to remember is that if nonlethal force doesn’t work and the suspect gets to the officer, he could get the officers gun and use it against the officers and others. If the suspect is armed, then he could kill the officer and continue his spree of crime. If someone is committing a crime and attacking an officer, I don’t want that officer to get hurt and then my life is in danger too. I agree that police need to work on de-escalating the situation, but de-escalating isn’t always possible", "time": 1604334172.0}, {"subreddit": "politics", "text": "These people need to be charged with obstruction of Democracy and Gerrymandering, or something like that", "time": 1604327004.0}, {"subreddit": "democrats", "text": "What about someone who has the capabilities of getting to lethal force and they are indeed trying to get lethal force, are police supposed to just sit there until the guy actually kills someone?", "time": 1604325629.0}, {"subreddit": "democrats", "text": "The police were executing a search warrant when they were fired upon, the home owner thought he wasn’t getting broken into and fired, both in the right. A tragedy indeed", "time": 1604273520.0}, {"subreddit": "democrats", "text": "What ever happened, she was found in her hallway", "time": 1604272513.0}, {"subreddit": "democrats", "text": "If she was sleeping, why was she found in the hallway?", "time": 1604271222.0}, {"subreddit": "democrats", "text": "If you cooperate with police you have nothing to fear. But I do agree that with trump we are close to facism.", "time": 1604269364.0}, {"subreddit": "democrats", "text": "Breanna Taylor was a tragedy, any death is, but if you’re an officer and get shot at, you’re gonna shoot back. Taylor was not shot while asleep. She died in the hallway", "time": 1604269209.0}, {"subreddit": "democrats", "text": "If they’re a danger to the public or an officer. I’m a Democrat through and through, this is the only thing I disagree with the Democrats on", "time": 1604268804.0}, {"subreddit": "politics", "text": "If trump declares himself victor before he’s actually called, even if he is called, then I don’t think he would hold onto power even if he did win", "time": 1604264050.0}, {"subreddit": "democrats", "text": "You get shot in America by not cooperating with police, or resisting police", "time": 1604263894.0}, {"subreddit": "politics", "text": "I don’t like calling for violence, but we need to protest this and demand that these republican filth step down from office or be charged with obstruction of democracy", "time": 1604204206.0}, {"subreddit": "democrats", "text": "The Republicans are at this point traders to the constitution, what’s so ironic is that you have these far right militia groups claiming that we, “the libtards” are a bunch of socialists who are trying to overrun this country.", "time": 1604204020.0}, {"subreddit": "democrats", "text": "Dude, send the bill to the state of Texas", "time": 1604026279.0}, {"subreddit": "politics", "text": "If votes in PA aren’t counted until Election Day, and the then they aren’t counted after Election Day and a bunch of people don’t actually end up with their votes counting, I say we de-legitimize his status as president and demand that he be removed along with all the republicans who attempted to surpress voters.", "time": 1603995788.0}], "republican_score": 1, "democrat_score": 35}