{"name": "literalrobot", "posts": [{"subreddit": "democrats", "text": "Republicans have no plan.\n", "time": 1605491438.0}, {"subreddit": "democrats", "text": "Question: Why do Republicans tend to vote more on Election Day and Dems tend to vote early?\n", "time": 1603949247.0}, {"subreddit": "politics", "text": "Maybe replaced by big data and AI.", "time": 1607194683.0}, {"subreddit": "politics", "text": "Worse, some people reportedly still deny it’s real on their deathbed.", "time": 1607166878.0}, {"subreddit": "politics", "text": "CA represents!", "time": 1607142661.0}, {"subreddit": "politics", "text": "Are all these loons brainwashed Manchurian Candidates?", "time": 1607061842.0}, {"subreddit": "politics", "text": "Biden’s being diplomatic. Though, it might help the MAGAs accept a tiny dose of reality.", "time": 1607061556.0}, {"subreddit": "politics", "text": "Am I responsible for my thoughts when I read stuff like this?", "time": 1607060077.0}, {"subreddit": "democrats", "text": "Has to be gradual right? Like a frog in a pot.", "time": 1607059652.0}, {"subreddit": "politics", "text": "Theater", "time": 1607059312.0}, {"subreddit": "politics", "text": "Whelp. That’s enough to make his Deutsche Bank payment.", "time": 1607058156.0}, {"subreddit": "democrats", "text": "It brings me a little bit of comfort knowing we outnumber the crazies.", "time": 1607052848.0}, {"subreddit": "politics", "text": "This.", "time": 1607052765.0}, {"subreddit": "politics", "text": "I’d be for this. I’d like the conservative SCOTUS to get a taste of the crazy aimed at them", "time": 1607052727.0}, {"subreddit": "politics", "text": "Is he really in consideration? All I see are articles saying he better damned well not be", "time": 1607052623.0}, {"subreddit": "politics", "text": "They will paint him as a martyr so the DoJ might as well be very thorough in their investigations and prosecutions.", "time": 1607052556.0}, {"subreddit": "politics", "text": "I guess this was predictable.", "time": 1607052403.0}, {"subreddit": "politics", "text": "So, 50 pardons then?", "time": 1607049022.0}, {"subreddit": "politics", "text": "Gotta say though, I like the hair.", "time": 1607048801.0}, {"subreddit": "politics", "text": "Same. I can hook them up with some shacks down by the river that wave their Trump flags non-stop.", "time": 1607048531.0}, {"subreddit": "politics", "text": "Never been interested in hanging a pic of a public figure in my home before, but a framed one of Fauci is tempting.", "time": 1607047845.0}, {"subreddit": "politics", "text": "Confession.\n\nI've grown fond of wearing a mask now that the weather is getting colder. \n\nAlso, I am def gonna start wearing a mask when I fly or take any kind of public transit in the future. And if I think I'm coming down with something, but still need to go out for food or medicine, gonna wear one then too.", "time": 1607047654.0}, {"subreddit": "politics", "text": "Newt witnesses the effects of his cause.", "time": 1607047493.0}, {"subreddit": "politics", "text": "I think a few choice scenes from GoT would do in a pinch.", "time": 1607047446.0}, {"subreddit": "politics", "text": "Welp. this one's gonna be controversial.", "time": 1607047224.0}, {"subreddit": "politics", "text": "It's basically the IRL version of Monopoly's Get out of Jail Free card. \n\nAt this point, I think there should be a lottery for all US citizens. I'd like one, you know, just in case I accidentally commit a federal crime.", "time": 1607046887.0}, {"subreddit": "politics", "text": "I'd say healthcare workers should be at the front of the line, since they are are the frontlines, but that's just me.", "time": 1607046566.0}, {"subreddit": "politics", "text": "I'd say it's Mitch throwing sand in the gears as usual.", "time": 1607046259.0}, {"subreddit": "politics", "text": "He'll look like a martyr to his worshippers regardless, so might as well go hard-in.", "time": 1607046048.0}, {"subreddit": "politics", "text": "As stated in another thread, \"greatest\" EXTERNAL threat. The US is doing a fine job destroying democracy all by itself thank you very much.", "time": 1607045955.0}, {"subreddit": "politics", "text": "Meh, but I'll take it.", "time": 1607045806.0}, {"subreddit": "politics", "text": "I foresee a lot of vaccine selfies in our near future.", "time": 1607045505.0}, {"subreddit": "politics", "text": "If Republicans lose seats, it will be their own fault. They embraced him. They invited them in.", "time": 1607045235.0}, {"subreddit": "politics", "text": "I am doubtful that her or her family will ever see the inside of a cell, but I hope they are at least dogged with public lawsuits for a very long time and I hope it gets very expensive for them.", "time": 1607044920.0}, {"subreddit": "politics", "text": "I am doubtful that her or her family will ever see the inside of a cell, but I hope they are at least dogged with public lawsuits for a very long time and I hope it gets very expensive for them.", "time": 1607044818.0}, {"subreddit": "politics", "text": "This is well deserved and I'm here for it.", "time": 1607044592.0}, {"subreddit": "politics", "text": "More of this please.", "time": 1607044527.0}, {"subreddit": "politics", "text": "Same with a lot Mormons. \n\nThey already believe in batshit crazy, so the conspiracies are not a stretch at all.", "time": 1607044430.0}, {"subreddit": "politics", "text": "As it should be. \n\nI don't hold a lot of hope that the Trump family and associates will get their due, but I really hope they do. Honestly, I'd be willing to join a religion and pray to whatever god could make this happen. I'd even pay tithing.", "time": 1607044320.0}, {"subreddit": "politics", "text": "Thank you.", "time": 1607043734.0}, {"subreddit": "politics", "text": "BTW, I appreciate your comments in this thread. The truly crazy Mormon stuff happens in their temples, specifically the Washing & Annointing and the Endowment. If you are curious, u/NewNameNoah snuck a camera into the temple and recorded the ceremony. His videos are on Youtube iirc.\n\nIt wasn't until my first time through the temple that I was finally like, \"Holy shit! I'm in a cult!\" Took me a while to leave after that, but I finally found the courage to do so.\n\nEdit: corrected the u/ mention.", "time": 1607043005.0}, {"subreddit": "politics", "text": "I tend to look at it with a similar sense as biological evolution. It happens, just difficult to see in the span of a human lifetime.", "time": 1607042075.0}, {"subreddit": "politics", "text": "Same, but I truly hope we are both wrong. I say that as someone who really likes being right.", "time": 1607041982.0}, {"subreddit": "politics", "text": "Yep. - Hank Hill", "time": 1607041883.0}, {"subreddit": "politics", "text": "I will be surprised if he attends.\n\nBut, if he does attend, I will be surprised if he doesn't pull some kind of attention stunt.", "time": 1607041699.0}, {"subreddit": "politics", "text": "I grew up in Idaho, and sometimes miss it. It really is a beautiful state. Then, when I go visit my parents and overhear the conversations while shopping or eating out, I'm quickly reminded why I'm glad I don't live there. That and the wind in SE Idaho is awful.", "time": 1607041512.0}, {"subreddit": "politics", "text": "Doesn't even come close to how long Hillary had to testify and answer questions either.", "time": 1607041092.0}, {"subreddit": "politics", "text": "Well, Idaho also has A LOT of conservative farmers who are very okay will federal subsidies so they probably won't care about this.", "time": 1607040825.0}, {"subreddit": "politics", "text": "Exmormon here. Can't lump all Mormons into one bucket when it comes to \"smart.\" However, I can tell you that I wouldn't classify most of my Mormon relatives in Idaho as smart or educated.\n\nMost Mormons in my life are Republican first and Mormons second.\n\nThere are progressive Mormons in Idaho, they are just VERY outnumbered and most likely on their way out of the religion.", "time": 1607040663.0}, {"subreddit": "politics", "text": "He probably can’t enforce, but supporting governors will help. Being consistent will help. \n\nEdit: also, I think he can enforce in federal buildings...", "time": 1607036430.0}, {"subreddit": "politics", "text": "Do you think he changes his own diapers?", "time": 1607023407.0}, {"subreddit": "politics", "text": "Nope. He may lose people at the edges, but not enough to lose the vast majority of his base. Their perspective and world view is shaped by disinformation, conspiracy and propaganda.\n\nWe must forge the way ahead, despite them.", "time": 1607023238.0}, {"subreddit": "politics", "text": "This is what I try and explain to my kids and nieces and nephews. They feel SO MUCH pressure to have their lives figured out at 18. It’s unnecessary stress and unrealistic.", "time": 1607015154.0}, {"subreddit": "politics", "text": "We can hope so.", "time": 1607013546.0}, {"subreddit": "politics", "text": "I said that four years ago about the current prez. Smh.", "time": 1606884145.0}, {"subreddit": "politics", "text": "I don’t think it’s real. Just bluster.", "time": 1606883641.0}, {"subreddit": "politics", "text": "Bad timing", "time": 1606868684.0}, {"subreddit": "politics", "text": "I’ve moved on to peanut M&M’s", "time": 1606868637.0}, {"subreddit": "politics", "text": "Is the fizzle now just a thin steam of smoke?", "time": 1606859900.0}, {"subreddit": "politics", "text": "Very much like a cult or religion.", "time": 1606752162.0}, {"subreddit": "politics", "text": "And then it was just a massive Californication orgy for days.", "time": 1606672751.0}, {"subreddit": "politics", "text": "If he shits himself while golfing, does he immediately head in to change, or does he sit and waddle in it to own the libs?", "time": 1606672405.0}, {"subreddit": "politics", "text": "The kid’s nickname is gonna be Lib. 😂", "time": 1606671261.0}, {"subreddit": "politics", "text": "His mind will change though as it spirals into deeper dementia.\n\nHe will just repeat the same stories every day, just like my grandpa.", "time": 1606670404.0}, {"subreddit": "politics", "text": "Maybe a bigger problem is broad generalizations that make it easier to deride and hate from afar.", "time": 1606669564.0}, {"subreddit": "politics", "text": "This made me tear up.", "time": 1606370691.0}, {"subreddit": "politics", "text": "I will never take a competent and empathetic president for granted again", "time": 1606370029.0}, {"subreddit": "politics", "text": "That was a really refreshing interview.", "time": 1606359838.0}, {"subreddit": "democrats", "text": "Creat jobs. Invest in education and healthcare.", "time": 1606359296.0}, {"subreddit": "politics", "text": "For down ballot. The presidential election has already been certified", "time": 1606357723.0}, {"subreddit": "politics", "text": "I borrowed it from the library. Looking forward to starting it tonight.", "time": 1606353664.0}, {"subreddit": "politics", "text": "👆", "time": 1606343743.0}], "republican_score": 0, "democrat_score": 5}