{"name": "FunctionBuilt", "posts": [{"subreddit": "democrats", "text": "STOP THE COUNT!\n", "time": 1604823209.0}, {"subreddit": "politics", "text": "This dude is everywhere. He’s got a great future ahead of him.", "time": 1607180853.0}, {"subreddit": "politics", "text": "Go to epochcrimes for a great map. They’ll never fill it out completely, it’ll just disappear from their website January 20th.", "time": 1607134350.0}, {"subreddit": "politics", "text": "So...is it over yet or are they recounting again?", "time": 1607126384.0}, {"subreddit": "politics", "text": "It's a shame that anyone has to waste time on these bullshit conspiracy theories to begin with.", "time": 1607108005.0}, {"subreddit": "politics", "text": "It's actually not a pun, it's a portmanteau.", "time": 1607106094.0}, {"subreddit": "democrats", "text": "California and New York almost never finish counting until December, they’re just called immediately with only 50ish% counted because statistically it’s impossible for Trump to win them.", "time": 1607100845.0}, {"subreddit": "politics", "text": "Tantrump", "time": 1607099194.0}, {"subreddit": "politics", "text": "Since Trump is a public figure, I wonder producers need life rights of any sort to make movies about the subject....", "time": 1607099146.0}, {"subreddit": "democrats", "text": "He obviously can’t leave his house because he’s wearing an ankle monitor under his boot...And I can’t believe I have to do this /s", "time": 1607069867.0}, {"subreddit": "politics", "text": "Hmmm, I wonder why all oversight was removed...HMMMMMMM", "time": 1607041973.0}, {"subreddit": "politics", "text": "Free stays at a Hamptons beach house stocked with food and booze? Private jet travel? Free use of a company car? There are all sorts of perks with extreme monetary value that don't need to be reported.", "time": 1607041452.0}, {"subreddit": "politics", "text": "A lot of executives are going to start making $399,999 and get awarded with some dubious non cash bonuses.", "time": 1607030895.0}, {"subreddit": "politics", "text": "RTJ will certainly do some kind of fund raiser. Killer Mike's passion for the well being of Atlanta is enormous.", "time": 1607028696.0}, {"subreddit": "politics", "text": "Don't throw away your shot, Georgia!!!", "time": 1607028558.0}, {"subreddit": "politics", "text": "I read half the title and my brain filled in \"Crashed a private plane\" and I actually got excited for a second.", "time": 1607014726.0}, {"subreddit": "politics", "text": "This is simultaneously been the longest and the shortest month.", "time": 1607013596.0}, {"subreddit": "politics", "text": "In 4 years, Trump will either be dead or campaigning virtually in between hospice nurses wiping his boom boom. He is not well, and the pressure release of not being president anymore will surely expedite his demise.", "time": 1607013481.0}, {"subreddit": "politics", "text": "r/Conservative is a goddamn cesspool.", "time": 1607013337.0}, {"subreddit": "politics", "text": "Hair dye and booger face deserve their own numbers unless you have them tying for first.", "time": 1606980066.0}, {"subreddit": "politics", "text": "Well you see, the evidence is under audit so he can't release it. Even if he could, it's so complex most people wouldn't even understand it.", "time": 1606958018.0}, {"subreddit": "politics", "text": "It’s pretty straight forward. 36% of our country is hopeless, and the other 11% are a mix of people that voted for Trump because he’s a republican or didn’t want to vote for Biden.", "time": 1606926238.0}, {"subreddit": "politics", "text": "Seems like he’s on track to paying off the $400M before he leaves office.", "time": 1606925585.0}, {"subreddit": "politics", "text": "Haven’t seen her since March.", "time": 1606846250.0}, {"subreddit": "politics", "text": "My aunt is a stubborn anti masker that wants to catch it so she can prove it’s just the flu. We have 3 nurses in our family who’ve tried to explain to her how bad it is when it’s actually bad and she just never gives an inch on her convictions.", "time": 1606842617.0}, {"subreddit": "politics", "text": "Desperation", "time": 1606841459.0}], "republican_score": 0, "democrat_score": 3}