{"name": "dustin_ginsberg", "posts": [{"subreddit": "democrats", "text": "BREAKING: District court in Nevada DISMISSES a case by the Trump campaign WITH prejudice! The court found the Trump campaign provided no credible evidence to contest the 2020 election. Trump is now 1-43 in court cases regarding the election\n", "time": 1607122292.0}, {"subreddit": "politics", "text": "BREAKING NEWS: The Supreme Court of Minnesota DISMISS the Trump campaigns lawsuit to delay certification of the re-election results. The court found the Trump campaign did not follow proper state law that required them to serve county officials, not the Secretary. Trump is now 1-43 in court cases\n", "time": 1607117665.0}, {"subreddit": "democrats", "text": "BREAKING NEWS: The Supreme Court of Minnesota DISMISS the Trump campaigns lawsuit to delay certification of the re-election results. The court found the Trump campaign did not follow proper state law that required them to serve county officials, not the Secretary.\n", "time": 1607117592.0}, {"subreddit": "democrats", "text": "BREAKING: Mark Kelly is now officially Senator Kelly!\n", "time": 1606936489.0}, {"subreddit": "democrats", "text": "I live in NY, does anyone know how I can help/phonebank for Ossoff and Warnock? I’m a college student and broke so I can’t donate but I wanna help in any other way I can?\n", "time": 1606884566.0}, {"subreddit": "democrats", "text": "BREAKING: Wisconsin certifies the 2020 election! Wisconsin Elections Commission Chairwoman Ann Jacobs officially confirmed the election result on Monday, sending it to Democratic Governor Tony Evers to appoint the electors who will cast the state’s 10 Electoral College votes\n", "time": 1606773821.0}, {"subreddit": "democrats", "text": "BREAKING: FCC chair Ajit Pai will official resign the office on January 20th, allowing Biden to appoint his successor\n", "time": 1606755139.0}, {"subreddit": "democrats", "text": "52-48. It’s why we need to win both GA seats for a majority", "time": 1606953681.0}], "republican_score": 0, "democrat_score": 7}