{"name": "pgsimon77", "posts": [{"subreddit": "politics", "text": "It might another futile meaningless gesture.... as long as Mitch McConnell is Senate Majority Leader .... but still it is something...", "time": 1607137721.0}, {"subreddit": "politics", "text": "What is so terrifying to everyone is he still has maybe a 20% chance of pulling it off....", "time": 1607112472.0}, {"subreddit": "politics", "text": "This reminded me of the whole plot of \"The Firm\" .....", "time": 1607112303.0}, {"subreddit": "democrats", "text": " that is a great portrait😁 may God grant him great health and long life....", "time": 1607112212.0}, {"subreddit": "politics", "text": "If it were any other kind of case that would probably be a sanctionable comment.... but we've all gone so far through the looking Glass at this point who knows?", "time": 1606883512.0}, {"subreddit": "democrats", "text": "Trumpism is a real thing and it is so f****** scary....but if we do nothing to address the economic suffering and misery in rural America then it will just grow and grow....", "time": 1606882822.0}, {"subreddit": "politics", "text": "Sometimes I still remember when it felt like to be a conservative; to go around thinking that the whole world was involved in some vast conspiracy to discredit you and your ideas.... Not a fun place to be", "time": 1606882312.0}, {"subreddit": "politics", "text": "Trumpians are reaping what they have sown with this s*** ......God help us all.....", "time": 1606805586.0}, {"subreddit": "democrats", "text": "They can't stop the election that's already happened and been counted and certified; but they sure would like to nip this whole voter participation thing in the bud before it gets out of hand....", "time": 1606805371.0}, {"subreddit": "politics", "text": "Exactly! Republicans have always wanted the public sector to be immobilized or effectively neutered, so that they could never do anything to help working class people....", "time": 1606688037.0}, {"subreddit": "democrats", "text": "You made me picture a kid throwing his spaghetti all over the kitchen floor and screaming at his mom....", "time": 1606687868.0}, {"subreddit": "democrats", "text": "Do we all get to have at least one f*** your feelings moment, before we proceed to solve in the problems of practical reality? After all that's what Democrats do, clean up messes left by Republicans, and then get blamed by the reactionary right.....", "time": 1606687832.0}, {"subreddit": "politics", "text": "Maybe by February we'll all be able to laugh about it, but it is still so scary and sad to me that a president of the United States tried to go full-on Mussolini on us, and was luckily stopped by the resilience of our institutions and the American voters...... But our democracy came so close to being wiped out", "time": 1606687404.0}, {"subreddit": "politics", "text": "\"Detroit, Atlanta, Philadelphia and Milwaukee are all major metropolitan  areas, which tend to favour Democrats and have large Black communities....\"   Conservative types have viewed the votes of black people as illegitimate for over 100 years....but no American President in modern times has had the gall to come  out and say it like that..... Wow", "time": 1606550403.0}, {"subreddit": "politics", "text": "Also unpatriotic and un-American .....", "time": 1606549984.0}, {"subreddit": "politics", "text": "I'll admit I had to look it up, but that is awesome, thanks + )", "time": 1606549757.0}, {"subreddit": "politics", "text": "And keeping the public sector hamstrung by massive deficits is a feature not a bug ... to them anyway....", "time": 1606547872.0}, {"subreddit": "politics", "text": "Well, they always have to come up some way to prevent social progress don't they ?", "time": 1606547739.0}, {"subreddit": "politics", "text": "All the Trumpers in Facebook land are convinced that he has some 11th hour trick up his sleeve .... God help us all....", "time": 1606547315.0}, {"subreddit": "politics", "text": "I wish I could borrow a fraction of that kind of money at his cost of capital;  then I would use it to develop housing that was functional and looked cool😁 no matter how Preposterous everybody has a dream right?", "time": 1606508873.0}, {"subreddit": "politics", "text": "Sometimes it seems like what we are witnessing is just a combination of trends that have been brewing for decades.... and now it's finally boiling over", "time": 1606508762.0}, {"subreddit": "politics", "text": "And the president of the United States keeps tweeting out not so subtle coded messages about the imaginary 'voter fraud\" ..... I mean by now we get it all alright, conservative types have considered the votes of black people illegitimate for the last hundred years or so....  but because he just won't let it go we are being set up for more trouble down the road....", "time": 1606508631.0}, {"subreddit": "politics", "text": "It looks like she wants to be the one to carry on the banner of trumpism into the future.... may God help us all", "time": 1606186892.0}, {"subreddit": "politics", "text": "You mean a writing job that would actually pay real $$$ ?    That is tempting = )", "time": 1606159406.0}, {"subreddit": "politics", "text": "If more people read his book they might feel differently .... I think Mr. Soros may be ultimately remembered more for his writings than anything else .....", "time": 1606159361.0}, {"subreddit": "politics", "text": "If only this would be a promise they would actually keep .....", "time": 1606158444.0}, {"subreddit": "politics", "text": " Exactly! They don't want to go on record as voting against popular bills....", "time": 1606001952.0}], "republican_score": 0, "democrat_score": 5}