{"name": "SnooBananas720", "posts": [{"subreddit": "democrats", "text": ">We still got 47 days trump\n", "time": 1607096593.0}, {"subreddit": "politics", "text": "Former IA representative and 2nd youngest to be elected to congresss Abby Finkenauer said to be under consideration for Biden's secretary of Labor\n", "time": 1606874485.0}, {"subreddit": "politics", "text": "Iowa board certifies Republican Miller Meeks won in Iowas 2nd district, by only 6 votes\n", "time": 1606780988.0}, {"subreddit": "politics", "text": "Miller-Meeks' lead shrinks to 6 votes over Hart after full recount in Iowa 2nd District race\n", "time": 1606689663.0}, {"subreddit": "politics", "text": "Miller-Meeks(R)' lead shrinks to 6 votes over Hart(D) after full recount in Iowa 2nd District race\n", "time": 1606689630.0}, {"subreddit": "democrats", "text": "After 6 yaers Jib jab has brought back their year in review\n", "time": 1606355269.0}, {"subreddit": "democrats", "text": "Democrats who's state or district that went red for another time, are any of you feeling like your vote has not say in your state and making you ashamed to live their?\n", "time": 1606189668.0}, {"subreddit": "politics", "text": "Iowas 2nd congressional district single closest House race in the country\n", "time": 1606161584.0}, {"subreddit": "democrats", "text": "This \" political joke compilation \" form the 60s tv show Laugh in, sadly show things have not changed in over 60 years. A-lot the jokes are sadly still relevant today if not more .\n", "time": 1605472590.0}, {"subreddit": "democrats", "text": "Iowa democrats are still on edge, because the 2nd distct race has still not been called, and the state has not updated its numbers since last Thursday. Preying for a win, and preying for maybe a last minute in the first\n", "time": 1604948679.0}, {"subreddit": "democrats", "text": "Jasper county in iowa found a error in their voting show democrat Rita heart in the lead of of Iowas 2nd district\n", "time": 1604760968.0}, {"subreddit": "democrats", "text": "Nevada right now\n", "time": 1604678322.0}, {"subreddit": "democrats", "text": "As if I need another reason to hate the GOP\n", "time": 1604594168.0}, {"subreddit": "democrats", "text": "With ballots outstanding and recount possible, Iowa U.S. House 2 race remains a question mark\n", "time": 1604535322.0}, {"subreddit": "politics", "text": "With ballots outstanding and a recount possible, Iowa US House District 2 race remains a question mark\n", "time": 1604534190.0}, {"subreddit": "politics", "text": "Statehood wins in Puerto Rico by 52.19%\n", "time": 1604531009.0}, {"subreddit": "democrats", "text": "We are likely to win the House, and the presidency, but not the senate. Lets try even harder then 2018/2020 combined in 2022!\n", "time": 1604528563.0}, {"subreddit": "politics", "text": "Puerto Rico statehood results live updates\n", "time": 1604441714.0}, {"subreddit": "democrats", "text": "Those lucky pittsburghans\n", "time": 1604373503.0}, {"subreddit": "democrats", "text": "Heres an Anti Trump Blues song for tomorrow\n", "time": 1604362486.0}, {"subreddit": "politics", "text": "Agreed, make her ambassador to the UK or something as a consolation prize , or  at the very least if at the very least the Administrator of the Small Business Administration if you want her on the cabinet .\n\nMaking her Department of labor may hurt her political career.", "time": 1606876209.0}, {"subreddit": "politics", "text": "Even as a proud  iowan who liked her ,  I would have never guessed in a million years she would be under  consideration for  Biden's  cabinet, and she would move up in the party faster then AOC", "time": 1606874869.0}, {"subreddit": "politics", "text": "100,000  I believe,  mostly from Johnson county(witch is the most liberal, youngest  and ethnically  diverse county in the state  mind you )  The iowa Supreme Court agreed they were  disqualified them", "time": 1606784054.0}, {"subreddit": "politics", "text": "Ritta Heart is likely to bring this to the iowa supreme court", "time": 1606783719.0}, {"subreddit": "politics", "text": "Yes, but I'd imagine the The iowa supreme court would likely side with miller Meeks, because they want it to be over don't want to start a local bush v gore, and are a conservative  majorty.\n\nThen agin this same Supreme Court, who made Iowa the third state in the union to legalize Same-sex marriage, and called the infamous \"Heartbeat bill\"  unconstitutional under  Iowa law, So who knows", "time": 1606783572.0}, {"subreddit": "politics", "text": "True,but they actually did lose alot of what are usually safe democrat districts", "time": 1606690978.0}, {"subreddit": "politics", "text": "Basically she will be the  representative because he won by 6 votes.\n\n  I believe this was the closest congressional race in usa  history", "time": 1606690078.0}, {"subreddit": "democrats", "text": "Same.\n\nTheir are MANY Republicans who are unhappy with trump in even some GOP senators dont like trump but follow him out of fear.\n\nMy question is why do  pepole in like these states see in him out side of \"Owning the libs\" Hes done nothing for either the framing or coal industry expect made them worst.", "time": 1606244126.0}], "republican_score": 0, "democrat_score": 13}