{"name": "Gracklefink3950", "posts": [{"subreddit": "politics", "text": "If there were anything DJT could do aside from squirm at this point the Biden camp would be on top of  it but their strategy of just let Trump be Trump has work JUST FINE so far.", "time": 1607224292.0}, {"subreddit": "politics", "text": "fabricated is at least a *kind* of evidence", "time": 1607190507.0}, {"subreddit": "politics", "text": "Unfortunately there's a good bet they're on a couple of \"lists\" alright...", "time": 1607190293.0}, {"subreddit": "politics", "text": "Why do you think the DOJ walked away from this as fast as they could?", "time": 1607190189.0}, {"subreddit": "politics", "text": "If you boil it down what they are saying is we have no evidence AT THIS TIME but we just bet there is so could we please go fishing for some? \n\nBecause that's how courts work now I guess.", "time": 1607190096.0}, {"subreddit": "politics", "text": "Maybe we could allow non-partisan journalists like Project Veritas to look into it?", "time": 1607189995.0}, {"subreddit": "politics", "text": "an ANGRY LETTER at the very least...", "time": 1607188827.0}, {"subreddit": "politics", "text": "People love to just keep inventing rules ans scenarios as they go along. Once Biden is sworn in you could PROVE widespread voter fraud beyond all shadow of anyone's doubt and it would still, quite literally, require an act of Congress to remove him. \n\nAnd if that meant ousting the VP as well then the Speaker of The House would become president. \n\nDJT wouldn't just roll back into the whitehouse lol.", "time": 1607188769.0}, {"subreddit": "politics", "text": "this post brought to you by /s-less gang", "time": 1607183612.0}, {"subreddit": "politics", "text": "I feel many of the sources \"reporting\" on this are sort of trying to *make* it a thing rather than it actually being a thing to be reported on ATP.\n\nGOTV GA", "time": 1607177742.0}, {"subreddit": "politics", "text": "And since they are admittedly only \"infotainment\" it seems they can't and won't be held to any semblance of conventional journalistic standards but whatevs", "time": 1607176394.0}, {"subreddit": "politics", "text": "> The Trump electors “did not prove under any standard of proof” that electronic voting machines malfunctioned in a way to raise reasonable doubt about the outcome of the election, nor did they prove that any state or county election officials misused the machines or any voting equipment. \n\nOh yeah? Well libs are going to be shocked to learn that  Joe Biden CAN'T be sworn in until this Judge PROVES that any state or county election officials *didn't* misuse the machines or any voting equipment!\n\nNow look at this Youtube video that clearly SHOWS Biden sneaking illegal ballots into the TCB center hiding them in that giant boot he always wears.\n\nCheck and Mate.", "time": 1607176190.0}, {"subreddit": "politics", "text": "There are a lot of *other* ways to \"tip\" a bro...", "time": 1607135437.0}, {"subreddit": "democrats", "text": ">because that’s all they were cultivated to care about\n\nThat's all they've been PRODDED to care about. \n\nWhat happens to this voting block if that prodding subsides?", "time": 1607135075.0}, {"subreddit": "politics", "text": "Wait till they start talking about the economy in January", "time": 1607129482.0}, {"subreddit": "politics", "text": "Or his GFC?", "time": 1607129157.0}, {"subreddit": "politics", "text": "I'm thankful for the men and women of the USPS and I'm leaving a FAT card for my carrier at xmas.", "time": 1607127997.0}, {"subreddit": "politics", "text": "Evidence of a consistent and trustworthy demeanor for sure.", "time": 1607120953.0}, {"subreddit": "politics", "text": " Judge Kenny made a finding that her affidavit did not corroborate any of the other affidavits (not surprising). \n\nNow that we've seen her testify, in all her glory,  it doesn't seem realistic to think that *any* Judge would find her or her story credible.", "time": 1607120811.0}, {"subreddit": "democrats", "text": "koo koo", "time": 1607102926.0}, {"subreddit": "democrats", "text": "Whatever. Take it to a COURT or shove it up your @ss. :)", "time": 1607102339.0}, {"subreddit": "democrats", "text": "They have a Youtube video of a TV screen showing an OAN report. lol \n\nThey have nothing that holds up in court so they, therefore, have nothing. \n\nNothing at all.", "time": 1607101344.0}, {"subreddit": "democrats", "text": "We can hope.\n\nGOTV GA", "time": 1607101100.0}, {"subreddit": "politics", "text": "Um... Reagan, W, Palin... It's their M.O.", "time": 1607038951.0}, {"subreddit": "politics", "text": "No she is a gift that will keep giving possibly for years to come.", "time": 1607038500.0}, {"subreddit": "politics", "text": "I mean how would you even *know*?", "time": 1607037669.0}, {"subreddit": "politics", "text": "Notice they waited until Arnold was recovering from surgery to pull this shit.", "time": 1607036720.0}, {"subreddit": "politics", "text": "*alphadavids*", "time": 1607035212.0}, {"subreddit": "politics", "text": "Did somebody forget to show them the affidavits?", "time": 1607034869.0}, {"subreddit": "politics", "text": "begging for the next Lofner", "time": 1607028150.0}, {"subreddit": "politics", "text": "Weirdest concession speech EVAR!", "time": 1606961101.0}, {"subreddit": "politics", "text": "lock clinton up, extort a foreign leader...", "time": 1606959116.0}, {"subreddit": "politics", "text": "The good thing is we won so WHO CARES WHAT THEY THINK?", "time": 1606958718.0}, {"subreddit": "politics", "text": "He doesn't have the support of the MARTIAL part of martial law tho.", "time": 1606958595.0}, {"subreddit": "politics", "text": "The overt racism is a feature, not a bug.", "time": 1606954468.0}, {"subreddit": "politics", "text": "Aisle 4 next to the Tiki torches.", "time": 1606954248.0}, {"subreddit": "politics", "text": "sounds like they have finally reached the bargaining stage", "time": 1606954010.0}, {"subreddit": "politics", "text": "It may have worked for Graham in S.C.", "time": 1606953833.0}, {"subreddit": "politics", "text": "Just how many times does DJT need to lose this election. \n\nHow many more MILLIONS of legitimate voters have to tell him to f@ck off before he finally does?", "time": 1606942538.0}, {"subreddit": "politics", "text": "Maybe the ghost of James Baker III visited Barr in a dream and slapped a little fuggin sense into him...", "time": 1606876997.0}, {"subreddit": "politics", "text": "Until McConnell says it isn't.", "time": 1606876361.0}, {"subreddit": "politics", "text": "Trump's concession or lack of one is quite unimportant and unnecessary.", "time": 1606861559.0}, {"subreddit": "politics", "text": "Wheels of BUS meet AG Barr", "time": 1606855050.0}, {"subreddit": "democrats", "text": "Election latest:\n\nOhio toddlers throw temper tantrum threaten to get their daddy to come beat you up.", "time": 1606853528.0}, {"subreddit": "politics", "text": "Why indeed.", "time": 1606850966.0}, {"subreddit": "politics", "text": "Or Mickey Mouse", "time": 1606774749.0}], "republican_score": 0, "democrat_score": 6}