{"name": "Sensitive_Plane4155", "posts": [{"subreddit": "politics", "text": "Don't expect Trump to accept reality anytime soon and concede the race, sources say\n", "time": 1604774748.0}, {"subreddit": "politics", "text": "Mitt Romney on Twitter accepting Biden as President-elect\n", "time": 1604774357.0}, {"subreddit": "democrats", "text": "Let’s hope Democrats win the senate so he won’t have a GOP roadblock to deal with. I’m hoping that Biden doesn’t govern timidly and makes some progressive change. Cautiously optimistic.", "time": 1607123224.0}, {"subreddit": "politics", "text": "Solid analysis", "time": 1607098982.0}, {"subreddit": "democrats", "text": "Great share!", "time": 1606848436.0}, {"subreddit": "politics", "text": "Facts my fellow Floridian", "time": 1606489547.0}, {"subreddit": "politics", "text": "Trump used flail, it had no effect.", "time": 1606489371.0}, {"subreddit": "politics", "text": "Can’t believe those two GOP numb nuts tried this shit.", "time": 1605711771.0}, {"subreddit": "democrats", "text": "“The governments all against us, that’s why I lost my job and got divorced. Think about it, I’m never in the wrong so it must be a conspiracy. Just look in Hillary’s emails.”", "time": 1605704625.0}, {"subreddit": "politics", "text": "I miss having an intelligent woman as First Lady. Looking forward to Dr.Jill Biden very very much!", "time": 1605669369.0}, {"subreddit": "democrats", "text": "Only 64 more days till Biden’s inauguration! Let’s be patient and hope for the best.", "time": 1605668819.0}, {"subreddit": "democrats", "text": "This is the takeaway I get as well. I feel like if we get enough motivated democrats especially after seeing their state flip, we might have a real chance in the runoffs", "time": 1605668748.0}, {"subreddit": "politics", "text": "Bro thank you for this. As a Floridian I knew our governor is a POS but this is next level. Will definitely be sharing!", "time": 1605668472.0}, {"subreddit": "politics", "text": "My man!", "time": 1605668310.0}, {"subreddit": "politics", "text": "Northern Florida is a shitty place what can I say. We’ll go blue again soon!", "time": 1605667908.0}, {"subreddit": "politics", "text": "Half of us don’t want his ass in Florida", "time": 1605667566.0}, {"subreddit": "politics", "text": "This isn’t the apprentice you jerk off", "time": 1605667537.0}, {"subreddit": "politics", "text": "The problem is half the country has his dick in their mouth", "time": 1605659380.0}, {"subreddit": "politics", "text": "Never argue with a fool, onlookers may not be able to tell the difference.\n-Mark Twain", "time": 1605412706.0}, {"subreddit": "politics", "text": "Thread 45 was one big FUCK YOU", "time": 1605401320.0}, {"subreddit": "politics", "text": "I’m from south Florida and they tried to scare every Cuban and Venezuelan voter into voting for trump. Every political ad was about stoping the left from radical socialism. People I spoke to were so misinformed I had to fight laughing at their talking points.", "time": 1605191493.0}, {"subreddit": "politics", "text": "Clearly why he won’t quit. The man will be prosecuted the first day after his presidency", "time": 1604926390.0}, {"subreddit": "democrats", "text": "If you’re already upset you voted trump good news you still have your sanity. Hop on my fellow American we’re RIDIN WITH BIDEN", "time": 1604926195.0}, {"subreddit": "politics", "text": "Si", "time": 1604869594.0}, {"subreddit": "politics", "text": "What a joke this guy is. How was he re-elected???", "time": 1604865933.0}, {"subreddit": "politics", "text": "They need to move on swiftly from trump but the 70million people that voted for him are the reason they’re hesitant. \n\nIt’s such a shame this is what the republican party has come to. Instead of being an adult in the room and accept the new president-elect they want to pander to the conspiracy and delusion of trumps base.", "time": 1604865800.0}, {"subreddit": "politics", "text": "It’s been reported that even his wife is telling him to concede. Trump has never had to face a loss head on like this and own up to it. Doubtful he doesn’t fight and whine till he forced to face the truth.", "time": 1604864978.0}, {"subreddit": "politics", "text": "This is awesome! I wonder how she will influence her husband’s choice for the secretary of education. She certainly has expertise in the field of education.", "time": 1604864835.0}, {"subreddit": "politics", "text": "Georgia is gonna get so much coverage in the next few months. They’re going to get everyone eligible to vote!", "time": 1604864409.0}, {"subreddit": "politics", "text": "Thank you for that explanation, removing those caps would definitely improve the electoral college process. If we remove the cap would that lead to the votes being weighted more equally between large population and small population states?", "time": 1604853464.0}, {"subreddit": "politics", "text": "Electoral college has got to go. More than four million more voters wanted joe Biden. Land is not more important than people.", "time": 1604851343.0}, {"subreddit": "politics", "text": "He is just rambling incoherently at this point lmao", "time": 1604847756.0}, {"subreddit": "politics", "text": "Trump must be losing his mind", "time": 1604847330.0}, {"subreddit": "politics", "text": "Anyone know odds dems can win the senate runoffs in Georgia?", "time": 1604777222.0}, {"subreddit": "politics", "text": "No more \"Did you see what the President tweeted?\"", "time": 1604777043.0}, {"subreddit": "politics", "text": "I think we all took a collective sigh of relief", "time": 1604776969.0}, {"subreddit": "politics", "text": "That would truly be a nightmare", "time": 1604776343.0}, {"subreddit": "politics", "text": "This entire week has been about the election coverage. I'm not disagreeing with your statement, Biden looks poised to have the necessary and appropriate response to Covid. But the national worry/conversation has dissipated and average citizens are not reacting with any sense of urgency to the rising spread.", "time": 1604776272.0}, {"subreddit": "politics", "text": "On the real tho Covid has been put on the back burner even as we reach new record daily cases", "time": 1604775751.0}, {"subreddit": "politics", "text": "Got emmmmm", "time": 1604775617.0}, {"subreddit": "politics", "text": "Donny boy isn't ready to face the truth: you guys were never the \"silent majority\" you are the **Loudmouth Minority** in this country.", "time": 1604775470.0}, {"subreddit": "politics", "text": "Lock him up!!!", "time": 1604775359.0}, {"subreddit": "politics", "text": "Does anyone think Trump will be at Biden's inauguration?", "time": 1604774516.0}, {"subreddit": "politics", "text": "Anyone thinking trumps impending financial problems are the reason he is fighting till he gets escorted out?", "time": 1604773514.0}, {"subreddit": "politics", "text": "I know I shouldn't expect much from Trump but for a second I thought he might concede.", "time": 1604773380.0}, {"subreddit": "politics", "text": "New president alert!!", "time": 1604767276.0}, {"subreddit": "politics", "text": "If it’s within .5% trump campaign has ask for a recount", "time": 1604761737.0}, {"subreddit": "politics", "text": "I’m with you they need to stop pandering to the loser", "time": 1604761273.0}, {"subreddit": "politics", "text": "Math on a Friday lmao", "time": 1604690306.0}, {"subreddit": "politics", "text": "Is today the day", "time": 1604689300.0}, {"subreddit": "politics", "text": "GA looks like there will be two runoffs. Special elections to be held by Jan.  \nhttps://www.google.com/amp/s/amp.cnn.com/cnn/2020/11/05/politics/georgia-senate-jon-ossoff-david-perdue-kelly-loeffler-raphael-warnock/index.html", "time": 1604675019.0}], "republican_score": 0, "democrat_score": 6}