{"name": "jdmiller82", "posts": [{"subreddit": "politics", "text": "Michigan election board certifies Biden win\n", "time": 1606167775.0}, {"subreddit": "politics", "text": "Trump administration revives talk of action on birthright citizenship\n", "time": 1605918963.0}, {"subreddit": "politics", "text": "Donald Trump Jr. tests positive for COVID-19\n", "time": 1605918816.0}, {"subreddit": "democrats", "text": "Opinion | Donald Trump vs. the United States of America\n", "time": 1569242884.0}, {"subreddit": "democrats", "text": "Beto 2020 calls multiply among Dems\n", "time": 1541998716.0}, {"subreddit": "democrats", "text": "I prefer a sedan", "time": 1607120261.0}, {"subreddit": "politics", "text": "Life without parole, anything less is a travesty", "time": 1607093013.0}, {"subreddit": "politics", "text": "Once a traitor, always a traitor", "time": 1606966007.0}, {"subreddit": "politics", "text": "I’ll say it again. I hate my senators (Cruz & Cornyn). I hate their BS hypocrisy. I hate that they keep winning their seats and that it’s still 4 years til we can try again to vote one of these frauds out.", "time": 1606931871.0}, {"subreddit": "politics", "text": "What sweet, sweet revenge that would be on all the Republicans if Obama were the first person Biden invited for a visit in the Oval. What a beautiful sight that would be", "time": 1606913232.0}, {"subreddit": "politics", "text": "Eight years as VP and decades in the Senate, Biden knows the White House better than Trump.\n\nTrump may claim to be boycotting the inauguration, but really it is not as though anyone wants him there anyway, so good!", "time": 1606913129.0}, {"subreddit": "politics", "text": "“The First Lady”", "time": 1606912771.0}, {"subreddit": "politics", "text": "Ah yes, pardons before they’ve even been tried or convicted of a crime, totally normal thing totally innocent people do...", "time": 1606912610.0}, {"subreddit": "politics", "text": "Donald Trump losing millions in another one of his ventures. No surprise there.", "time": 1606576313.0}, {"subreddit": "politics", "text": "54 days, just 54 more days!", "time": 1606502820.0}, {"subreddit": "politics", "text": "As if he has a say in the matter.", "time": 1606448163.0}, {"subreddit": "politics", "text": "it'll be the same excuse as before, the certification is a fraud and an attempt to \"steal\" his win", "time": 1606168083.0}, {"subreddit": "politics", "text": "Just look at all his business ventures throughout the years... He loses a lot.", "time": 1606168015.0}, {"subreddit": "politics", "text": "True, but when you have a President actively trying to subvert democracy, it matters.", "time": 1606167976.0}, {"subreddit": "politics", "text": "I really can't stand my senators.", "time": 1606103317.0}, {"subreddit": "politics", "text": "I think it is safe to say he is “the most”, not “one of the most”", "time": 1605830932.0}, {"subreddit": "democrats", "text": "and my \"rigged\" he means there wasn't enough suppression of the non-white vote.", "time": 1605470128.0}, {"subreddit": "politics", "text": "I hate to sound unsympathetic...", "time": 1605231635.0}, {"subreddit": "politics", "text": "Let the Trump lovers blow their money on this man’s con. Thats less money they can spend on other candidates and races, like down in GA", "time": 1605184839.0}, {"subreddit": "politics", "text": "Lets be real, nobody expects Trump to act like an adult, to follow norms. I'm willing to bet he will never concede and he will not attend the inauguration. He will retreat to Mar a lago and continue to claim fraud to his adoring cult on Parlor (as his Twitter account will almost surely be banned).", "time": 1605054110.0}, {"subreddit": "politics", "text": "When the lies are too much even for Trump’s propaganda machine...", "time": 1604966205.0}, {"subreddit": "politics", "text": "I made an [image](https://imgur.com/a/7NYplUj) I plan to use as a reply to all his tweets... I just want to help ground the guy in reality.", "time": 1604804463.0}, {"subreddit": "politics", "text": "New Biden campaign message: “Trump will leave you in the cold... literally!”", "time": 1603888459.0}, {"subreddit": "politics", "text": "I will make the 19+ hour drive to DC and march for sure if this happens", "time": 1603828490.0}, {"subreddit": "politics", "text": "As a Christian, the rise of Christian Nationalism and these so called Patriot Churches is very concerning. It’s very much a twisting of what Christianity is about. It is sickening.", "time": 1603799074.0}, {"subreddit": "politics", "text": "What an insufferable human being. Please, please, please let's vote this scumbag out.", "time": 1603296284.0}, {"subreddit": "politics", "text": "I'm not even surprised. This kind of two-faced hypocrisy is exactly what I expect from Republicans.", "time": 1603150734.0}], "republican_score": 0, "democrat_score": 4}