{"name": "icefire9", "posts": [{"subreddit": "democrats", "text": "Defund the military?  Wow! Endorsed!", "time": 1607017675.0}, {"subreddit": "democrats", "text": "To say that the parties switched is an oversimplification.  Racist southerners absolutely switched sides once Democrats started caring about civil rights, but there actually are some areas of continuity.\n\nRepublicans have always been the party of the business class, and a party for religious protestants (most abolitionists were highly religious WASPs).  Democrats have always been the party for immigrants (yes, even during the civil war era).\n\nDuring the early 1900s, both parties had internal struggles between progressives and conservatives.  FDR is when the ball got rolling- his economic policies appeal to African Americans leading to them mostly adopting the Democrats.  Over time, Democrats more and more became the party of civil rights, leading to a few third party 'Dixiecrat' presidential runs.  Eventually, Nixon saw the opening this presented with the 'southern strategy' i.e. get the racists on board by being 'subtly' racist.", "time": 1605409483.0}, {"subreddit": "democrats", "text": "Basically, racist southerners changed which party they supported as Democrats started caring more about civil rights and Republicans started appealing to their racism.", "time": 1605408435.0}, {"subreddit": "politics", "text": "Democrats took the Hispanic vote for granted.  Trump actually bothered to court and persuade Hispanics, specifically targeting them.  Hispanics turn on Democrats en masse.  Democrats: \\*Shocked Pickachu face.\\*\n\n\\---\n\nBiden's decision that the VP must be black is just one example.  What's wrong with a Hispanic running mate?  Why wouldn't a Hispanic running mate be any bigger of a deal than a black running mate?  What was there to gain from excluding hispanics from that process?\n\nBLM was all about police brutality against blacks, but don't Hispanics have to face the same discrimination from law enforcement.  Why weren't they included?\n\nOr look at the Democratic primaries.  Sanders won the Hispanic vote.  Yet the conversation was that Biden was supported by minorities because blacks voted for him.  Hispanics were ignored in the broader conversation, they were clearly seen as less important than blacks.\n\nAnd yes, articles like this aren't helping.", "time": 1604619226.0}], "republican_score": 0, "democrat_score": 3}