{"name": "jdblawg", "posts": [{"subreddit": "democrats", "text": "The first thing Biden should do if he wins is hang up Obama's Presidential Portrait\n", "time": 1604674109.0}, {"subreddit": "democrats", "text": "If you think the last 4 years was bad wait until Trump starts screwing over his own voters too.\n", "time": 1604474635.0}, {"subreddit": "democrats", "text": "My first meme. Lets save 2020!\n", "time": 1597379372.0}, {"subreddit": "democrats", "text": "Joe Biden selects Kamala Harris as his VP\n", "time": 1597177472.0}, {"subreddit": "democrats", "text": "As the husband of a teacher, I sure do miss her.", "time": 1607153560.0}, {"subreddit": "democrats", "text": "I can not wait to vote in these runoffs. This is the first time in 20 years that I have actually prayed for something. I feel like these seats will determine the direction of our country for the next 20 years. These assholes need to pay for the last 4.", "time": 1606884467.0}, {"subreddit": "democrats", "text": "You don't need petty people like that in your life. Good riddance in my opinion. Find new and better friends, regardless of political affiliation.", "time": 1606855029.0}, {"subreddit": "democrats", "text": "Something tells me you haven't been watching the Trumpublican party the last 4 years.", "time": 1606828229.0}, {"subreddit": "democrats", "text": "It's not fun and jobs are not easy to come by right now.", "time": 1606788132.0}, {"subreddit": "democrats", "text": "Im going to take a wild guess and say you dont work an hourly gig working paycheck to paycheck in a right to work state with a family to feed and shelter.", "time": 1606787078.0}, {"subreddit": "democrats", "text": "YAH not gonna happen in my state. I live in Georgia, land of the \"right to work\". You can literally be fired for almost anything here and there are hardly any unions.", "time": 1606783018.0}, {"subreddit": "democrats", "text": "Dear lord please. If this guy sees the light, my dad might likely join suit. I swear Rush is his guy and likely the only person more important to him politically, even though he is a radio personality. This would make my year for sure.", "time": 1606174143.0}, {"subreddit": "democrats", "text": "They got so much egg on their faces you could make a quiche with just one of them.", "time": 1606158121.0}, {"subreddit": "democrats", "text": "I dont pray often but this I will pray for!", "time": 1606001753.0}, {"subreddit": "democrats", "text": "You do understand that /s means the comment was sarcasm right?", "time": 1605922545.0}, {"subreddit": "democrats", "text": "Lol im convinced now that you are just joking. Good one! You nearly had me but no one is this fucking dumb. Hahahaha can you believe there are actually some people almost this fucking stupid. You should start posting these from another account on r/funny", "time": 1605922304.0}, {"subreddit": "democrats", "text": "Almost 6 million difference and 80 million total!", "time": 1605920876.0}, {"subreddit": "democrats", "text": "First off the house is blue and the senate is barely red, pending a runoff in my state of Georgia where I am a former conservative voting for the democrats. There are no paths possible for the trump legal team to explore that could even possibly change anything. Also we were in your position 4 years ago when Trump literally did cheat with the help of the Russians. His ass is gonna be out of the white house in January and there is nothing he can do about it. I cant wait to revisit this in a couple months and see how you are dealing with it. Im hoping all you nutty bitches think there is massive fraud so you decide to boycott the Georgia runoff.", "time": 1605920497.0}, {"subreddit": "democrats", "text": "Hahahaha so fucking delusional. You are literally worshiping a demagogue and you don't even know it. He knows he lost and he is only extending this because it breaks down democracy just a little bit more. He does not give a shit about you at all. If you died today he would piss on your grave if he felt it would help him even in the slightest bit. This election is OVER and I would bet you all I have against your loyalty that it is. The sad part is even if you knew what a demagogue was you would agree that he is and you would still worship him. Fucking loser.", "time": 1605919953.0}, {"subreddit": "democrats", "text": "We just need to bore them to death over the next 4 years to get them to shut up. Then we need to get the vote out again like we did this time. Dont give them any ammo and they will talk themselves in circles until they get bored of it. I hope.", "time": 1605916612.0}, {"subreddit": "democrats", "text": "OMFG Please let a boycott happen!", "time": 1605888594.0}], "republican_score": 0, "democrat_score": 21}