{"name": "dolphins3", "posts": [{"subreddit": "democrats", "text": "Rep Dina Titus: Tonight we took a major step toward defeating the Republican effort to dismantle the Desert National Wildlife Refuge. The new NDAA protects the DNWR for future generations to enjoy and explore.\n", "time": 1607035628.0}, {"subreddit": "democrats", "text": "Hillary Clinton: I've had the pleasure of working with @neeratanden and @briancdeese on campaigns and in administrations. The OMB and National Economic Council will have steady leadership with them at the helm.\n", "time": 1606930485.0}, {"subreddit": "democrats", "text": "Pete Buttigieg: 50 days to go until we close the chapter on an administration defined by chaos and cruelty, and a new and much better era begins.\n", "time": 1606869276.0}, {"subreddit": "democrats", "text": "Joe Biden: Jill and I send our best wishes to everyone celebrating the Hmong New Year. Things look a little different this year, but we hope your festivities are safe and joyous as you mark the possibilities of new beginnings. Nyob Zoo Xyoo Tshiab!\n", "time": 1606848283.0}, {"subreddit": "democrats", "text": "Nancy Pelosi: The all-woman all-stars chosen to lead the Biden-Harris White House communications team are already sending a clear message to the American people: competence and integrity are back. A special congrats to #TeamPelosi alum Ashley Etienne! #WomenSucceed\n", "time": 1606695643.0}, {"subreddit": "democrats", "text": "Barack Obama: An important reminder as millions of folks across the country vote early or make plans to vote on November 3: You have the right to vote. If you run into any issues at your polling place, call 1-866-687-8683 or your voter protection hotline.\n", "time": 1604087298.0}, {"subreddit": "democrats", "text": "Joe Biden: I join Israelis in honoring Prime Minister Yitzhak Rabin z\"l, 25 years after his assassination. He led a life of service to his country and its security — and bravely gave his life pursuing peace. I was honored to call him a friend.\n", "time": 1603999984.0}, {"subreddit": "democrats", "text": "Miles Taylor, a Former Homeland Security Official, Reveals He Was ‘Anonymous’\n", "time": 1603914024.0}, {"subreddit": "democrats", "text": "The Lincoln Project: Vote. Life’s too important not to.\n", "time": 1603834616.0}, {"subreddit": "democrats", "text": "US Postal Service on-time delivery times for First-Class Mail have dropped again — now nearly as bad as the worst period this summer. If you are voting absentee and haven’t returned your ballot, experts say drop it off in person. Do not rely on #USPS delivery at this point.\n", "time": 1603809744.0}, {"subreddit": "democrats", "text": "Terrible things become realities when people ignore the warnings when they’re only possibilities. #WhatsAtStake\n", "time": 1603809640.0}, {"subreddit": "democrats", "text": "Hillary Clinton: Most Republicans are \"cowards\" on Trump\n", "time": 1603747579.0}, {"subreddit": "democrats", "text": "Sherrod Brown: Every single Senator who votes tonight to confirm Amy Coney Barrett is willing to risk taking away health care for millions of people and eliminating protections for pre-existing conditions. Watch closely.\n", "time": 1603747523.0}, {"subreddit": "democrats", "text": "Joe Biden: Thank you @iamwill and @IAMJHUD for this powerful video. Hate has no place in the United States — and on November 3rd we will prove that.\n", "time": 1603745325.0}, {"subreddit": "democrats", "text": "Nate Silver: Our current trifecta chances:\n", "time": 1603739043.0}, {"subreddit": "democrats", "text": "John Hickenlooper: Cory Gardner flip-flopped. Vote him out.\n", "time": 1603738796.0}, {"subreddit": "democrats", "text": "On 9/26, POTUS announced Amy Coney Barrett's nomination. Judiciary held hearings and voted. This week, the Senate is prepared to confirm. That's how quick the Senate Majority can act when @senatemajldr wants to. That's not what happened with pandemic relief. Gridlock is a choice.\n", "time": 1603678112.0}, {"subreddit": "democrats", "text": "The Lincoln Project’s legal response to the frivolous threat of a lawsuit from Jared Kushner and Ivanka Trump’s lawyer. This will not be the last they hear from us.\n", "time": 1603584213.0}, {"subreddit": "democrats", "text": "King Kong Trump, Losing His Grip\n", "time": 1603577795.0}, {"subreddit": "democrats", "text": "House Democrats: In case you forgot, the #HeroesAct has been sitting on @senatemajldr desk for over FIVE MONTHS now 👎.\n", "time": 1603481107.0}, {"subreddit": "politics", "text": "Senator Marsha Blackburn also recently tweeted that Chinese people are all thieves, basically. The GOP has really been mask off with their racism even more than usual, lately.", "time": 1607153773.0}, {"subreddit": "politics", "text": "A reprisal of the rigged primary conspiracy theory from 2016 isn't exactly original.", "time": 1607153691.0}, {"subreddit": "politics", "text": "This narrative doesn't hold up quite so well after Joe Biden obliterated Bernie Sanders and the rest of the Democratic field in the primary and went on to win the general election in a landslide.", "time": 1607150617.0}, {"subreddit": "politics", "text": "Reddit and Twitter is a political bubble that reflects virtually nothing about the American electorate. You guys have got to get over this delusion that people aren't excited for or don't like Joe Biden.", "time": 1607146384.0}, {"subreddit": "politics", "text": "I know you think that. That's what's kind of both funny and sad.", "time": 1607144288.0}, {"subreddit": "politics", "text": ">People weren't excited about Biden. Sure he was a better alternative,  but Biden wasn't pushing any agenda other than \"I'm not Trump.\"\n\nIt's honestly just funny how so many people here haven't realized the Reddit bubble isn't the real world and can't be bothered to do incredibly basic stuff like read the news.", "time": 1607137523.0}, {"subreddit": "politics", "text": "That hasn't mattered to the GOP for years. It's completely irrelevant to their electoral strategy.", "time": 1607121345.0}, {"subreddit": "politics", "text": "> why are you acting like people didn't care about drones when Trump was president?  \n\nBecause yall didn't.\n\n> yeah left-wing critiques of Trump didn't mention drones as much, but  that's because there was so much other shit that was going on at the  same time. it's not like everyone suddenly became ok with massive drone  strikes \n\nIf the only thing you do with your opposition to drone strike civilian casualties **increasing 500%** is to hold your discontent silently in your heart, there's no practical difference between that and being okay with it.", "time": 1606925346.0}, {"subreddit": "politics", "text": "Exactly. Reddit's general outrage as if Obama was some bloodthirsty dronelord is purely performative.", "time": 1606923347.0}, {"subreddit": "politics", "text": "I see now that a Democratic President is back in the White House yall suddenly care about drones again.", "time": 1606922006.0}, {"subreddit": "politics", "text": "A common far right conspiracy theory is that COVID-19 is a Chinese developed bioweapon that was released deliberately, which is what they are alluding to.", "time": 1606720270.0}, {"subreddit": "politics", "text": "Yeah, it really is time for a crackdown on those ridiculous Trump mobs terrorizing cities.", "time": 1606720082.0}], "republican_score": 0, "democrat_score": 20}