{"name": "Boomslangalang", "posts": [{"subreddit": "democrats", "text": "Joe Biden really needs to say ‘I inherited a mess’ if he becomes our next president. What other Trumpisms can be useful in preempting the impending tidal wave of Republican obstruction, projection and obfuscation?\n", "time": 1604558109.0}, {"subreddit": "democrats", "text": "IF we win, AGAIN a Democrat will dig America out of an economic crisis caused by catastrophic Republican leadership. It’s vital Dems remind Americans often how we got here so we never repeat it. Republicans will shamelessly blame Dems and Americans will forget, because we are idiots who never learn.\n", "time": 1602092328.0}, {"subreddit": "democrats", "text": "The best thing progressive activists can do to oppose Trump is to ignore his upcoming klan rally In Oklahoma\n", "time": 1592582754.0}, {"subreddit": "democrats", "text": "Why are Democrats so inept at messaging? Republicans have spent tens of millions running anti-impeachment ads nationally. Democrats have run zip. And they expect a different result?\n", "time": 1576258223.0}, {"subreddit": "politics", "text": "On the somber anniversary of 9/11, the award-winning documentary The Power of Nightmares by Adam Curtis is a valuable, unique take on the forces that shaped this US and global tragedy\n", "time": 1536705146.0}, {"subreddit": "politics", "text": "John McCain dead at 81.\n", "time": 1535243189.0}, {"subreddit": "politics", "text": "Today Barack Obama returns to public life with the 16th Mandela Lecture in South Africa, his first major speech since leaving the presidency. Watch it!\n", "time": 1531806441.0}, {"subreddit": "politics", "text": "Refreshing honesty from the First Lady on her caring mission to Texas to visit detained immigrant children. She doesn’t care.\n", "time": 1529609246.0}, {"subreddit": "politics", "text": "NYT Mueller Probe Widens to Examine Undue influence of UAE\n", "time": 1520136711.0}, {"subreddit": "politics", "text": "Today: Police break in to opposition studio live on air. Was in r/normaldayinrussia, think it belongs here. Anyone care to translate?\n", "time": 1517163265.0}, {"subreddit": "democrats", "text": "They are seriously demoralized and in shock tho. So that’s nice.", "time": 1607124997.0}, {"subreddit": "democrats", "text": "Trump’s not going to be happy", "time": 1607108063.0}], "republican_score": 0, "democrat_score": 6}