{"name": "Jezza_18", "posts": [{"subreddit": "politics", "text": "Arizona Republicans rebuff Trump's claim of fraud, call for election audit of Maricopa County\n", "time": 1607148865.0}, {"subreddit": "democrats", "text": "Charlie Puth, Who Did You Vote For?\n", "time": 1605672107.0}, {"subreddit": "politics", "text": "‘Threat To Democracy’: CNN Sounds Alarm Over Conservatives Leaving Twitter, Facebook\n", "time": 1605490245.0}, {"subreddit": "politics", "text": "First black woman crowned Miss USA deemed ‘gun-loving Trump fan’ and the left can’t handle\n", "time": 1605465607.0}, {"subreddit": "politics", "text": "Lori Lightfoot tells constituents to cancel Thanksgiving DAYS after celebrating in crowded Chicago streets\n", "time": 1605304827.0}, {"subreddit": "politics", "text": "“The Gateway Pundit noted that when the 37 votes are extrapolated to the entire state, they represent more than 14,000 votes in a state Biden won by 12,670.”", "time": 1607217686.0}, {"subreddit": "politics", "text": "Lol love getting downvoted for posting the truth in this sub", "time": 1607216286.0}, {"subreddit": "politics", "text": "https://www.wnd.com/2020/12/report-gop-obtained-dominion-machine-yes-switched-votes/", "time": 1607214408.0}, {"subreddit": "politics", "text": "Haha you guys talk about fact checking so much yet you use Wikipedia as your source? \n\nLord help you\n\nSchools don’t even allow you to cite Wikipedia", "time": 1607212080.0}, {"subreddit": "politics", "text": "Where did you get that quote from?", "time": 1607208753.0}, {"subreddit": "politics", "text": "Facebook is far left, you know one of the popular ideologies of the far left is the whole gender thing? Where people can be whatever they want, they, she, him, zer etc. This has been challenged by psychologists and biologists to be considered a mental illness. But Facebook will ban people for “misgendering someone”\n\nSo yes, they are far left because they subscribe to the far left ideology", "time": 1607207133.0}, {"subreddit": "politics", "text": "https://www.wnd.com/2020/12/report-gop-obtained-dominion-machine-yes-switched-votes/", "time": 1607206229.0}, {"subreddit": "democrats", "text": "Lol, all politicians are bought.\n\nOn the right and on the left", "time": 1607191883.0}, {"subreddit": "politics", "text": "https://www.statista.com/statistics/1035521/popular-votes-republican-democratic-parties-since-1828/\n\nActually no, it’s pretty even for the past 50 years", "time": 1607149063.0}, {"subreddit": "politics", "text": "The fact that Hillary got the majority vote blows my mind", "time": 1607141560.0}, {"subreddit": "politics", "text": "Your saying Trump did this? I’d like to see the evidence.\n\nAlso your comment is ridiculous", "time": 1607021372.0}, {"subreddit": "politics", "text": "Oh I thought there was 0 evidence of voter fraud?", "time": 1607007228.0}, {"subreddit": "politics", "text": "Well yes they need funding for training, the current training programs are a joke", "time": 1606920665.0}, {"subreddit": "politics", "text": "https://scholar.harvard.edu/barro/files/04_0614_liberalmedia_bw.pdf\n\nhttps://www.google.ca/amp/s/www.forbes.com/sites/waynecrews/2020/02/17/were-not-biased-were-liberals-how-cultural-leftism-will-slant-social-media-regulation/amp/\n\nhttps://www.google.ca/amp/s/www.washingtonpost.com/blogs/erik-wemple/wp/2017/01/27/dear-mainstream-media-why-so-liberal/%3foutputType=amp\n\nJust a few. You know a quick google search can go a long way", "time": 1606892232.0}, {"subreddit": "politics", "text": "Do some proper research on the deep state instead of listening to MSM about it, the deep state owns the mainstream media", "time": 1606885446.0}, {"subreddit": "politics", "text": "Or you can look at politics in general, name one big name politician that hasn’t been involved in a scandal", "time": 1606879896.0}, {"subreddit": "politics", "text": "Annddddd no one went to jail", "time": 1606875941.0}, {"subreddit": "democrats", "text": "Bill Clinton was accused or rape, mysteriously the case was dropped. But noooo one wants to talk about him flying on Epsteins plane 26 times and being seen dancing with underage girls at his island.\n\nHypocrisy at its finest", "time": 1606875603.0}, {"subreddit": "politics", "text": "He’s not discouraging people, he’s actually doing more to inform the public on the corruption of politicians than MSM", "time": 1606847211.0}, {"subreddit": "politics", "text": "No I don’t, neither do you.", "time": 1606837888.0}, {"subreddit": "politics", "text": "“Sounds like”, where’s your proof? “Somehow”, again any proof? No you don’t, just like the MSM creating lies and spewing out horse shit", "time": 1606806666.0}, {"subreddit": "politics", "text": "Your talking about her current net worth, do you know the details of her upbringing or her financial situation through all the years she lived? No you don’t. \n\nEnough with this clickbait bullshit", "time": 1606805548.0}, {"subreddit": "politics", "text": "I’m talking about Tyne boogaloo boys, I think they are a terrorist cell, not “far-rioters” supporting trump. They were caught sending materials to Hamas and were placed here to disrupt peace in America", "time": 1606803554.0}, {"subreddit": "politics", "text": "Those honestly seem like bullshit stories, the second is from a very left leaning source so I don’t trust that one", "time": 1606801099.0}, {"subreddit": "politics", "text": "You have sources to that?", "time": 1606798820.0}, {"subreddit": "politics", "text": "Lol Biden isn’t even in office yet? How is this a win for him?", "time": 1606785962.0}, {"subreddit": "democrats", "text": "Ahhh yess, I challenge your opinions and all you can say is leave", "time": 1606704455.0}, {"subreddit": "politics", "text": "Well you’re blind because you can’t see through CNN’s lies", "time": 1606704180.0}, {"subreddit": "democrats", "text": "And hunter Biden met with top officials from Ukraine. But no one wants to talk about that", "time": 1606703593.0}, {"subreddit": "democrats", "text": "Yes specifically Twitter who is obviously biased to the left, has suspended people and banned them for going against the MSM narrative.", "time": 1606703442.0}, {"subreddit": "democrats", "text": "Lol y’all are brainwashed", "time": 1606703391.0}, {"subreddit": "democrats", "text": "How is he a racist? The left is the one trying to “cancel” people. That is the definition of fascism right? To silence the opposition", "time": 1606701529.0}, {"subreddit": "democrats", "text": "I mean you guys cried about Trump for the past 4 years....", "time": 1606697766.0}, {"subreddit": "politics", "text": "I mean Bush did a lot of damage, damage that is still going on right now", "time": 1606524743.0}, {"subreddit": "democrats", "text": "Lol nice.\n\nGuess what? I’m actually jewish in real life so calling me a nazi doesn’t really work. But I guess that’s what your liberal arts professor told you to say when you disagree with someone", "time": 1606437352.0}, {"subreddit": "democrats", "text": "r/thathappened", "time": 1606431302.0}, {"subreddit": "politics", "text": "I know right, I always scroll down to the bottom and usually downvoted comments to avoid the sheep that are always at the top", "time": 1606347846.0}, {"subreddit": "democrats", "text": "It’s childish", "time": 1606275132.0}, {"subreddit": "politics", "text": "Very anecdotal evidence right there.....", "time": 1606011720.0}, {"subreddit": "democrats", "text": "Go listen to your MSM man, nothing but paid actors feeding you bullshit.\n\nYou see all the posts on how Twitter will give the POTUS account to Biden on Inauguration Day? How the fuck is that news. People post those articles to stir up shit.", "time": 1605995684.0}, {"subreddit": "democrats", "text": "So not being able to remember what state he’s in and barely being able to form sentences makes him the best? Jesus got people are so brainwashed", "time": 1605977138.0}, {"subreddit": "democrats", "text": "Jesus Christ people have you stopped and taken a look at what this divide has done to everyone? A fellow human just contracted a deadly virus and everyone in here is happy???? \n\nWhat happened to caring for other people regardless of their political views.\n\nYou people and everyone else who does this makes me sick", "time": 1605975273.0}, {"subreddit": "democrats", "text": "Why is he the best?\n\nWow the amount of downvotes is insane for asking a simple question", "time": 1605897764.0}, {"subreddit": "politics", "text": "Soooooo many politicians have broken the law, remember the senators a while ago that got rich from insider trading? Yeah no one ever goes to jail", "time": 1605745450.0}, {"subreddit": "democrats", "text": "Couldn’t find one tweet mentioning politics or trump. And so what if he’s an avid trumper? Not everyone who voted for him is a racist nazi, some people like his policies, for example not starting a war and pulling troops out of the Middle East", "time": 1605735047.0}, {"subreddit": "democrats", "text": "What tweets and what Facebook posts?", "time": 1605725963.0}, {"subreddit": "democrats", "text": "My point was that this guy is so anxious to know who he voted for when it shouldn’t be any of his business. Politics should be separate from his professional life", "time": 1605707266.0}, {"subreddit": "democrats", "text": "What’s everyone’s opinion on this?", "time": 1605675543.0}], "republican_score": 0, "democrat_score": 20}