{"name": "JBerlekamp", "posts": [{"subreddit": "democrats", "text": "The Senate can expell members but it is very rare.", "time": 1607116897.0}, {"subreddit": "democrats", "text": "Your county party. Their central committee is based on precincts.\n\nIt probably depends on your state though", "time": 1606366131.0}, {"subreddit": "democrats", "text": "It is not that they don't have a BS meter. They chose to ignore it when it doesn't match their desires. The problem is there is a ready supply for any market of desire and people will stick to what they want not what they need.", "time": 1605465018.0}, {"subreddit": "democrats", "text": "That would be correct. Also keep in mind many Medicare patients have secondary private insurance to augment the Medicare coverage.", "time": 1605464629.0}, {"subreddit": "democrats", "text": "Possibly but that is the argument. Medicare tends to run with lower costs than private insurance so it should be cheaper. But can private insurance yield to competitive pressure and lower costs?\n\nThe big driver of insurance cost is health care itself.", "time": 1605411353.0}, {"subreddit": "democrats", "text": "The public option is not free. You still pay for it.", "time": 1605367166.0}, {"subreddit": "democrats", "text": "I see the trolls are now coming out on the Dems subreddit", "time": 1604943127.0}, {"subreddit": "democrats", "text": "Ohio will draw new districts at both the state and federal level under new rules that should eliminate gerrymandering. Elections will be different and so will the people holding office. Support the anti-gerrymandering efforts in your state.", "time": 1604858552.0}, {"subreddit": "democrats", "text": "It is not over. Trump coming back and it will be very close.", "time": 1604547406.0}, {"subreddit": "democrats", "text": "There are several incorrect statements in this post referencing Breona's involvement in drug trafficking. The postal inspector did not collaborate the police affidavit on parcels.", "time": 1601008417.0}, {"subreddit": "democrats", "text": "Yes they can and should", "time": 1600571824.0}, {"subreddit": "democrats", "text": "They will vote and have a new conservative justice before the election. Say goodbye to Roe, voting rights, gender rights and basic humanity in our laws", "time": 1600472886.0}, {"subreddit": "democrats", "text": "Biden's is the 17th on CNN with Anderson Cooper", "time": 1600232045.0}, {"subreddit": "democrats", "text": "Focus on moderates and democrats. Get them on our side and get them out to vote and Biden wins. Focus on younger voters you know.", "time": 1599229251.0}, {"subreddit": "democrats", "text": "Unless you are ready to shoot someone don't buy a gun. It will be more trouble than it is worth. Focus on self defense classes.", "time": 1599106411.0}, {"subreddit": "democrats", "text": "They don't care, they are doing it for themselves and no bigger ideals", "time": 1598463471.0}, {"subreddit": "democrats", "text": "The rioting/looting plays into Trump's hand and benefits him. It is pretty much all he has right now.", "time": 1598463151.0}, {"subreddit": "democrats", "text": "Before they turn you loose with a phone list they will give you more instructions", "time": 1594530277.0}, {"subreddit": "democrats", "text": "You will probably be calling Dems and independents. Maybe repubs that have a history of being open to switching.\n\nThe key is to find people who say they will vote for Biden so they can be tracked to make sure they do.\n\nAlways be honest and I do not know is an acceptable answer.\n\nNever argue. You will not change minds and it is a waste of time. Your time is to be used to find those that may or will vote Biden. If you do get a negative person politely move on.\n\nYou will get training. Welcome to campaigning and have fun.", "time": 1594442925.0}, {"subreddit": "democrats", "text": "Go look at historical economic data charts. Pick any economic measure. You will see that growth was constant from the Obama admin to Trump.  Trump hasn't grown anything he has just maintained what came before.", "time": 1592678708.0}, {"subreddit": "democrats", "text": "Civil Rights, Gay Rights, Worker's Right's, Women's Rights. Basically people's rights.", "time": 1587516453.0}, {"subreddit": "democrats", "text": "Yes they are a private organization but they would have a good reason", "time": 1585613072.0}], "republican_score": 0, "democrat_score": 22}