{"name": "salazarraze", "posts": [{"subreddit": "democrats", "text": "Trump Legal Team's Latest Court Tactic\n", "time": 1607125816.0}, {"subreddit": "democrats", "text": "I'm not here to debate anything. I'm just telling you why they are cowards.", "time": 1607221848.0}, {"subreddit": "democrats", "text": "The general fear is that he'll back a challenger that will beat them in the primary", "time": 1607218368.0}, {"subreddit": "democrats", "text": "He'll still likely have significant pull in the 2022 house and senate primaries.", "time": 1607203081.0}, {"subreddit": "democrats", "text": "It's funny that they showed this 30 second clip of people just walking around doing nothing identifiable and then declare \"FRAUD.\" Like dude, the video literally doesn't show jack.", "time": 1607126028.0}, {"subreddit": "democrats", "text": "Same here. I live in one of the reddest areas of California. 99% of the obnoxiously large Trump flags on giant trucks are gone. All of the yard signs are gone. It's a beautiful sight.", "time": 1607118160.0}, {"subreddit": "democrats", "text": "Excellent. Now we have Republicans on record for voting against this. Anybody who isn't a simple minded prick should realize that the war on drugs is STUPID. It causes a domino affect that creates a bunch of different problems for low income Americans. The war on drugs is a complete failure that has never succeeded in any way. The only measurable difference is the amount of people that have ended up imprisoned. We need a real drug policy made by adults for the 21st century. The current policy comes from the mind of puritan children that want to control and dominate everyone else in their private lives.", "time": 1607108348.0}, {"subreddit": "democrats", "text": "This is fairly mild for the Qanon types. They even claim that Obama has literal clones roaming around the country to help the real Obama evade arrest.", "time": 1606889225.0}, {"subreddit": "democrats", "text": "Wow, turns out even Barr has his limits when it comes to lying.", "time": 1606884173.0}, {"subreddit": "republicans", "text": "Typing \"again\" in big bold letters doesn't make it so. People are allowed to practice their religion and work in government. That's what I've read in the responses to your posts and in your responses to them.\n\nWhere you seem to get perturbed is when they say that establishing something like sharia law will not and should not be allowed. Which I would think pretty much everyone, including American Muslims would agree with.", "time": 1606664185.0}, {"subreddit": "republicans", "text": "There have been multiple. You're just choosing to misinterpret what they say and twist it into some anti-religious stance. Either you're dishonest or blinded by your own devotion to your opinion.", "time": 1606663843.0}, {"subreddit": "republicans", "text": "You seem to be very passionate about this issue and you are ignoring the reasoned responses that everyone is giving you.", "time": 1606661115.0}, {"subreddit": "democrats", "text": "Republicans in government are now having to sleep in the bed that they've made. For years, they've coddled Trump through his tantrums. And now they're terrified that if they publicly oppose his ridiculous claims, he'll destroy them in their next primary. So they're going along with Trump's farce of a legal fight for self preservation regardless of how stupid it makes them look.", "time": 1606627460.0}, {"subreddit": "democrats", "text": "As he races to *destroy civil service.", "time": 1606591663.0}, {"subreddit": "democrats", "text": "Yet another self own by Trump.", "time": 1606591563.0}, {"subreddit": "democrats", "text": "Florida is not a lost cause for Dems. We just need better local representation and a more targeted approach. Florida is its own thing. The \"one size fits all\" lazy approach won't work with Floridians.", "time": 1606591487.0}, {"subreddit": "democrats", "text": "They've always been this stupid?", "time": 1606580787.0}, {"subreddit": "politics", "text": "\"iT i'LL aLL cOmE oUt sOoN. yOu'LL sEe.\"", "time": 1606351113.0}, {"subreddit": "politics", "text": "The Kraken is a legend of folklore. Something that doesn't exist in realty. Completely made up. Just like the \"Kraken\" that they're referring to when it comes to the election. It's completely made up.", "time": 1606351049.0}, {"subreddit": "politics", "text": "Lets say he gets subpoenaed by a federal judge. It's either testify or go to prison.", "time": 1606344078.0}, {"subreddit": "politics", "text": "Won't this come back to haunt Trump later if he's investigated? I'm assuming that Flynn can be compelled to testify since he's now been pardoned.", "time": 1606343271.0}, {"subreddit": "democrats", "text": "Don't worry guys. When Republicans block legislation in the Senate and nothing gets done about climate change, Florida will be the first to go.", "time": 1604533042.0}], "republican_score": 3, "democrat_score": 15}