{"name": "dpforest", "posts": [{"subreddit": "democrats", "text": "Rural NE Georgia Democrats putting their money where their mouth is! So proud of my community. First a Biden billboard, and now this!\n", "time": 1607218071.0}, {"subreddit": "democrats", "text": "We are better than this. Both parties need to condemn the ongoing stealing and vandalizing of other people’s signs. We know Trump won’t. Let’s hope Biden does. When they go low, we cannot allow ourselves to stoop to that level.\n", "time": 1602790069.0}, {"subreddit": "democrats", "text": "We are doing our best to ensure democratic turnout, outreach to newly registered voters, and independents. We don’t have the resources to try and persuade any republicans, as it would probably be a complete waste of said resources of which we have very little.\n\nTurnout is what’s gonna be key here. I’m disappointed that both Ossoff and Warnock have not done much in terms of social media outreach. AOC garnered hundreds of thousands of viewers with her twitch stream. We are moving into a new era of voter outreach, and the DNC *must* work harder on messaging if we are going to accomplish anything. It would be wonderful for them to each do an AMA. Would it gain voters? Maybe not. But maybe so. Either way it’s free advertising on one of the largest social media platforms in the world, and since it’s free, we have nothing to lose in terms of funds.", "time": 1607220519.0}, {"subreddit": "politics", "text": "Sadly no it won’t. 70 million people still voted for this mother fucker after four years of dereliction of duty. Why do you think this one will stick?", "time": 1607212820.0}, {"subreddit": "politics", "text": "I did too here in Georgia. I got three physical request forms that I never requested. Kinda made me worried for a minute.", "time": 1607211675.0}, {"subreddit": "politics", "text": "Do not congratulate this man on doing his job properly. Elected officials don’t get pats on the back for doing what we elected them (or in my case, had no part in electing him) to do. He’s a piece of shit that stole an election in 2018, and he’s still a piece of shit today.", "time": 1607210335.0}, {"subreddit": "politics", "text": "Lmao it just came in the mail. That’s great.", "time": 1607190721.0}, {"subreddit": "politics", "text": "Oh I definitely intend to vote in person as long as I’m not sick. But I’m making sure I have ballot just in case", "time": 1607188202.0}, {"subreddit": "politics", "text": "By the way when did you get your ballot? I requested mine on the 18th and still nothing.", "time": 1607181763.0}, {"subreddit": "politics", "text": "Yes, according to this website. \n\nhttps://faq.georgiavoter.guide/en/article/absentee-ballot-drop-box-locations\n\nIf you can’t find a box just take it to your voter registrar.", "time": 1607180154.0}, {"subreddit": "politics", "text": "Oh, now it’s time?", "time": 1607119511.0}, {"subreddit": "politics", "text": "100 days is not enough. We wear masks until the pandemic is under control. Even proposing this idea lends credence to the concept that masks are ineffective.", "time": 1607054793.0}, {"subreddit": "politics", "text": "Fucking love Cazwell", "time": 1607039738.0}, {"subreddit": "politics", "text": "You are completely correct but I can add some anecdotal evidence because I’m a Georgian:\n\nI visit one gas station once a week (due to covid) to get gas and smokes (I’m down to half a pack a day!).  The past two times I’ve been there, I have overheard two groups of older white gentlemen saying they were either boycotting the run-off or writing in Trumps name. \n\nYou’re completely correct in saying that republicans will be there to vote on 1/5. But the die-hard Trumpublicans..well, I honestly believe a chunk of them are gonna sit this one out. It won’t be much, but I’m definitely anxious to see the total votes for trump compared to the total votes for loeffler/Purdue.", "time": 1606963527.0}, {"subreddit": "politics", "text": "Seeing a lot of people shit on Georgia’s voters in this post and it’s got me irked. \n\nWe are trying our best. We face arguably the worst voter suppression in the country. Yet we still turned Georgia blue. It isn’t easy being a progressive in Georgia, and we have weekly meetings of our local democrat chapter to do what we can to plan for this run off. And right now our focus is making sure Democrats vote. \n\nDismissing us doesn’t help anything. Stop insulting us and find out how you can help us. If the country doesn’t rally behind Ossoff and Warnock, Georgia is fucked senate-wise and Mitch keeps his power. Either help or keep the negativity to yourself, it doesn’t help anyone.", "time": 1606889081.0}, {"subreddit": "politics", "text": "I was just watching transformers 3 because I was bored as fuck and needed background noise. I’m scrolling through Reddit on my phone and all of a sudden I hear “the decepticons are setting up at trump tower!” Like yeah of fucking course they would.", "time": 1606888448.0}, {"subreddit": "politics", "text": "Is that picture shopped? It’s gotta be. I mean I know the man uses orange toned spray tan but it’s never been *that* apparent to me. I mean look at that line down the left side of his face. That’s insane.\n\nEdit: also I’m glad we aren’t capitalizing tea party anymore lol.", "time": 1606888171.0}, {"subreddit": "politics", "text": "Wonder why? Oh it’s because Kelly Loeffler and David Purdue are fucking cunts. Actually calling them cunt would be too nice of a word. A word doesn’t exist that can truly explain the scum that is Loeffler and Purdue. The audacity of that woman to have an ad saying “Kelly Loeffler knows what it’s like living paycheck to paycheck”. Bitch sit down. You’re worth anywhere from $800 million to a billion fucking dollars, and I cannot wait to vote you out of office.  The saddest thing is they will never pay for their crimes. My best friend died of covid while I was in the hospital for covid, and Loeffler and Purdue made money off of that. Fuck the both of them.", "time": 1606774894.0}, {"subreddit": "politics", "text": "I don’t like to hate people, but Kelly loeffler made money off the suffering of hundreds of thousands of people. Including my best friend, who died of covid. Loeffler deserves to be tried for her crimes and punished accordingly. I’d say what I think she deserves, but it would probably get me banned. I can’t wait to vote that bitch out in January.", "time": 1606772850.0}, {"subreddit": "politics", "text": "Won’t miss that varicose dick vein", "time": 1606758715.0}, {"subreddit": "politics", "text": "Thanks for the help guys! Our local democrat chapter has been in touch with our bordering counties and we are doing all we can. It sucks we can’t go door-to-door this year. We really think it’ll come down to how the JoJo voters swing. Keep your fingers crossed for us. \n\nOh and some redhats are taking the boycott very seriously, or are intending to write in Trump’s name (because that’s totally how senate run-offs work). Just like Trump ruined his chances at winning Georgia by suppressing the mail-in vote, his voters are now shooting themselves in the foot with a boycott of an election. God bless em.", "time": 1606701869.0}], "republican_score": 0, "democrat_score": 3}