{"name": "dumstarbuxguy", "posts": [{"subreddit": "democrats", "text": "Black Voters Matter canvassing Georgia in bus loads!\n", "time": 1606060408.0}, {"subreddit": "democrats", "text": "Mijente on the ground mobilizing Georgia Hispanic voters!\n", "time": 1606060295.0}, {"subreddit": "democrats", "text": "Candidates will be flush with cash, consider donating to grassroots GOTV orgs\n", "time": 1605799527.0}, {"subreddit": "democrats", "text": "Candidates will be flush with cash, consider donating to grassroots GOTV orgs\n", "time": 1605799479.0}, {"subreddit": "democrats", "text": "This Perdue ad is so weak. These clowns should be getting hammered for insider trading\n", "time": 1605465527.0}, {"subreddit": "democrats", "text": "What exactly is the Warnock strategy??\n", "time": 1605460945.0}, {"subreddit": "democrats", "text": "Anyone having trouble volunteering for Warnock?\n", "time": 1605375468.0}, {"subreddit": "democrats", "text": "PHONE BANK FOR JON OSSOFF\n", "time": 1604852106.0}, {"subreddit": "democrats", "text": "I’d rather Obama go in person", "time": 1607104856.0}, {"subreddit": "democrats", "text": "Yeah. I despise how unimaginative the top brass of the Democratic Party is. They seethe with contempt if you’re to their left and make suggestions of how they can reach younger people, minorities and even the white working class. \n\nYour suggestion, I believe, is an amazing one. In the short term, I wouldn’t expect the democrats to win say Louisiana, Mississippi, Alabama, Ohio, Iowa, West Virginia. But a program like that would probably soften people’s views of the party from “SATANIC PEDO COMMIE PARTY” to “the PC weirdos who helped me get a job and fed my family a few times”. \n\nSorta off topic but I saw someone on Twitter make a suggestion. They said, Biden, Pelosi and Schumer should go to Georgia and take a bill that would give everyone $2000 a month for a year and have Biden say “I want to sign this bill, but I can’t if Loeffler and Perdue win”. Something like that would kick ass but we’re stuck with “you can’t be a too ambitious to win over swing voters, you’ll scare them”", "time": 1606957435.0}, {"subreddit": "democrats", "text": "Nothing wrong with welfare. If anything it should be more generous.\n\nAnd democrats should brag about the welfare benefits they create. SS, Medicare, Medicaid, food stamps are all popular programs created by the Democratic Party", "time": 1606886017.0}, {"subreddit": "democrats", "text": "And the thing is a lot of this can be done without congress. Of course the goal should always be to win elections, but there’s so many laws on the books that Dems can use to benefit the lives of all people but especially rural", "time": 1606885892.0}, {"subreddit": "democrats", "text": "I saw someone on Twitter say this and maybe it’ll make no difference but it sounds smart to me. This guy said that the Democratic Party in rural and exurban areas should open centers where they provide free useful stuff. Like every week they can hold giveaways of women’s hygiene products, another week baby products, another week kitchen utensils, another week they can do a food bank. \n\nAt these events you can keep people up to date on election dates, key issues, have meet and greets with local democratic candidates, etc\n\nDo things that builds a positive brand for the Democratic Party wherever it is out of power. \n\nWould it work? It’s not guaranteed but tough to see how it could be worse", "time": 1606885737.0}, {"subreddit": "democrats", "text": "This is kinda the point. Dems will almost never win on cultural issues. \n\nTherefore all they can offer these people is economic benefits. Of course it was bullshit, but Trump consistently polled high on the economy. A lot of people voted for and liked his “economy”. \n\nI’m not saying that going populist left will win back Appalachia, Iowa, the Deep South, etc for Democrats. But if even 5%  people in these areas are  receptive to a left wing message, that could pay dividends in house races, state legislatures, mayoralties, etc", "time": 1606885335.0}, {"subreddit": "democrats", "text": "Did Ossoff really say that?\n\nYeah American politics is so damn stupid. I just saw a Perdue ad where he said Ossoff will get rid of private insurance.....like that’s supposed to be a bad thing to that freak", "time": 1606884752.0}, {"subreddit": "democrats", "text": "Of course. Because if Ossoff and Warnock win, Biden can increase taxes through reconciliation to fund a large stimulus.\n\nThe lesson should be, don’t take money from Wall Street. They don’t have the people’s interest at heart", "time": 1606753027.0}], "republican_score": 0, "democrat_score": 16}