{"name": "MetalMamaRocks", "posts": [{"subreddit": "politics", "text": "He can't read.", "time": 1607211280.0}, {"subreddit": "democrats", "text": "Ugh. Gross.", "time": 1607181933.0}, {"subreddit": "politics", "text": "OMG! 🤣🤣🤣", "time": 1607130631.0}, {"subreddit": "politics", "text": "Yes!! But she usually plays Guiliani, so ... who else could do it?", "time": 1607129773.0}, {"subreddit": "politics", "text": "With some of the crazy shit that gets posted by trump supporters, you never know! Lol", "time": 1607123118.0}, {"subreddit": "politics", "text": "It just proves how much people hate trump.", "time": 1607122927.0}, {"subreddit": "democrats", "text": "Then you had Limbaugh and Glen Beck spewing lies day after day after day until listeners were ultimately brainwashed. They wouldn't know the truth if it smacked them in the face.", "time": 1606935309.0}, {"subreddit": "democrats", "text": "OH MY FREAKING GOD!! IDIOTS!!!", "time": 1606923438.0}, {"subreddit": "politics", "text": "What would trump do if guiliani quit working for him? It might be in rudy's best interest to cut and run now. Would trump throw him under the bus like he does everyone else? Would he be able to get another lawyer?", "time": 1606866324.0}, {"subreddit": "politics", "text": "I wish the states would turn around and sue the shit out of trump and his \"legal team\".", "time": 1606778996.0}, {"subreddit": "politics", "text": "What would happen if you got tested and didn't tell your employer? If you're negative they shouldn't need to know.", "time": 1606757378.0}, {"subreddit": "politics", "text": "These people have forgotten who they work for.", "time": 1606748400.0}, {"subreddit": "politics", "text": "As someone who has been deemed an essential worker, this pisses me off. Don't get me wrong, I'm very grateful to have a job when a lot of people are out of work and hurting, but my employer has been negligent in their handling of Covid. They're doing a better job now, but it took several calls to the health department to get them to comply. \n\nIf someone did come down with Covid on the job, it would be very hard to prove that's where they caught it, but the companies that have been extremely negligent and putting worker's lives at risk should be held accountable.", "time": 1606748344.0}, {"subreddit": "politics", "text": "They'll just go back to bashing the Democratics like they did during Obama's presidency. You'll have morons like Matt Gaetz or Gym Jordan that will try to fill the void.", "time": 1606701975.0}, {"subreddit": "politics", "text": "Do you think a lot of this had to do with an unprecedented amount of mail-in ballots that had to be hand counted?", "time": 1606586782.0}, {"subreddit": "politics", "text": "Yes, civil war would be inevitable.\n\nIt was a Trump appointed judge in Pennsylvania that threw out the last case. That should give all of us hope that there are justices that will follow the law and not just pander to a wannabe dictator.", "time": 1606579566.0}, {"subreddit": "politics", "text": "I wouldn't be surprised if he winds up in psychology text books as a case study.", "time": 1606578667.0}, {"subreddit": "politics", "text": "I think he had to pay this upfront. His credit is no good.", "time": 1606578531.0}, {"subreddit": "politics", "text": "What rich folks? This is not fraud, it's human error and it's less than .1 percent.", "time": 1606578403.0}, {"subreddit": "politics", "text": "There is zero evidence of voter fraud and all of the cases have been thrown out of the lower courts because of \"no merit\". \n\nI'm no lawyer but I don't see any way the supreme court could overturn the election and the will of the people.", "time": 1606577523.0}, {"subreddit": "politics", "text": "A couple of atheists need to be on the court too.", "time": 1606517036.0}, {"subreddit": "politics", "text": "Scary, isn't it?", "time": 1606242814.0}, {"subreddit": "politics", "text": "Just like there's video footage of trump mocking a disabled reporter and denegrating a gold star family. They call it fake news but we've been watching it all play out live since before he was elected.", "time": 1606148850.0}, {"subreddit": "politics", "text": "Well, very few people were at his inauguration, so ... 😄", "time": 1606087461.0}, {"subreddit": "politics", "text": "This is how it should be.", "time": 1606087385.0}, {"subreddit": "politics", "text": "Selfish prick.", "time": 1606087279.0}, {"subreddit": "democrats", "text": "Lol, go Joe!", "time": 1606087256.0}, {"subreddit": "politics", "text": "Lol, I just hope it's not us taxpayers!", "time": 1606072426.0}, {"subreddit": "politics", "text": "Who is paying for that?", "time": 1606072104.0}, {"subreddit": "politics", "text": "The Michigan NAACP is suing the trump campaign for trying to disenfranchise black voters. I think there will be more lawsuits like this in the near future.", "time": 1606068751.0}, {"subreddit": "politics", "text": "Pelosi came down 1T from her original proposal, and was willing to negotiate more but Mitch refused to negotiate at all. It was his 500B stimulus or nothing.", "time": 1606068318.0}, {"subreddit": "politics", "text": "AND McConnell had in that bill that employees who got Covid on the job couldn't sue their employers. Just another way to protect big business and screw the workers.", "time": 1606068193.0}, {"subreddit": "politics", "text": "I agree. How?", "time": 1606063245.0}, {"subreddit": "politics", "text": "She has a right to speak up.", "time": 1606061028.0}, {"subreddit": "politics", "text": "Other Republicans in congress love him and support everything he does (or doesn't do). The only way we can fight back is to win the senate seats in Georgia so he is no longer majority leader. \n\nHis obstructionism is destroying democracy. He has done more long-term damage than Trump.", "time": 1606060992.0}, {"subreddit": "politics", "text": "Nancy has been negotiating. Mitch has not.", "time": 1606060710.0}, {"subreddit": "democrats", "text": "Democrats will know better (hopefully). Republicans will believe whatever lies Fox or Newsmax tells them.", "time": 1606012258.0}, {"subreddit": "politics", "text": "I wonder what would've happened if Biden showed up to the meeting? Lol", "time": 1605999774.0}, {"subreddit": "politics", "text": "Oh man our government is so screwed up..", "time": 1605995150.0}, {"subreddit": "politics", "text": "They think it's Pelosi's fault there is no stimulus, because that's what turtle man told them. As a Kentucky Democrat I've tried explaining to them what's going on but they don't want to hear it. It's useless.", "time": 1605949146.0}, {"subreddit": "politics", "text": "What can they do?", "time": 1605948452.0}, {"subreddit": "politics", "text": "If he is that fragile he should've never been deemed fit to serve.", "time": 1605917715.0}, {"subreddit": "politics", "text": "OH HELL NO!!!!", "time": 1605917619.0}, {"subreddit": "politics", "text": "He looks like a \"whooped pup\", as they say here in the south.", "time": 1605917550.0}, {"subreddit": "politics", "text": "They already impeached him, what more is there? With repugnicans having the majority in the senate, there is literally nothing anyone can do ... for now.", "time": 1605913854.0}, {"subreddit": "politics", "text": "He looks like a little kid that doesn't want to eat his broccoli.", "time": 1605913557.0}, {"subreddit": "politics", "text": "Isn't he also considering Doug Jones?", "time": 1605906577.0}, {"subreddit": "politics", "text": "I thought Sara Huckabee was bad ...", "time": 1605905746.0}, {"subreddit": "democrats", "text": "The only president to lose the popular vote TWICE! What a loser!", "time": 1605895563.0}, {"subreddit": "politics", "text": "No, they're just issuing death threats.", "time": 1605823533.0}, {"subreddit": "politics", "text": "Yes but she won our hearts! ❤️❤️", "time": 1605823473.0}, {"subreddit": "politics", "text": "Let's hope we win the senate seats in Georgia. This would finally give us an equal playing field!", "time": 1605813129.0}, {"subreddit": "politics", "text": "Well, January 20th.", "time": 1605812227.0}, {"subreddit": "politics", "text": "True!", "time": 1605812142.0}, {"subreddit": "politics", "text": "I tell them all the time they're being lied to. They think I'm lying to them.", "time": 1605799584.0}, {"subreddit": "politics", "text": "I was driving through rural Kentucky the other day and what looked to be the poorest communities had the most Trump/McConnell signs in their yards. I don't get it.", "time": 1605799289.0}], "republican_score": 0, "democrat_score": 6}