{"name": "jmsatl", "posts": [{"subreddit": "democrats", "text": "BREAKING NEWS: Trump CALLS Georgia Gov. Brian Kemp to pressure him to help overturn Biden's win and order another signature audit as he heads to rally for GOP runoff candidates David Perdue and Kelly Loeffler\n", "time": 1607197150.0}, {"subreddit": "politics", "text": "Trump CALLS Georgia Gov. Brian Kemp to pressure him to help to overturn Biden's win\n", "time": 1607197099.0}, {"subreddit": "politics", "text": "Justice Alito Slow-Walks Rep. Kelly’s Pennsylvania Emergency Petition, Requiring a Response from the State on Dec. 9, After the Safe Harbor Deadline: What Does It All Mean?\n", "time": 1607096574.0}, {"subreddit": "democrats", "text": "Opinion: Five steps Democrats can take to win big in Georgia\n", "time": 1607032793.0}, {"subreddit": "politics", "text": "Democrats File Bar Complaint Against Trump Campaign Lawyer for ‘Blatant Threat’\n", "time": 1607019140.0}, {"subreddit": "politics", "text": "Georgia Argued Sidney Powell Is a ‘Security Risk’ Who Can’t Get the ‘Keys to the Software Kingdom’\n", "time": 1606966384.0}, {"subreddit": "democrats", "text": "Wisconsin Federal Judge Picks Apart Sidney Powell and Lin Wood’s Lawsuit in ‘Brutal’ Order\n", "time": 1606943839.0}, {"subreddit": "politics", "text": "Dr. Scott Atlas resigns from Trump administration\n", "time": 1606782326.0}, {"subreddit": "politics", "text": "Arizona Certifies Election Results\n", "time": 1606760105.0}, {"subreddit": "politics", "text": "Experts Scorch Pennsylvania Senator’s ‘Nakedly, Indefensibly Anti-Democratic’ Attempt to Replace State’s Electoral College Voters\n", "time": 1606593106.0}, {"subreddit": "politics", "text": "Justice Sotomayor Upbraids SCOTUS Majority for ‘Playing a Deadly Game’ With COVID Restrictions\n", "time": 1606454462.0}, {"subreddit": "politics", "text": "Justice Sotomayor Upbraids SCOTUS Majority for ‘Playing a Deadly Game’ With COVID Restrictions\n", "time": 1606451718.0}, {"subreddit": "politics", "text": "Georgia secretary of state says Trump threw him under bus despite his support\n", "time": 1606324091.0}, {"subreddit": "democrats", "text": "How ghost candidates helped Republicans steal Florida Senate seats....\n", "time": 1606188987.0}, {"subreddit": "democrats", "text": "State, national GOP seek to delay certification of election results\n", "time": 1605978881.0}, {"subreddit": "politics", "text": "State, national GOP seek to delay certification of election results\n", "time": 1605978627.0}, {"subreddit": "politics", "text": "Georgia governor certifies presidential electors for Biden\n", "time": 1605912140.0}, {"subreddit": "politics", "text": "Floyd County terminates election director after state audit uncovers uncounted votes\n", "time": 1605825936.0}, {"subreddit": "politics", "text": "Michigan Republicans temporarily block certification of Detroit's election results\n", "time": 1605663302.0}, {"subreddit": "democrats", "text": "David Perdue Chickens Out of Debate\n", "time": 1605499118.0}, {"subreddit": "democrats", "text": "Georgia Sen. David Perdue declines to debate opponent ahead of January 5 runoff\n", "time": 1605483008.0}, {"subreddit": "politics", "text": "Pennsylvanians urged to drop off mail-in ballots in person\n", "time": 1604019165.0}, {"subreddit": "democrats", "text": "Please spread the word, at this point skip the mail! Drop off your ballot or vote in person!\n", "time": 1603767098.0}, {"subreddit": "politics", "text": "Kayleigh McEnany once praised Biden as a 'man of the people' who resonates with \"middle class\" over 'tycoon' Trump\n", "time": 1603754011.0}, {"subreddit": "politics", "text": "Trump on Kamala Harris: U.S. won't have socialist president, \"especially a female socialist\"\n", "time": 1603494652.0}, {"subreddit": "politics", "text": "Appeals court rejects counting Michigan's late ballots\n", "time": 1602963262.0}, {"subreddit": "politics", "text": "Whose Dick Hurtz?", "time": 1607210180.0}, {"subreddit": "politics", "text": "Yes.  Pence is not running for reelection though.   Definitely different scenario.  And I think we live in a different world where in the Nixon era , 90% of Americans would not be ok with a self pardon, but today 40% of Americans would probably be ok with Trump shooting someone on 5th avenue and getting away with it.", "time": 1607192552.0}, {"subreddit": "democrats", "text": "It wont be split , its tag team", "time": 1607156446.0}, {"subreddit": "democrats", "text": "Just made another small donation to both Ossoff and Warnock.", "time": 1607156415.0}, {"subreddit": "politics", "text": "I agree with you 100% that this shit should not fly  but I think **this** SCOTUS will let it fly\n\nI am definitely more worried about the shit that he will do at the Pentagon than the pardons, not that pardons do not concern me", "time": 1607151090.0}, {"subreddit": "politics", "text": "This is really concerning.   They are blocking Biden meetings.   The Trump and his cronies at the Pentagon are definitely up to something sinister", "time": 1607150042.0}, {"subreddit": "politics", "text": "The pardon himself , I think is questionable, and a balanced SCOTUS would knock it down.  But a resignation and being pardoned by Pence, that would hold . because Ford-Nixon is precedent, at least Nixon went out quietly - I think", "time": 1607149925.0}, {"subreddit": "politics", "text": "Whats funny is that this case is against Trump supporters Kemp and  Raffensperger  (state of Ga)\n\nBut the case is still going to be heard by the lower court, just delayed , hopefully until after Safe Harbor Day like the Penn Kelly Appeal", "time": 1607134643.0}, {"subreddit": "democrats", "text": "This is serious .  This is real.  Trump is purging the Pentagon for a reason", "time": 1607120018.0}, {"subreddit": "politics", "text": "Don't you think he is really planning to do this???   I mean wtf would you put loyalists all over the Pentagon when you have so little time left in your admin unless you were planning a military coup???  WTF is the senate doing just watching?", "time": 1607119217.0}, {"subreddit": "politics", "text": "Just because the president says he is going to veto it does not mean the senate and house  can't send it to his desk.  If the senate and house can agree, send it to him, see what he does, he is not a man to keep his word, if he vetos, try to override.", "time": 1607099998.0}, {"subreddit": "politics", "text": "I bet you Flynn promised Trump he would tweet this as part of the pardon deal.   Now the newly Pentagon Trump appointed official is tweeting this too, scary...", "time": 1607095261.0}, {"subreddit": "politics", "text": "This is so sad.  Trump is evil\n\nIs there anything Biden can do once he is in office?", "time": 1607058236.0}, {"subreddit": "politics", "text": "thread got removed because unreliable source \ntweet is from Reuters SCOTUS reporter so its likely reliable", "time": 1607056513.0}, {"subreddit": "politics", "text": "Wonder why this was removed from r / politics.   Still in r / Scotus", "time": 1607056173.0}, {"subreddit": "politics", "text": "agreed", "time": 1607055516.0}, {"subreddit": "politics", "text": "Thanks for reply.", "time": 1607055133.0}, {"subreddit": "politics", "text": "Yeah, I dont necessarily agree with the person that posted that... but still it leaves me biting my nails", "time": 1607055053.0}, {"subreddit": "politics", "text": "Someone on r/scotus is arguing that this does not end it...[https://www.reddit.com/r/scotus/comments/k6b7ap/alito\\_sets\\_reply\\_deadline\\_for\\_state\\_of/](https://www.reddit.com/r/scotus/comments/k6b7ap/alito_sets_reply_deadline_for_state_of/)", "time": 1607053598.0}, {"subreddit": "politics", "text": "So prior to her being on the court, Republicans had a 5-2 majority?", "time": 1607049277.0}, {"subreddit": "politics", "text": "That was the point I was trying to make about it a good thing that Jill Karofsky won the seat recently.  Someone replied very rudely and I reported it.   I hope he gets banned.", "time": 1607045296.0}, {"subreddit": "politics", "text": "That was the point I was trying to make about it a good thing that Jill Karofsky won the seat recently.  Someone replied very rudely and I reported it.  I hope he gets banned.", "time": 1607045246.0}, {"subreddit": "politics", "text": "What do you mean?", "time": 1607042831.0}, {"subreddit": "politics", "text": "No.  I disagree.  Thanks for your opinion though.  Plus , I think it was quite obvious I am not a huge fan of her the way I used it.  Nor am I a huge fan of AOC.  I am a huge fan of RGB though, may she rest in peace!", "time": 1607041536.0}, {"subreddit": "politics", "text": "I can't see her concurring with the 3 Liberal judges + Roberts to form a majority.  I can see Gorsuch more likely , and Kavanaugh probably less likely than Gorsuch but more so than Barrett.  I see her to be more like Thomas", "time": 1607041428.0}, {"subreddit": "politics", "text": "Wisconsin is actually closer to that than most states or SCOTUS but I completely agree.  This needs to be fixed somehow", "time": 1607041237.0}, {"subreddit": "politics", "text": "All 3 conservative judges.   This is why Jill Karofsky's recent addition to the WSC was huge.  She was the deciding vote, fortunately.  Much like ACBtch is the deciding vote now on SCOTUS, unfortunately", "time": 1607032652.0}, {"subreddit": "politics", "text": "This is why downballot state elections MATTER!\n\nIf Jill Karofsky lost her election, Trump likely would have won this court case!", "time": 1607032516.0}, {"subreddit": "politics", "text": "Rather than boycott - #VoteBlue -put Moscow in  the minority", "time": 1606960401.0}, {"subreddit": "politics", "text": " He played Fire on the Mountain run **proud** boys, run", "time": 1606960334.0}, {"subreddit": "politics", "text": "Wasnt he just there?  I hope he hurts more than helps the crap running on the GOP side", "time": 1606960164.0}, {"subreddit": "politics", "text": "Yeah - there is can of worms there....   conspiracy theories that may be true", "time": 1606960007.0}, {"subreddit": "politics", "text": "What dirt do you think she has?", "time": 1606955695.0}, {"subreddit": "democrats", "text": "Lawsuit demanded footage for TCF Center, which happens to be in Detroit, Michigan, lol\n\nOne of the plaintiffs did not even know he was a plaintiff on the case", "time": 1606943923.0}, {"subreddit": "politics", "text": "Can't he be charged again with treason?", "time": 1606943447.0}, {"subreddit": "politics", "text": "And Trump called it fake news", "time": 1606924436.0}, {"subreddit": "politics", "text": "Please explain why I am completely wrong to quash my paranoia but is it clear this bribery investigation is against the \"current\" administration and not the Obama?   I pray this is a lunacy conspiracy theory - so please tell me why this cant be true.  Coincidentally the news was released the same day Barr released he had appointed a special counsel.\n\n>**The filings don't reveal a timeline of the alleged scheme**, or any names of people potentially involved, except that communications between people including at least one lawyer were seized from an office that was raided sometime before the end of this summer.   \n>  \n>\\-CNN", "time": 1606921147.0}, {"subreddit": "politics", "text": "I woke up in my sleep thinking this. I am hoping it is a crazy thought and it is clear this has to do with current administration.  is there any possibility that this is why this was released same day as the special counsel", "time": 1606919413.0}, {"subreddit": "politics", "text": "It's it possible we have this wrong completely?  What is this is about the Obama Biden administration?  Makes sense given the announcement btw Barrack the special counsel", "time": 1606909031.0}, {"subreddit": "democrats", "text": "Didn't they demand video and accidentally mentioned a voting center in Detroit ? dumb as nails \n\nA GOP  congressional candidate that lost his race was a plaintiff, had no idea he was plaintiff, and does not want to be", "time": 1606882339.0}, {"subreddit": "politics", "text": "I hope Biden get's a new mattress.   Diaper Don might have not worn his diaper every night", "time": 1606882013.0}, {"subreddit": "politics", "text": "Almost as good as the lawsuit in Wisconsin asking for video of the vote count in Detroit", "time": 1606881884.0}, {"subreddit": "politics", "text": "Lou Dobb's Is Donald Trump when Donald Trump talks out of his asshole.   So when you here Lou Dobb's , that is where it is coming from", "time": 1606881778.0}, {"subreddit": "politics", "text": "Isnt Nunes and Gates the same amount of letters?", "time": 1606881601.0}, {"subreddit": "politics", "text": "I thought for sure Gideon had her beat,  this was one of the most crushing results of the 2020 election", "time": 1606881199.0}, {"subreddit": "politics", "text": "I am just hoping she doesn't suffer the same fate", "time": 1606881064.0}, {"subreddit": "politics", "text": "I can't keep all with all this news today, between Barr saying no evidence of fraud in the elections, to revealing he appointed a special counsel to investigate the Russia \"not a \" hoax, to this bribery thing - all connected?     My head is spinning", "time": 1606879747.0}, {"subreddit": "politics", "text": "Bribery  for a pardon - this is the teflon Don,  he has the jury aka the senate, in his pocket. GOP speaks out and they come home to a dead horse head on their pillow", "time": 1606866687.0}, {"subreddit": "politics", "text": "This could be huge, but then again, will be completely ignored by the GOP senators and representatives", "time": 1606866455.0}, {"subreddit": "politics", "text": "This is his way of blackmailing GOP to hold out endorsing Biden and stay on board his attempt to overthrow the election?", "time": 1606859582.0}, {"subreddit": "politics", "text": "Does anyone believe a military coup by Trump is possible ?  Or is that thought just crazy conspiracy theory???", "time": 1606797910.0}, {"subreddit": "democrats", "text": "Well, they should register legal Georgians without issue.    If someone moves to Georgia between now and the election cut off  just to vote whether red or blue , I can see that \"possibly\" being illegal if it can be proved that that was their intent.   I don't suggest Andrew Yang vote in Georgia.", "time": 1606782172.0}, {"subreddit": "politics", "text": " How do Ohio people elect these fools???", "time": 1606780610.0}, {"subreddit": "politics", "text": "Can't we arrest for violent threats?  Police need to not stand by anymore", "time": 1606780523.0}, {"subreddit": "politics", "text": "DeSatan", "time": 1606780451.0}], "republican_score": 0, "democrat_score": 14}