{"name": "skyrat77", "posts": [{"subreddit": "democrats", "text": "Former GOP Rep. Tom Coleman: Both Trump and Pence should be impeached\n", "time": 1559448269.0}, {"subreddit": "democrats", "text": "Another example of why “The Wall” is a waste of money.\n", "time": 1549910537.0}, {"subreddit": "democrats", "text": "Not just a reduced knowledge about COVID-19 but about everything in general. The bubble that is created separates those users from reality one day a time.", "time": 1607106908.0}, {"subreddit": "democrats", "text": "Like a virus being eradicated one day at a time. It is a Merry Christmas after all! Thanks for sharing. \n🇺🇸BIDEN-HARRIS 2020🇺🇸", "time": 1607105997.0}, {"subreddit": "democrats", "text": "Gained their trust and persuaded them to believe something that is not true. Greatest Conman in American history.", "time": 1607051269.0}, {"subreddit": "democrats", "text": "Indeed.", "time": 1606499110.0}, {"subreddit": "democrats", "text": "ISIS style propaganda.", "time": 1606498255.0}, {"subreddit": "democrats", "text": "...until the world is a safer place.", "time": 1606148610.0}, {"subreddit": "democrats", "text": "Thank you! Much needed. \nI was hoping that we would be celebrating a strong victory similar to the end of WWII. However, it appears we truly have the government we deserve. I hope that as you said, we can return to the modern age. Cheers!", "time": 1604514201.0}, {"subreddit": "democrats", "text": "While I agree with your sentiment, the fact that millions have voted for Trump and the likes of Mitch McConnell are to keep their senate seats only proves that we are in fact not the union we perceived. The damage is done and these “cultists” have been here all along and have a megaphone in the new Republican party. Sadly, a country that is this divided will not last even if we win. Thanks for sharing your post.", "time": 1604513644.0}, {"subreddit": "democrats", "text": "\nIt is racist because they are using an ignorant stereotypical concept of immigrants and are also being  antagonistic towards the marginalized by promoting use of force towards a specific ethnic group. If you think that it is in good fun, it is not in good taste at all. Specially in the current divisive state of the nation.", "time": 1604154750.0}, {"subreddit": "democrats", "text": "More like disappointed in Americans of voting age. People have the government they deserve.", "time": 1603988815.0}, {"subreddit": "politics", "text": "“it seems”?\nThey have been committing fraud including voter suppression for decades.", "time": 1602517108.0}, {"subreddit": "democrats", "text": "These voters may “disapprove” of his performance, but will still vote for Trump blinded by religious conservatism.", "time": 1601743717.0}, {"subreddit": "democrats", "text": "Show us your damn tax returns first.", "time": 1601219692.0}, {"subreddit": "democrats", "text": "When our democracy is at stake, drastic actions are required to save it.", "time": 1600791253.0}, {"subreddit": "democrats", "text": "The end of VA benefits is not far into the future at this rate with this administration. 🤬", "time": 1599243842.0}, {"subreddit": "democrats", "text": "Prosecute Trump’s Republican enablers complicit in the state of our democracy.", "time": 1595627009.0}, {"subreddit": "politics", "text": "Indeed. Every citizen “should” be familiar with their constitution.", "time": 1593836970.0}], "republican_score": 0, "democrat_score": 17}