{"name": "geffenizlude", "posts": [{"subreddit": "politics", "text": "Make Electoral College Votes Pay-Per-View Events, Proceeds Applied to Natl. Debt?\n", "time": 1607159094.0}, {"subreddit": "politics", "text": "Some PA Counties Will Miss Certification Deadline.\n", "time": 1606185183.0}, {"subreddit": "politics", "text": "Trump Loses Georgia Again. Audit Confirms President-Elect Joe Biden Wins Goergia.\n", "time": 1605834236.0}, {"subreddit": "politics", "text": "Georgia Audit Confirms Biden Wins Georgia, President Trump loses Georgia a second time.\n", "time": 1605834130.0}, {"subreddit": "politics", "text": "Clark County, NV Election Press conference. Fast forward to about [2:00]\n", "time": 1604534476.0}, {"subreddit": "politics", "text": "Install a script blocking extension to your browser, that will usually get you past paywalls.", "time": 1607206958.0}, {"subreddit": "politics", "text": "Okay, Bill Barr.  Time to put your money where your mouth is.", "time": 1607206785.0}, {"subreddit": "politics", "text": "I'm sure this wasn't a pretty please with a cherry on top kind of request.  I'm thinking it was much more blackmailey and extortiony.", "time": 1607194821.0}, {"subreddit": "politics", "text": "\"Mr. Kemp, I know I just got done trash talking you on the world stage, but could you commit a little sedition for me, pretty please?\"", "time": 1607194720.0}, {"subreddit": "politics", "text": "On the bright side, they're ex-military.", "time": 1607189247.0}, {"subreddit": "politics", "text": "Their qualifications are quite different.  They nominated a woman who will not only fuck her way into the job, she'll insist that no one she has to fuck for the job wear a condom.", "time": 1607168732.0}, {"subreddit": "politics", "text": "Thank you for making my point for me.", "time": 1607168643.0}, {"subreddit": "politics", "text": "Unlike Republicans, Democrats can walk and chew bubblegum. Case and point, 70 failed attempts by Republicans to repeal the ACA.", "time": 1607168543.0}, {"subreddit": "politics", "text": "I totally agree. But let's not pretend that if the Democrats had a President in office, and held a majority in the Senate that we wouldn't have rammed a Supreme Court nomination through five weeks before the election. The difference is we wouldn't have nominated a high price Call-Girl with a law degree to the most important bench in the nation.", "time": 1607163402.0}, {"subreddit": "politics", "text": "I prefer the hashtag #Trumpettes", "time": 1607159783.0}, {"subreddit": "politics", "text": "In Wyoming, anyone who orders a steak cooked above medium-rare is a communist plotting to overthrow democracy.", "time": 1607159735.0}, {"subreddit": "politics", "text": "In fairness, court packing is something both parties do. The difference between Democrats and republicans is that Democrats appoint judges loyal to the law and the constitution.  Republicans only appoint judges who are loyal to the party.", "time": 1607158470.0}, {"subreddit": "politics", "text": "He would view it as a concession.  I'm betting he sits in the oven office sulking, and as soon as Biden is sworn in, he'll immediately fly away on Marine One. I would only hope the D.C. Police snag him at Dulles, to be extradited to NY to be arraigned before he can get out of the country.", "time": 1607063235.0}, {"subreddit": "politics", "text": "Let me show you my shocked face.", "time": 1607056178.0}, {"subreddit": "politics", "text": "Well, I foresee a long and fulfilling career performing on tushy.com for her.", "time": 1606984995.0}, {"subreddit": "democrats", "text": "Representatives of the losing party always raise objections during the electoral college certification hearing in the Senate.  It's like the obligatory tantrum. The only thing that scares me is that Pence will allow them.  They won't mean anything with a split congress, but it will definitely prolong the Trumplican party's little bitch fit.", "time": 1606981926.0}, {"subreddit": "democrats", "text": "Not to mention he has to officially certify the electoral college votes on January 6th.  I predict epic shenanigans in the Senate that day.", "time": 1606958585.0}, {"subreddit": "democrats", "text": "I keep thinking back to the scene in The Rain Maker when Rudy took his oath.", "time": 1606958402.0}, {"subreddit": "politics", "text": "We usually call them inmates.", "time": 1606955366.0}, {"subreddit": "politics", "text": "That's a bold move Cotton.  Let's see if it pays off for'em.", "time": 1606944247.0}, {"subreddit": "politics", "text": "Between the urns and the butt plugs.", "time": 1606944126.0}, {"subreddit": "politics", "text": "Massive voter fraud!", "time": 1606940622.0}, {"subreddit": "democrats", "text": "Trump who?", "time": 1606895396.0}, {"subreddit": "politics", "text": "And pardons don't protect you from state prosecutions.", "time": 1606881358.0}, {"subreddit": "politics", "text": "I knew by the end of the day they would say Barr was in on it.", "time": 1606871293.0}, {"subreddit": "politics", "text": "Queue the Trumpettes claiming that Barr is in on the scam.", "time": 1606851522.0}, {"subreddit": "politics", "text": "I agree.", "time": 1606843317.0}, {"subreddit": "politics", "text": "disbarred in 3... 2... 1...", "time": 1606824978.0}, {"subreddit": "politics", "text": "They have nothing to fear,  God is on their side", "time": 1606799140.0}, {"subreddit": "politics", "text": "A Republican lawmaker in Missouri denounced science?  In other news; water wet, 2020 election was free and fair.", "time": 1606799030.0}, {"subreddit": "democrats", "text": "Good, bring back net neutrality ASAP!", "time": 1606798635.0}, {"subreddit": "politics", "text": "Now the AMA needs to work towards revoking his medical license.", "time": 1606790196.0}, {"subreddit": "politics", "text": "The stooges over at r/republican and r/conservative will just insist he's in on it.", "time": 1606724372.0}, {"subreddit": "politics", "text": "I'm sure the feeling is mutual.", "time": 1606713712.0}, {"subreddit": "politics", "text": "I'm a sucker for a Press Secretary who inspires a conversation no more controversial than her hair color. And I really dig red hair.", "time": 1606697414.0}, {"subreddit": "politics", "text": "I'm a sucker for red hair.", "time": 1606696046.0}, {"subreddit": "politics", "text": "\"In a historic phone call between Kim Jong Un and Donald Trump, Un pointed out Trump's classic rookie dictator mistake was that he wasn't the only person on the ballot.\"", "time": 1606679843.0}, {"subreddit": "politics", "text": "They have a hard time spelling \"district court,\" much less filling complaints correctly.", "time": 1606672719.0}, {"subreddit": "politics", "text": "We dont eat kids?", "time": 1606642555.0}, {"subreddit": "politics", "text": "I dropped in on r/conservative and r/republican tonight just out of morbid curiosity... they've all lost their fucking minds.", "time": 1606633337.0}, {"subreddit": "politics", "text": "The House should tell the Senate that it's a bill that overturns the Michigan election; they'll sign it without even reading it.", "time": 1606627455.0}, {"subreddit": "politics", "text": "I heard that if you ask really forcefully, casinos in Las Vegas will give back the money you lost when you check out.", "time": 1606617928.0}, {"subreddit": "politics", "text": "Lol, I got permabanned from that sub for telling one of their people to \"get a grip.\"", "time": 1606616176.0}, {"subreddit": "politics", "text": "All they did was sit in a circle jerk and say Trump is their real daddy.  Nothing they did carries any force of law.", "time": 1606608980.0}, {"subreddit": "politics", "text": "They've all goten Coronavirus, so I guess \"technically\" they Trump family has gotten positive results.", "time": 1606516211.0}, {"subreddit": "politics", "text": "Theres nothing wrong with cream of mushroom soup.  I just like to make holiday meals from scratch. If everyone just served the greenbean casserole from the back of a Campbell's soup can, they would all be the same.  From scratch recipes allow each meal to have a personal touch.", "time": 1606509907.0}, {"subreddit": "politics", "text": "I know, right! I made it from scratch.  Even made my own frech fried onions. No cream of mushroom soup in my casserole!", "time": 1606507212.0}, {"subreddit": "politics", "text": "Oh no!\n\nI left the greenbean casserole at home!", "time": 1606506974.0}, {"subreddit": "politics", "text": "But the only issue they can rule on is the dismissal anyway. So even IF the SCOTUS hears the case, the dismissal is the only issue that can be contested. So let's assume the worst possible outcome for Biden, they reverse the dismissal and allow the Trump Campaign to amend their complaint.  The lower court will just find any of a million reasons to dismiss the case again, or they'll just schedule the rehearing for Jan 21st, 2028.", "time": 1606506475.0}, {"subreddit": "politics", "text": "It means the best Trump can achieve in the Supreme Court is that the case is returned to the lower court with instructions to hear the case or apply some other standard of scrutiny as a basis for dismissal.\n\nThe Supreme Court or appellate courts do not \"hear\" cases, they either affirm or overturn the lower court's rulings. The lower court has not heard, nor decided the case.  Therefore there is no ruling to affirm or overturn.  The only controversy before them is the lower court's dismissal.", "time": 1606503193.0}, {"subreddit": "politics", "text": "He won't be dragged out.  He will slink away in the middle of the night before the inauguration.", "time": 1606500792.0}, {"subreddit": "politics", "text": "All SCOTUS can do is order the lower court to hear the case or find a different reason to dismiss it.", "time": 1606500496.0}, {"subreddit": "politics", "text": "Even if the SCOTUS heard the case, the only issue they can rule upon is the dismissal, not the election itself.", "time": 1606500414.0}, {"subreddit": "politics", "text": "Even if they did, the only thing they can consider is the dismissal.  Republicans don't understand that, and think that once the case get to the SCOTUS that the court is going to crown Trump king of all the world.", "time": 1606500280.0}, {"subreddit": "politics", "text": "Sure. They can ask for the Third Circuit to reconsider the panel's decision  En Banc, or they can submit a rit of certiorari to the SCOTUS, neither will work, and neither court can consider anything besides the dismissal.", "time": 1606500104.0}, {"subreddit": "politics", "text": "We also have GA runoffs.", "time": 1606370358.0}], "republican_score": 0, "democrat_score": 5}