{"name": "sweller3", "posts": [{"subreddit": "democrats", "text": "I Don’t Hate Women Candidates — I Just Hated Hillary and Coincidentally I’m Starting to Hate Elizabeth Warren\n", "time": 1546563891.0}, {"subreddit": "democrats", "text": "You might not be able to, but you can start by sharing some interesting facts.\n\nJudges appointed by Republican presidents and by Trump himself have tossed-out Trump's challenges for lack of evidence. Trump's head of DOJ, Bill Barr, says there's no evidence of fraud, as does his Homeland Security Cybersecurity and Infrastructure Security Agency. \n\nIf there were *any* evidence of widespread fraud it would have leaked to the press from at least one of the hundreds of official investigations, hearings and court cases, so the only logical conclusion is that none exists. \n\nWild accusations and crackpot theories screamed by Trump and his minions are *not* evidence.", "time": 1607195137.0}, {"subreddit": "democrats", "text": "Good luck collecting court costs..", "time": 1607136617.0}, {"subreddit": "democrats", "text": "Trump's crack legal team hasn't produced any actual evidence or issues of law for SCOTUS to rule on, so as brazenly corrupt and shameless as they are, they'll rightly refuse to hear the case.", "time": 1606530959.0}, {"subreddit": "democrats", "text": "Can someone explain how Trumpster crap like this appears at the top of my feed? Who upvoted it? \n\nIs this what we'll be forced to scroll thru for the next 8 years as Biden undoes the damage Trump did?", "time": 1606403876.0}, {"subreddit": "democrats", "text": "As endebted as Trump is said to be, might he qualify for representation by a public defender when the SDNY comes at him with all guns blazing? That'd be delightfully ironic! Trump receiving welfare!\n\nOf course there are thousands of mediocre Republican lawyers who'd love to make a name for themselves representing him, but if Trump is at all capable of learning -- doubtful as it seems -- he wouldn't trust any of them. A public defender might actually be his best bet.\n\nBut what would you call it if he used a lawyer who'd work for free? \"Pro bono\" doesn't quite fit, does it? How about \"pro malo\" -- for evil...", "time": 1606359002.0}, {"subreddit": "democrats", "text": "Not buying it... If he hasn't noticed by now that Trump lies, he never will. He'll rationalize it somehow and continue bloviating his usual bullshit.", "time": 1606175912.0}, {"subreddit": "democrats", "text": "Sorry, but we're WAY beyond 'both-sider' arguments at this point... The GOP senators are guilty of treason and conspiracy to destroy our democracy.", "time": 1606069874.0}, {"subreddit": "democrats", "text": "It's assumed that Trump simply wields his base like a cudgel against the GOP, but he's more gangster than politician, so we should consider more sinister forces at play. \n\nTrump's hold on the GOP, and the RNC's hold on Republican senators, is more likely based on blackmail material each holds on each other. How else to explain their near total abandonment of the fundamental principles of democracy after the election and \"the voters have spoken\"?\n\nThe GOP had become a criminal enterprise long before Trump, and they've only become more brazen with him. The Biden DOJ will need to go after the GOP using RICO if we're ever to restore our nation. They'll all end up flipping on each other in the end, so proof for the American people will not be a problem.", "time": 1606063561.0}, {"subreddit": "democrats", "text": "This describes Ivanka's fantasy of waltzing out of the White House back to her wonderful prior life, but the smart money is on the SDNY providing them free accommodation someplace upstate...", "time": 1605645561.0}, {"subreddit": "democrats", "text": "This is trickle-down economics in a different dress. Don't tax the rich because they're the nice folks who create jobs and spread the wealth. Utter bullshit disproven over and over and over again.", "time": 1605588011.0}, {"subreddit": "democrats", "text": "Republicans campaign on fear, telling scary lies about what will happen if Democrats are elected. \n\nTheir only plan is to get elected and pack the courts with crooked judges so they can keep getting elected.", "time": 1605493472.0}, {"subreddit": "democrats", "text": "He loaded it with idiots and told them not to do or say anything. His attendance would only have called attention to their deadly irrelevance.", "time": 1605479416.0}, {"subreddit": "democrats", "text": "Tired of this, boris...", "time": 1605478978.0}, {"subreddit": "democrats", "text": "Poor Paul never noticed that all the intelligent people he ever knew unfriended him 4 years ago...", "time": 1605472934.0}, {"subreddit": "democrats", "text": "Capturing the SC by whatever means possible has been the GOPs only goal since they did the math 40 years ago and learned that without cheating, their shrinking base would be the end of their political relevance.\n\nThe Dems never seemed to understand the depth of Republican commitment to this. Well, here we are. With a solid lock on the court they can guarantee the Democrats will *never* win the Senate or the presidency ever again. Our democracy is dead.\n\nUNLESS WE VOTE THE BASTARDS OUT THIS ONE LAST TIME!", "time": 1603884803.0}, {"subreddit": "democrats", "text": "Republican meme/pontification template: \n\n1) Bullshit lie told as if a settled matter of fact\n\n2) Ridiculous/fallacious non sequitur", "time": 1603753532.0}, {"subreddit": "democrats", "text": "Replace with Gestapo?", "time": 1603090988.0}, {"subreddit": "democrats", "text": "In my version of Heaven you can spend your days torturing Republicans in Hell by teaching them the meaning of irony over and over and over again.", "time": 1602705067.0}, {"subreddit": "democrats", "text": "Slow blink...", "time": 1602629391.0}], "republican_score": 0, "democrat_score": 20}