{"name": "drwowe", "posts": [{"subreddit": "democrats", "text": "Joe Biden sounds like a politician. That's a good thing.\n", "time": 1607113937.0}, {"subreddit": "democrats", "text": "Advice on preparing for civil war?\n", "time": 1605730213.0}, {"subreddit": "democrats", "text": "Please help me understand the mind of Trump voters?\n", "time": 1604465199.0}, {"subreddit": "democrats", "text": "Venezuela and Socialism\n", "time": 1604265675.0}, {"subreddit": "democrats", "text": "My first ever party line vote.\n", "time": 1604103275.0}, {"subreddit": "democrats", "text": "Lol yeah but that's not until January.  There's plenty more that needs to be done, but today I just want to appreciate for how \"presidential\" Biden is.  Let me enjoy the moment.  😀", "time": 1607124195.0}, {"subreddit": "democrats", "text": "I completely agree that Republcans are evil enough to do this, but Occam's Razor offers a simpler explanation.\n\nTrump just doesn't give a shit anymore.  He's going to play golf while the virus carries out his revenge on the country that didn't reelect him.\n\nTrump doesn't care about the Republican party either.   He just used them for his own gain. He doesn't care who wins or loses in 2024.  \n\nBut yes, the Senators will play the hand they are dealt, and try to spin the virus fallout for maximum damage to Democrats.", "time": 1605730630.0}, {"subreddit": "democrats", "text": "It's smart for Biden to say that with the Georgia Senate runoffs.  Saying anything else would just energize the trump idiots.\n\nAfter January 11, then we can get serious about prosecutions.  Or really January 20.  No reason to rock the boat until we have real power.", "time": 1605729140.0}, {"subreddit": "democrats", "text": "2020 is the year I realized there is already a civil war in this country.  Republicans already define themselves by hatred of \"libs\" and not much else.  They have no policies, no positions on issues, no solutions for any problem.  The only thing that binds them together is they want us to be destroyed.  They are just like Hitler's supporters, believeng that destroying their \"enemies\" is the solution.\n\nFortunately the violence so far has been limited to a few inept incidents so far but there will be far more to come as 47% of the country simply refuses to acknowledge that Republicans don't control the presidency after January 20.\n\nI urge every sane liberal to do whatever is necessary to stay safe and fight for the soul of freedom and democracy.", "time": 1605728969.0}, {"subreddit": "democrats", "text": "Has to wait until January 16 lol.", "time": 1604784576.0}, {"subreddit": "democrats", "text": "Because\n1) you were beaten in the primary.\n\nThere is no #2, but if there were, you would also have clobbered by Trump in the general.  The election was already close enough that only a moderate like Biden could have pulled it off.", "time": 1604784469.0}, {"subreddit": "democrats", "text": "You're views are very different than mine but I respect your candidness and honesty.  Thank you.", "time": 1604784147.0}, {"subreddit": "democrats", "text": "Thank you.  I will try to keep all my questions to Trump voters respectful.\n\nFirst of all, I don't like all of Biden's policies either.  I'm not a progressive.  I'm a moderate conservative by nature, but I've abandoned the Republican party in the Trump era.  Centrist Democrats like Biden are the best match for me in terms of policy.  But my concerns about Trump go much deeper than policy.  Policies can be changed after the next election.  I think the damage Trump is doing is far more irreversible.\n\nHere are a few questions...  None of which are about specific policies.\n\n1). All politicians lie, but Trump's complete indifference to telling the truth is truly historic and unprecedented.  Do you disagree, or care?  Personally I mute my TV whenever Trump is speaking because I don't want to accidentally remember and believe one of his lies.\n\n2). I believe that Trump has been slowly destroying the competence of the federal government, by replacing competent career professionals with anti-science donors who's only \"leadership\" qualifications are personal loyalty to Trump.  Do you disagree?  Do you care?  (Pandemic response is just the most obvious of many examples)\n\n3). The Republican ideals of limited government, fiscal responsibility, and other ideas old-school Republicans used to talk about seem to have been completely replaced by a cult of personality to one person.  Does this bother you?\n\n4). Some people, myself included, believe Trump's aggressive dismantling of all checks and balances will lead to just another banana republic dictatorship, no better than Russia, China, or even so-called socialist dictatorships like Venezuela or Cuba.  I personally believe Trump will make us resemble those failed so-called \"socialist\" countries far more than the Democrats.  Does this worry you?\n\nI could think of many more questions but I'll stop here.", "time": 1604470664.0}, {"subreddit": "democrats", "text": "Funny sub, they decided to ban all political talk for today only.  🤣", "time": 1604467648.0}, {"subreddit": "democrats", "text": "Thank you, this is exactly the kind of personal perspective I was hoping for.", "time": 1604467441.0}, {"subreddit": "democrats", "text": "No.", "time": 1604467074.0}, {"subreddit": "democrats", "text": "That's good advice. I'll have to write my question carefully though, it's too easy for me to come across as hotheaded.  But your probably right, if I'm respectful enough maybe I'll learn something.", "time": 1604467031.0}, {"subreddit": "democrats", "text": "Maybe I will.  But I'll wait a few days until tensions simmer down.", "time": 1604466584.0}, {"subreddit": "democrats", "text": "I think I'd be more likely to get a quick downvote and ban.  I get the impression they hate even talking to Democrats.", "time": 1604466240.0}, {"subreddit": "democrats", "text": "I'm not a Republican anymore.  Idealistically I still lean a little right of center, but the moderate Democrats like Biden are much closer to me today than any Republican.\n\nI'm a scientist.  I believe in science and facts.  Republicans don't.\n\nI believe in non-hypocritical intellectual honesty.  Not propaganda.  Republicans don't.\n\nI believe in democracy and rule of law.  Republicans don't.  They sacrificed it all for their \"dear leader\" cult of personality.\n\nI do believe a _healthy_ conservative party would be good for checks and balances on the extreme progressive wing of the Democratic party.  Maybe the Lincoln project will go somewhere.  Maybe not.\n\nWith the shambles of the Republican party today, I'm a Democrat until further notice.  :)", "time": 1604466064.0}, {"subreddit": "democrats", "text": "Republicans are a modern organization of terrorist thugs and they love Trump because he cheers them on.\n\nA vote for Biden is a vote to end terrorism at home.", "time": 1604221450.0}, {"subreddit": "democrats", "text": "Lol I still remember my kindergarten mock election.  Walter Mondale beat Ronald Reagan in a landslide.\n\nToo bad us Gen X-ers never had the demographic numbers to be relevant.", "time": 1603837632.0}, {"subreddit": "democrats", "text": "Q: How do you know when a Republican is lying?\n\nA: They are speaking.", "time": 1603826227.0}], "republican_score": 0, "democrat_score": 23}