{"name": "AngryOrca1", "posts": [{"subreddit": "democrats", "text": "Trumps Twitter reeks of desperation.\n", "time": 1601905386.0}, {"subreddit": "democrats", "text": "Went to the r/Trump sub, made a comment I thought was correct, this is the response I got.\n", "time": 1598199838.0}, {"subreddit": "democrats", "text": "I'm so sick of the word Trump in my life. Cant wait to get biden in as president and have a boring presidency. \n\nI'm not a Democrat or republican as I tend to flip depending on the policies,  but my god, enough Trump! You lost, gtfo.", "time": 1607191440.0}, {"subreddit": "democrats", "text": "What proof has convinced them it was rigged? Surely its more than Trump saying so because he's a sore loser.", "time": 1607191156.0}, {"subreddit": "politics", "text": "Prove it. Trump failed to.", "time": 1607143461.0}, {"subreddit": "democrats", "text": "I have no faith in our country after this year, but the Biden win is a step in the right direction.", "time": 1606919811.0}, {"subreddit": "democrats", "text": "I guess I'm in the middle on this one. I know there are large groups of impoverished people in this country that game tge system to collect stamps, welfare, etc. And exploit it so that they don't have to ever work. I do not support giving my money for that. The efforts should be to cure the problem at its root, not put bandaids on it.", "time": 1606919492.0}, {"subreddit": "democrats", "text": "Agree on the remove qualified immunity.  Cops operate under a shroud of protection, allowing them to abuse their power. \n\nAs a white man, while I have had an instance with a cop abusing his power, for the most part they have left me alone when they pull me over and such so I also agree with your 3rd paragraph. \n\nI also think the idea of defunding the police is the wrong tactic.", "time": 1606919266.0}, {"subreddit": "politics", "text": "You do hit on a point about technology then vs now. I too am curious what it would have looked like back then.", "time": 1605984870.0}, {"subreddit": "politics", "text": "We are structured that way. Its the execution of it that problems arise.", "time": 1605984794.0}, {"subreddit": "politics", "text": "Unfortunately yes. But only because humans are flawed. At least we aren't as bad as some other countries.  So its not a huge thing for me. Im happy. \n\nWhat country you from?", "time": 1605984510.0}, {"subreddit": "politics", "text": "Lmao, was thinking same thing. Nice", "time": 1605974738.0}, {"subreddit": "politics", "text": "Its not the party I find sad (this type of thing i expect) its the people who blindly follow, the supporters who are ready to \"go to war\". I've never seen so many violent social media posts calling for war on liberals in my entire life. The sentiment these people have is scary and sad. Im ashamed of this nation.", "time": 1605973638.0}, {"subreddit": "politics", "text": "Wow....just wow.\n\nOR there is one other possibility.  Trump is full of shit!!!", "time": 1605970300.0}, {"subreddit": "politics", "text": "How do the supporters still believe election is rigged when multiple courts throw their cases out?\n\nAre the courts in on it as well?", "time": 1605967410.0}, {"subreddit": "politics", "text": "I never get tired of seeing these. Because the more I see it, the more mad it will make Trump.", "time": 1605886656.0}], "republican_score": 0, "democrat_score": 7}