{"name": "Babbalonia", "posts": [{"subreddit": "democrats", "text": "So who bought joe Biden and Kamala Harris?", "time": 1607208635.0}, {"subreddit": "politics", "text": "Why are democrats so afraid of minorities voting for republicans", "time": 1604280193.0}, {"subreddit": "politics", "text": "They do tho", "time": 1604102015.0}, {"subreddit": "politics", "text": "That is not good. Money does not make a good candidate. Poor people don’t have money to fund campaigns. Rich private enterprise does and they are clearly saying this guy in office will make them richer", "time": 1602430434.0}, {"subreddit": "democrats", "text": "It is relevant to the fact that whites did not invent slavery.... considering you are questioning my motive. I highly recommend you figure out your own. You are going through life seeking conflict. This discussion is another fact in point. You are angry and seek to release your hate on others whether digitally or physically. I preach peace and the truth. You attack and lie and live in hate..... if I was you I’d go fact check those emotions of yours and go deal with your own issues before speaking up on matters that you do not understand", "time": 1602106369.0}, {"subreddit": "democrats", "text": "Facts are different from an opinion \nFact African Americans were sold into slavery by their own people or rival tribes \nFact African Americans were exploited around the globe and bred to be a living tool \nFact these are horrible truths that can not be forgotten or forgiven\nFact these people were never set up for success in America and have suffered since the beginning \nFact the president does not condone racial violence \nOpinion the president is not racist and doesn’t support racism openly or privately \nTotal propaganda is what you are pushing by claiming the president and vp are bigots \n\nPlease check your facts \nRacial violence is not new nor a problem tailored to this administration \nIt is a sad part of this world that has not gone away because people like you live with hate in their hearts \nYour hatred is the. Spewed all over the Internet \nUnfortunately some people go one step further when they spew their hatred \nThey go and take someone’s life \n\nYou should not live full of hate", "time": 1602101924.0}, {"subreddit": "democrats", "text": "So hate crimes were happening during Obama’s presidency? \nWait I thought black people were only murdered while trump was in office.....", "time": 1602101182.0}, {"subreddit": "politics", "text": "Do not live in fear. The left is here to", "time": 1601971835.0}, {"subreddit": "politics", "text": "Uhm he didn’t have a majority and how is he a failure for not having a conservative in every position of power? There is more then one party in this nation. No party should have control over every single office at the same time. \nThat would be a dictatorship \nSecondly who are you to judge. \nAny good history teacher would tell you. That you need ten years of human history to go by before you can judge a president fairly \nThird you sound incredibly sensationalist about trump. \nFourth off he spent three years fighting a fake impeachment hoax, a crooked fbi, a hateful media mob, ignorant people like you croaking failure lie, I hate you and so on. Oh and btw he ended the North Korean threat to America \nStared down Russia \nBrought peace to the Middle East \nRenenogiated trade deals \nWages were going up \nJobs were at an all time high \nUnemployment at an all time low \nOh and he brought America through the global covid pandemic that was supposed to have killed millions and he did it without going to war or instigating a race riot \nThat was the media \nNo white supremacy groups are currently rioting \nOnly the leftist antifa and BLM’rs are rioting \n\nSo quit chasing those invisible neo nazi ghosts and go educate yourself on what it really means to be president in a country full of hateful morons like yourself", "time": 1601508091.0}, {"subreddit": "politics", "text": "He has been in office for almost 4 years and no one has lost innsurance \nHe is more\nModerate then you realize", "time": 1601506956.0}, {"subreddit": "politics", "text": "Yet Biden didn’t disavow antifa. There are no white supremacy riots currently burning major American cities for over 100 days.... I mean what is the real issue here. We are realistically watching protestors burn cities and chasing neo nazi ghosts. That quite frankly don’t have any real power. Because quite frankly white people aren’t a monolithic racist institution no matter how badly that old white man Biden wants his voter base to believe that all white men and women are racist.", "time": 1601484623.0}, {"subreddit": "politics", "text": "Uhm Biden literally said the polls should stay open until all the votes have been counted.... (that could be for 5-6 weeks)  and he wanted to  have enough workers to have people literally stand their and watch the polls. Both sides literally asked their base to stand outside polls and watch you vote..... that is voter intimidation at its finest. #EducateYourself #MediaGuppy", "time": 1601470750.0}, {"subreddit": "politics", "text": "Hence my it’s not possible disclaimer on my post. It’s an ideal that isn’t possible but she still tried and that was what made her an unforgettable teacher. \n\nWell I hope some of your former students out there look up to your helpful teachings the way I do to hers", "time": 1601122124.0}, {"subreddit": "politics", "text": "Difference of opinion and even a different application. She believed children would try to curry her favor and would mimic her beliefs to gain her approval. \n\nShe felt that depriving of us her opinion would force us to formulate our own opinions. And I must say it did force us to think. That class was full of debates between the religious and ethnic diversity in that class. I learned a lot about everything in life and one take away I can share is that everyone has opinion. What they do with that opinion is the definition of maturity \nEspecially with children you find them sharing their opinions everywhere and as we get older we find ourselves sharing less and less and just doing what we do. \n\nThis teacher understood we need to let children learn in a vacuum even if that wasn’t possible because bias will always be present", "time": 1601098347.0}, {"subreddit": "politics", "text": "Except for the fact all my teachers are liberal and only share liberal views. I can’t stand that even tho I am pro choice and pro gun rights. What a f’n conundrum, like I miss this high school teacher I had who taught AP US history and she never shared who she voted for. We asked this woman every single day. I mean I literally tried to interrogate her, entrap, and trick and she never shared. I even visited years later with my college diploma in hand and happened to see her and the first thing I did was ask who she was gonna vote for. And she still wouldn’t tell me!!! Lol she said politics are a personal choice and as a teacher I am not here to force my beliefs on you. I am here to educate on the fact that politics matter, us history matters, and your choice matters regardless to my own choice. That is a pinnacle of teaching I have yet to encounter in college. Or in life.", "time": 1601096912.0}], "republican_score": 0, "democrat_score": 4}