{"name": "Primepolitical", "posts": [{"subreddit": "democrats", "text": "The GOP Is to Blame for Hate Speech on Social Media\n", "time": 1607055055.0}, {"subreddit": "democrats", "text": "How to Prevent the Rise of the Trump Cult in the Future\n", "time": 1606867887.0}, {"subreddit": "democrats", "text": "Why We Should Never Forgive the GOP\n", "time": 1606265230.0}, {"subreddit": "democrats", "text": "Trump’s Top 5 Lost Opportunities for an Election Win\n", "time": 1605127511.0}, {"subreddit": "democrats", "text": "“The One Question Every GOP Voter Should Ask” What is the plan?\n", "time": 1602779135.0}, {"subreddit": "democrats", "text": "You need a new party -- we all do. I suggest, \"The Moderates\".", "time": 1607194074.0}, {"subreddit": "democrats", "text": "No worries.", "time": 1607101581.0}, {"subreddit": "democrats", "text": "Can you point to anything in the article that excuses that?", "time": 1607101529.0}, {"subreddit": "democrats", "text": "You are simply reacting to the headline and didn't read the article when it addresses this.", "time": 1607098035.0}, {"subreddit": "democrats", "text": "Try reading the article.", "time": 1607097974.0}, {"subreddit": "democrats", "text": "You might want to actually read the article instead if just the headline? Because it's about the failure if GOP leaders to distance themselves from their \"nutters\".", "time": 1607097948.0}, {"subreddit": "politics", "text": ">I do not believe all Trump supporters are racist or fascists. I believe most are horribly uninformed and many lack a basic education. Wealthier voters in the upper echelons benefited from his bumbling leadership, but most poor and rural Republicans simply lack an intellectual foundation on matters of law and politics. Knowledge of basic civics eludes them.\n\n[The Rise if the Trump Supporter]( https://link.medium.com/79i1mdujSbb)", "time": 1607091491.0}, {"subreddit": "politics", "text": "I am shocked, I tell you. Shocked", "time": 1607062394.0}, {"subreddit": "politics", "text": ">The last four years have demonstrated that the GOP will stop at nothing, including unconstitutional acts, corruption, or obstructionism to further their agenda. When they have the upper hand, it’s a power and money grab. They don’t care about leading. They don’t care about the country. They don’t care about you.\n>The GOP seeks to end any kind of bipartisanship. They are bent on complete control and political domination.\n\n[Why We Should Never Forgive the GOP]( https://link.medium.com/sXoqIADKGbb)", "time": 1606933206.0}, {"subreddit": "democrats", "text": "Thanks.", "time": 1606673418.0}, {"subreddit": "politics", "text": ">The GOP’s unwillingness to speak out against their destruction and abuses mean they own it. The Party’s leadership — the inner circle that convinced Richard Nixon to resign over Watergate — could not convince Trump to concede an election he clearly lost.\n\n>They will use the next four years whitewashing the blatant crimes and demanding a return to political norms they can smash in the future.\n\n [Why We Should Never Forgive the GOP](https://link.medium.com/sXoqIADKGbb)", "time": 1606664037.0}, {"subreddit": "democrats", "text": "Neil Casler is a comedian who worked on *The Apprentice.* He talks about the Trump family and what a POS Donnie was. He has been interviewing about Trump shitting his diaper in a rage.", "time": 1606662947.0}, {"subreddit": "politics", "text": "Let me share the logic that gets these people sick. I am going to try explain how these people think.\n\nMy Trumper relatives came for a visit for two days -- a very short trip. \n\nI told them we were having a particularly bad surge and few people wear masks. I also told them that if anyone in my household got COVID they would likely die because our ICUs were full. We don't go out -- at all. We have groceries delivered.\n\nThey decided to meet others from another surge city for lunch at a sit down restaurant. When I turned them down because it \"wasn't safe,\" they lectured me how I was overreacting to the dangers and that I didn't understand how it's really not a big deal.\n\nApparently, because they having been dining indoors in their own hometown, it is perfectly safe to eat is restaurants elsewhere. Open restaurants equals \"safe.\" Also, they think they had it already.\n\nSo here is their logic. You have to understand their *disconnect* between cause and effect. I finally understood it.\n\nIf restaurants are open, then it is safe to eat. The problem isn't that people get sick at restaurants, it's that politicians have closed dining. These two thing in their mind have everything to do with people dying. But they think the restaurants are open because they won some battle *and* if restaurants are open, the pandemic is under control. Closing them is what makes cases soar because that is what happens when the government shuts things down.\n\nMask rules are bullshit -- it has nothing to do with keeping people healthy. They only have to wear a mask because the government requires it, NOT because it keeps people safe. People didn't wear masks before COVID, therefore, masks are the reason we have a pandemic.\n\nThe same logic disconnect applies to things like Hillary's emails. When they said she should be tried for treason, I asked if *anyone* in the administration using private emails should be tried? They said yes, so I asked if that included Ivanka who was doing literally the exact same thing? They simply could not apply the same rules to another situation. They could not understand how Ivanka's email server had anything to do with Hillary since one was under Obama and the Other under Trump. I am serious. Being part of their \"team\" meant their actions could not possibly be corrupt.\n\nThey argued that government single-payer healthcare was \"socialism\", but defended being on Medicare that they were entitled to it. Again, because it served them, it was good.\n\nThis is how they think.", "time": 1606340014.0}, {"subreddit": "politics", "text": "It's almost as bad as the ones who think the election was rigged, but only in races Trump lost -- but Dems didn't also screw with Senate races.", "time": 1606336649.0}, {"subreddit": "democrats", "text": "So does that excuse Trump? \"Hitler sucked worse, so. . .\"", "time": 1606320602.0}, {"subreddit": "politics", "text": "I have serious doubts he has received the more sensitive intel for years", "time": 1606065231.0}, {"subreddit": "politics", "text": "One can hope.", "time": 1606051305.0}, {"subreddit": "politics", "text": "I think it's Ivanka because she would be a last defense for Daddy. Eric and Jr. Didn't benefit as much, so don't have near the exposure. Additionally, Ivanka probably grasps the severity of the situation beyond just \"oh shit\" -- her cooperation would be helpful. Plus as a mother, they probably played the \"but your kids\" card. She knows going to prison would fuck her little family. \n\nIvanka has a lot more reason to save herself and the ability to understand how bad it's going to go. \n\nShe will roll so fast, it will make your head swim. I will bet she says one thing publicly while cooperating fully.", "time": 1605998826.0}, {"subreddit": "politics", "text": "It may help his own 2024 election bid", "time": 1605981985.0}, {"subreddit": "politics", "text": "If he pardons him, he can never run again.", "time": 1605981921.0}, {"subreddit": "politics", "text": "Fun fact: Rico charges can be brought in state or federal court for this very reason.", "time": 1605981798.0}, {"subreddit": "politics", "text": "Bags of soup.", "time": 1605981640.0}, {"subreddit": "politics", "text": "And no surprise to anyone, Ivanka was selected because she is so ruthless and self-serving and she knows the most.", "time": 1605981274.0}, {"subreddit": "democrats", "text": "They are fucking incompetent they can't even get this right with four years to plan, unlimited funds, and a super power with experience in fucking with our elections behind them.\n\nThat is how incompetent Trump and the GOP are", "time": 1605939616.0}, {"subreddit": "politics", "text": "You forgot the healthcare and pensions.", "time": 1605930328.0}, {"subreddit": "politics", "text": "The best part is that you can tell she *just now* realized she is in trouble.", "time": 1605906587.0}, {"subreddit": "politics", "text": "Mocking of a disabled person should have been the end.", "time": 1605906401.0}, {"subreddit": "politics", "text": "\"Sir,\" a man came up to me with tears in his eyes, \"those are the most tremendous words I have ever heard. You are God.\"", "time": 1605906296.0}, {"subreddit": "politics", "text": "God, me too.", "time": 1605906040.0}, {"subreddit": "politics", "text": "Most likely, the tax guy would testify against her.", "time": 1605905599.0}, {"subreddit": "politics", "text": "The National Newspaper Association should have sponsored a paywall years ago for $10 a month to all member organizations, the money distributed by readership. \n\nNot a part of the program, then you end up charging a ton to set up and administer the paywall.\n\nIt isn't paying money to read, it's paying for 9 out of 10 publications I don't read more that one article a month.", "time": 1604940167.0}, {"subreddit": "politics", "text": "I want to see Ivanka perp walk.", "time": 1604939567.0}, {"subreddit": "politics", "text": "Melania wore head to toe Tiffany blue to the Inauguration and gave Michelle Obama a gift from Tiffany's.", "time": 1604937927.0}, {"subreddit": "politics", "text": "It was rumored the paperwork was ready to be signed the day after the 2016 election. My guess is the money has already been deposited into a trust or something. I have always thought that was one of the reasons he hid his taxes. He doesn't want the world to know he is paying her still.", "time": 1604937793.0}, {"subreddit": "politics", "text": "\"I filled in the Trump bubble with a pen and it changed to a sharpie.\"", "time": 1604902086.0}, {"subreddit": "politics", "text": "Trump is in physical and serious cognitive decline. I don't expect he will be alive in five years.I am more interested in the kids going down and seizing their assets.", "time": 1604873491.0}, {"subreddit": "politics", "text": "Retaliation probably won't be anything overt.", "time": 1604864428.0}, {"subreddit": "politics", "text": "Including Pence.", "time": 1604857607.0}, {"subreddit": "politics", "text": "He isn't going to have time, money, or freedom for rallies.", "time": 1604856505.0}, {"subreddit": "politics", "text": "I can guarantee you he does not realize what is at stake.", "time": 1604856198.0}, {"subreddit": "politics", "text": "\"Pranksters\" has greater SEO value", "time": 1604856000.0}, {"subreddit": "politics", "text": "I don't think Trump has a firm grasp on reality and I am sure he doesn't understand the consequences. He may have a vague notion he is facing trouble, but probably thinks it's more about his kids than himself. \n\nI am betting he thinks things like Secret Service \"protection\" means immunity from prosecution. He never dealt with this before, he hires lawyers to fight his legal battles. In his mind, it's about losing money because that is what it's always been. When it failed, it was his lawyers fault.\n\nWhile he is a con man, he is also like much  like his base -- stupid and ignorant. \n\nAs an example, McConnell let him believe that the Supreme Court would simply declare him king without understanding anything about the legal process. You can recognize this in his legal flailing about -- he is simply clueless that you have to have evidence. You can see he is demanding they \"file something\" -- which they did.\n\nTrump has skated by without knowledge his whole life. He cheated in school, he lied his way out of military service, he never worked his way up in a business.  He bought his way into everything.\n\nHis base identifies with this. These are the people who believe life is like a team sport -- church is for networking, climbing the ladder means screwing the competition.\n\nThe trouble with that is you don't develop knowledge of how systems work. He was never an elected official so he has zero knowledge of civics. He probably changed the channel when Schoolhouse Rock came on.\n\nYou're dealing with a desperate man who doesn't know how the world works in ANY capacity. He doesn't know how business operates. He sits in his dirty diapers and barks commands at people. He has other more ambitious people around him who connive and scheme so Trump just claims the ideas for himself.\n\nIf you think this man has an inkling the difference between a crime and tort, you are sadly mistaken. The reason his supporters are so stupid and craven is because they identify with him. Look at the idiots around him. Look at his kids. Ivanka managed to bankrupt her clothing line while having the public eye of the US presidency. Think about that level of incompetence.\n\nThis isn't for the sake of being insulting. You need to understand that Trump does not know how business, law, or politics works. He never had to because his money paid for other people to handle the details.\n\nHe doesn't know he is facing *criminal* charges. Even if someone managed to convince him of this, he has absolutely no frame if reference for it. \n\nHe will think he has to pay a fine.\n\nThere is no getting Pence to pardon him *unless* his attorneys are pushing it through to save their own asses. Pence may benefit from the move, so it might happen. But don't forget he is dirty, too and likely to ask for a blanket pardon first and then leave Trump hanging. \n\nBut make no mistake, when Trump is no longer useful, and no longer has money, they will bail, including his kids. I will bet Melania has already left because she probably knows more about his legal problems than he does.", "time": 1604854506.0}, {"subreddit": "politics", "text": "I believe they would simply require the event pay more money for overtime and last minute booking.", "time": 1604851195.0}, {"subreddit": "politics", "text": "I thought it was satire all day yesterday, like someone made it up. Like Ghouliani held a presser at a porn shop just seemed too absurd.", "time": 1604850814.0}, {"subreddit": "politics", "text": "I think Trump demanded they book the Four Seasons and with his dark mood, no one said anything. Trump just assumed it was a go.\n\nStaff called the hotel, they either outright told them no, or they asked for payment up front and a massive deposit due to anticipated damage from his rally goers.\n\nNo one wanted to tell Trump and his staff probably argued who was going to give him the bad news. \n\nSo they went to their donor rolls and found a Four Seasons donor or Republican.  This was their solution and Trump rolled with it.", "time": 1604850014.0}, {"subreddit": "politics", "text": "I think the Four Seasons Hotel probably asked for payment up front and someone told the new guy to fix it.", "time": 1604849097.0}, {"subreddit": "politics", "text": "He will claim -- with a straight face -- that he never ran for reelection.", "time": 1604771924.0}, {"subreddit": "politics", "text": "The debate with remote audio control, too.", "time": 1603351600.0}, {"subreddit": "politics", "text": "Give the tapes to The Lincoln Project.", "time": 1603351524.0}, {"subreddit": "politics", "text": "Followed by the Rudy Giuliani Borat segment.", "time": 1603351258.0}, {"subreddit": "politics", "text": "If they were brown, the cops would have shot them.", "time": 1603351056.0}, {"subreddit": "politics", "text": "*\"I have never met the guy.\"*", "time": 1603350901.0}, {"subreddit": "politics", "text": "Thursday is the debate shit show. I am going to explode with excitement.", "time": 1603350838.0}, {"subreddit": "politics", "text": "I wonder if this establishes probable cause to search his home for evidence?", "time": 1603350724.0}, {"subreddit": "politics", "text": "People who have seen it says it's worse than it sounds.", "time": 1603350626.0}, {"subreddit": "politics", "text": "As far as I know, most victims don't rape themselves.", "time": 1603349896.0}, {"subreddit": "politics", "text": "Married to his cousin.", "time": 1603349714.0}, {"subreddit": "politics", "text": "Antitrust is okay, too -- for billion dollar corporations.", "time": 1603349459.0}, {"subreddit": "politics", "text": "Don't worry they will and no one will be punished.", "time": 1603349350.0}, {"subreddit": "politics", "text": "And a male.", "time": 1603349262.0}, {"subreddit": "politics", "text": "Did you see the text from Ivanka? Rudy is so clever, he verified it was her because she sent him a selfie.", "time": 1603349191.0}, {"subreddit": "politics", "text": "It's a spiritual problem.\n\n>A governing spiritual principle of the universe is that creativity builds until it depletes all available resources and destroys itself.\n\n>Destructive influences continue to dismantle what has been created until there is nothing left so it destroys itself.\n\n>The Republicans seek to hinder movement forward, hence the term “conservatism.” Their focus is on the traditional. They want to slow, stop, or even reverse the progress made in previous decades. You may believe this to be stifling certain ethnic groups, genders, or keeping old power structures in place.\n\n>Think of Democrats as creators and Republicans as destroyers. This is not as a moral judgment of which is better.\n\n>Think about a criminal organization. If allowed to continue unopposed, thieves will eventually steal from each other. It’s the nature of destruction. It does not stop until it consumes itself. If the goal of the organization is to lift up everyone, then no one will be king of the hill. If the focus is to elevate yourself in power, you must destroy your competition until there is no one left but yourself.\n\n[“The One Spiritual Reason Why the GOP is Destroying Itself”](https://link.medium.com/lzMhATHBMab)", "time": 1603348856.0}, {"subreddit": "politics", "text": "It's going to be a fucking landslide against the GOP.", "time": 1603344603.0}, {"subreddit": "politics", "text": "For a falsified birth certificate", "time": 1603344474.0}, {"subreddit": "politics", "text": "Trump's team should be fucking applauding this. At least this time, he has a sliver of a chance to not look like a complete shit-weasel.", "time": 1603161903.0}, {"subreddit": "politics", "text": "Better yet, he gets the emails from Russia, *adds kiddy porn* to the hard drive. Gets busted on separate charges on all of it", "time": 1603141129.0}, {"subreddit": "politics", "text": "[Noel Casler, for one.](https://twitter.com/CaslerNoel/status/1317101866220769281?s=19)", "time": 1603140284.0}, {"subreddit": "politics", "text": "And he wears diapers and smells like sour piss.", "time": 1603132570.0}, {"subreddit": "politics", "text": "I have often wondered if there wasn't some kind of secret court order that allows them to feed Trump disinformation since they have given him multiple medical exams.", "time": 1603131663.0}, {"subreddit": "politics", "text": "He is Kardashian now", "time": 1602861151.0}], "republican_score": 0, "democrat_score": 15}