{"name": "Muesky6969", "posts": [{"subreddit": "democrats", "text": "Even Trump’s attorneys are not down with the sickness\n", "time": 1605154951.0}, {"subreddit": "democrats", "text": "This is the propaganda that the republicans are trying to push\n", "time": 1599065261.0}, {"subreddit": "democrats", "text": "Don’t just vote, contact your elected officials and tell them how you will vote if they refuse to do there job.\n", "time": 1591037310.0}, {"subreddit": "politics", "text": "Our president’s theme song!!\n", "time": 1586575579.0}, {"subreddit": "democrats", "text": "Nice work!!", "time": 1607092756.0}, {"subreddit": "politics", "text": "I know, right. It’s like they revival in being stupid. What’s even worse is how threatened they are by people who chose to be thoughtful and educate themselves. And holy cow if you are a thoughtful educated woman, well you must be in league with the devil.", "time": 1606922920.0}, {"subreddit": "democrats", "text": "Neither has reality from what I can tell. Lol!", "time": 1606919918.0}, {"subreddit": "politics", "text": "Hell conservatives didn’t just cheer devos and the orange orangutan that appointed her, they basically emptied their pockets to these grifters. I am so absolutely sick of the level of ignorance in this country. Of course people like devos and the rest of the GOP don’t want free higher education, why waste money on dumb slave labor.", "time": 1606919479.0}, {"subreddit": "politics", "text": "Thanks!", "time": 1606711638.0}, {"subreddit": "politics", "text": "Wouldn’t that be Cheeto puffs? Lol! Sorry I couldn’t help myself.", "time": 1606708033.0}, {"subreddit": "politics", "text": "That right there!! That should be Biden/Harris slogan. Thank you!!", "time": 1606677972.0}, {"subreddit": "democrats", "text": "Think of it this way, if he is pitching a fit over being called Diaper Don he isn’t pardoning his criminal friends. \n\nSpeaking of that what ever happened to Epstein’s human trafficking whore of a girlfriend? You know the one trump “wishes her well”.", "time": 1606676816.0}], "republican_score": 0, "democrat_score": 6}