{"name": "WhatUpDoeFam", "posts": [{"subreddit": "politics", "text": "Ilan married her gay brother to commit immigration fraud\n", "time": 1563638560.0}, {"subreddit": "republicans", "text": "I've said it once and I'll say it again it is absolutely impossible for Biden to have won legitimately. More minorities voted for Trump than any other Republican candidate in 60 years everyone and their mom knows that Democrats cannot win any election anywhere without getting a large portion of their votes from minorities. Everybody had their hand in it on the Democratic side to rig the election. The amount of fresh new Democratic votes to Catapult Biden into a win after losing that many minorities is basically theoretically impossible", "time": 1607111104.0}, {"subreddit": "politics", "text": "I LOVE HOW YOU CAPITALIZE UNCONTROLLED LIKE ITS SOMEONES FAULT. DO YOU KNOW WHAT A PANDEMIC IS???  ITS SPECIFICALLY AN UNCONTROLLED EPIDEMIC ACROSS THE GLOBE. I DO FEEL SORRY FOR YOU THAT YOU LIVE IN CALIFORNIA WITH ONE OF THE SHITTIEST GOVERNORS FOR POLICIES DURING THE PANDEMIC IN AMERICA THOUGH. GOODLUCK", "time": 1605234622.0}, {"subreddit": "democrats", "text": "Democracy involves fair elections luckily there's about to be 4 in depth audits in battleground states and there's a serious fraud with dominion systems all tailored to switching votes from Trump to Biden in multiple states. On top of it the person running the system worked for pelosi for awhile. Big time fraud about to go public by November 20", "time": 1605234348.0}, {"subreddit": "politics", "text": "I'm glad this confirmation hearing is a waste of time. She's getting confirmed and Biden is losing on November. Time to get over it libs.", "time": 1602807738.0}, {"subreddit": "politics", "text": "It's impressive how many people in the center or left leaning prior to 2016 that are voting for Trump this year.", "time": 1601246881.0}, {"subreddit": "politics", "text": "Nice lil lie by the left. If only USA citizens got a dollar for everytime democrats lie we might actually have socialism", "time": 1601076064.0}, {"subreddit": "politics", "text": "That's funny the FBI caught lefties throwing away military votes for Trump. Democrats literally can't win unless they do something to steal the election. It's so funny how the left uses Russian collusion as a smokescreen for all the shit that they do to try to meddle in the election", "time": 1600986681.0}, {"subreddit": "politics", "text": "Operation war speed that the left opposed because they were afraid of it being finished before novembers election and the first country to administer vaccines countrywide without adverse side effects would be a shitty place to not share that patent with the rest of the world", "time": 1600477995.0}, {"subreddit": "politics", "text": "Easier?  Were beating this virus in less than a year without shutting down our economy. That's the best we can do regardless of all the cry babies about masks and lockdowns", "time": 1600448301.0}, {"subreddit": "politics", "text": "Every disease goes away at some point. This is how pathetic the social media keyboard warriors of science are. There wasn't vaccines nor did they even know what a virus was during the black plague and it disappeared. This virus will disappear from USA before any other country and that is specifically because of trumps policies. Quit watching CNN and nbc for once and get some real facts", "time": 1600448056.0}, {"subreddit": "politics", "text": "How dumb is this post. Biden and fam are the ones who denounced trumps early response to the coronavirus as racist and xenophobia. What a smoke screen to how bad Biden's policies have been for decades", "time": 1600447868.0}, {"subreddit": "democrats", "text": "You are stupid there's a big difference between a couple people being racist and the country as a whole. You have 10 gang members living in a city does it mean everyone that lives in that city are gang bangers?  Grow the fuck up. Her speech was actually empowerment letting people know that just because someone tries to hate on you and knock you down doesn't mean you have to let it control your outcome on life. You liberals are more concerned about talking shit about other peoples lives that you forget to make any positive changes of your own. The most miserable people in this country are liberals. That's not a coincidence", "time": 1598404719.0}, {"subreddit": "democrats", "text": "It's actually all facts that you can flat out learn on your own if you actually took the time to research it instead of just believing the anti Trump rhetoric you get fed through the media outlets you choose to listen to on a daily basis. The media controls vulnerable democrats people are finally able to fact check everything in this era of public knowledge and you would be surprised on how many democrats have switched over this election after they realized how long they have been manipulated. Although Trump maybe the first President or the most famous to coin the term fake news it's only been a secret to people that follow very limited news sources. People have woken up these past four years and a lot of the swamp has been drained. There's still people in China that believe everything state run news throws at them. But the ones that find out they've been lied to are against the CCP and learned to vpn and find the real news when the state puts out propaganda. The same things have been happening to vulnerable democratic voters over the past four years. Once you realize you're manipulated you can't ever trust that party again until at least major changes are made.", "time": 1598403631.0}, {"subreddit": "democrats", "text": "Read it from forbes\nhttps://www.forbes.com/sites/markjoyella/2020/08/25/158-million-viewers-watch-first-night-of-republican-convention/#7030bb181cd1\n\nSmashed records watching it on fox that site lied to you. All left wing outlets with anti Trump rhetoric either flat out lie, don't cover something on purpose to mislead vulnerable democrats,  or bend the truth by only telling part of the whole story. Very typical that's how they have been manipulating votes for along time by controlling the media of what they allow you to see knowing you'll only get your news from one or two left wing sources that tell the same story the entire presidency. They've never aired or covered any of the amazing policies Trump did for people of color that Obama didn't so they can continue the narrative of pinning racism on him it's disgusting", "time": 1598402212.0}, {"subreddit": "democrats", "text": "Completely false\nhttps://www.forbes.com/sites/markjoyella/2020/08/25/158-million-viewers-watch-first-night-of-republican-convention/#7030bb181cd1", "time": 1598402170.0}, {"subreddit": "politics", "text": "This is such a bullshit troll page made by a ❄️", "time": 1548898159.0}], "republican_score": 1, "democrat_score": 5}