{"name": "rscarson51", "posts": [{"subreddit": "democrats", "text": "Idiots Out Wandering Around = IOWA", "time": 1607024285.0}, {"subreddit": "democrats", "text": "Turkey!", "time": 1606769547.0}, {"subreddit": "democrats", "text": "Diaper rash has spread to his lobotomy scar!", "time": 1606530649.0}, {"subreddit": "democrats", "text": "Just like in 2016 , people didn't vote for trump, they voted against Clinton. In 2020 they didn't vote for Biden, they voted against trump. That's the way it works in America,  you don't vote for who you like, you vote against who you hate. Even though Clinton got more votes than trump,  she didn't get the right (no pun intended) votes.", "time": 1605954917.0}, {"subreddit": "democrats", "text": "She can't land a blow job!", "time": 1605557029.0}, {"subreddit": "democrats", "text": "That fumble fingers never caught shit - including covid,  that was merely a ploy to prove that covid was just a made up virus, as anyone in as good of condition as the orangeman could easily defeat. I said from the start there was no way he had covid.", "time": 1605487927.0}, {"subreddit": "democrats", "text": "I don't know who he is!,  but I KNOW WHAT HE IS!!!!!!.  Get 'em lady g.", "time": 1605411746.0}, {"subreddit": "democrats", "text": "74 million thought he was a POS!", "time": 1605102004.0}, {"subreddit": "democrats", "text": "I hear the lighting is better in prison..... It is what it is!", "time": 1604749086.0}, {"subreddit": "democrats", "text": "I love stupid people, if I run it would be as a republican, their the dumbest suckers ever born, and like me they agree vice is nice but INCEST is BEST, somebody said they heard from some people who say that benedict donald was supposed to have said that!  Posted by a True American!!!!!!", "time": 1604581427.0}, {"subreddit": "democrats", "text": "Next to trump , ronnie is the worst president in history! I wonder who told him to utter those regurgitate  words?", "time": 1604572396.0}, {"subreddit": "democrats", "text": "He's a fucking republican..... DUH!", "time": 1604426959.0}], "republican_score": 0, "democrat_score": 12}