{"name": "Reddit_Deluge", "posts": [{"subreddit": "democrats", "text": "Got some policy ideas.\n", "time": 1606886536.0}, {"subreddit": "democrats", "text": "This statement from a corporation is not surprising, but the fact that these pos machines can be hacked is well known. Article in comments.\n", "time": 1606520552.0}, {"subreddit": "democrats", "text": "Trump is the one who cheated and still lost.\n", "time": 1605780365.0}, {"subreddit": "democrats", "text": "Loser’s attorney before the PA judge folds like a wet napkin. To his knowledge - no fraud, and no undue influence on the elector. - source: Marc Elias\n", "time": 1605117691.0}, {"subreddit": "democrats", "text": "There is no middle ground. There is no compromise. We either fight for what we believe in or compromise it away to worthless gasbags.\n", "time": 1604934353.0}, {"subreddit": "democrats", "text": "Meanwhile... NC ballot counters\n", "time": 1604879259.0}, {"subreddit": "democrats", "text": "Cat vibing to victory speech\n", "time": 1604683042.0}, {"subreddit": "democrats", "text": "Almonds going blue\n", "time": 1604673583.0}, {"subreddit": "democrats", "text": "You can stop checking - Nevada stops counting votes until Thursday morning 9am\n", "time": 1604546585.0}, {"subreddit": "democrats", "text": "When Las Vegas and Reno give you a Win job... where do you put the tip?\n", "time": 1604536365.0}, {"subreddit": "democrats", "text": "There is no way they are counting this right...\n", "time": 1604497636.0}, {"subreddit": "democrats", "text": "Is it too much to hope?\n", "time": 1604454589.0}, {"subreddit": "democrats", "text": "The world has had enough\n", "time": 1604448392.0}, {"subreddit": "democrats", "text": "If you’re voting Nov 3 in person - Make sure you’re in line early.\n", "time": 1604203136.0}, {"subreddit": "democrats", "text": "Drop it off Drop it off Drop it off. Do it now!\n", "time": 1603818001.0}, {"subreddit": "democrats", "text": "Do it NOW\n", "time": 1603817933.0}, {"subreddit": "democrats", "text": "In WA can confirm whether ballot was received. My vote is in!\n", "time": 1603676477.0}, {"subreddit": "democrats", "text": "Unofficial ballot boxes.\n", "time": 1602802767.0}, {"subreddit": "democrats", "text": "Please check your voting status online!\n", "time": 1601491003.0}, {"subreddit": "democrats", "text": "Biden went down to Georgia ...", "time": 1607098100.0}, {"subreddit": "democrats", "text": "Plot twist trump runs 2024 as a Democrat 😂", "time": 1607097765.0}, {"subreddit": "democrats", "text": "Welcome! We have our own brand of insane, but most are just looking for a better way to coexist.", "time": 1606966354.0}, {"subreddit": "democrats", "text": "Repurpose military budget towards internal infrastructure improvements including water quality, and eduction.", "time": 1606886706.0}, {"subreddit": "democrats", "text": "Establish a commission for social analysis - to define who we are as a country and where we are going. This long term planning should then inform policy ideas. \n\nImprove the long term forecasting teams that maintain vision for the country based on this social analysis. deliver metrics to congressional committees for policy making.", "time": 1606886694.0}, {"subreddit": "democrats", "text": "Congressional rules should only be changed by a majority chamber vote with equal proportional representation from each party. For a quorum at least 10% of each party must vote for the change.", "time": 1606886656.0}, {"subreddit": "democrats", "text": "Make agency heads win an election within the agency to get on the nomination list. President can have liasons but should not be fully ‘in charge’ of agencies.", "time": 1606886632.0}, {"subreddit": "democrats", "text": "Make Supreme Court nominations list a matter of public vote. Presidents should not be able to nominate people, just pick from a list established by, bar associations, or House of Representatives, or the public.", "time": 1606886609.0}, {"subreddit": "democrats", "text": "Implement legislative rules that allow a single issue per vote. Effectively make things like the  farm bill illegal.", "time": 1606886574.0}, {"subreddit": "democrats", "text": "Re-work electoral college to more accurately reflect ec votes per capita.", "time": 1606886557.0}, {"subreddit": "democrats", "text": "Show me ONE glitch? Just one!", "time": 1606686402.0}, {"subreddit": "democrats", "text": "With my dying breath I bring to you my worthless opinion.", "time": 1606676186.0}, {"subreddit": "democrats", "text": "Well, it’s unfair to call it “fact-less and baseless” as if they couldn’t be hacked. They quite clearly can be. It would be reasonable to say it’s unlikely and the risk is thought to be mitigated by procedures.\n\nAlso, I can probably fit a memory card and a screwdriver in my dong flap. Are we really gonna argue that one couldn’t access it behind a curtain? Not to say I’d need to, because these machines are regularly left out unsecured before voting starts. I saw a guy in Massachusetts or Michigan I think that goes around and takes pictures of himself with voting machines just hanging out outside a precinct. Also, half of them are connected to the internet despite what the company says.\n\nThese aren’t conspiracies, they are real vulnerabilities that the companies have refused to fix arguing that procedures are sufficient to countermand the exploits. Procedures that are regularly not followed. \n\nIt is my opinion that the voting machine companies are irresponsible and full of shit. They are skirting responsibility to maintain their government funding because admitting vulnerability and fixing it carries risk. It helps that the political climate now is to dismiss these issues for maintaining desired outcome for the vote. It however does not make them go away.\n\nThese machines suck, and they need serious re-work to be used responsibly.", "time": 1606531142.0}, {"subreddit": "democrats", "text": "Agree with the whole dirty sock removal sentiment. Disagree with the need to be physically present for it. We watched this bs remotely, we griped about it remotely, we voted remotely, we can celebrate remotely. I got my bubbly ready.", "time": 1606528958.0}, {"subreddit": "democrats", "text": "There is no reason to build an inauguration podium. Nobody should come - pandemic and all. Make it small private and televised.  I don’t understand why I keep seeing posts about it.", "time": 1606520942.0}, {"subreddit": "democrats", "text": "[defcon govtech.com article](https://www.govtech.com/security/Hackers-Highlight-Vulnerabilities-in-Vote-Scanning-Machines.html)", "time": 1606520595.0}], "republican_score": 0, "democrat_score": 35}