{"name": "full_carry", "posts": [{"subreddit": "democrats", "text": "Of course not. The fed should start opening accounts for everyone with a social security number and send them debit cards. That’s how you serve the people, not the fee machine that is banks", "time": 1607206114.0}, {"subreddit": "democrats", "text": "I highly recommend Charles Sykes book How the right lost its mind. The book touches on a very important, and often unreported phenomenon, voting for the craziest mortherfucker on the ticket. It’s eating the party right now, the crazier and anti-them you are the more likely you’re to win. This actually explains everything that’s going on in red states.", "time": 1607205997.0}, {"subreddit": "democrats", "text": "Because controlling women’s vaginas is the most pressing problem in this country, and gun ownership which is protected by the constitution is going to be illegal, like revoking amendments is that easy. Nut jobs!", "time": 1607205557.0}, {"subreddit": "democrats", "text": "Because he controls 3-4 militias by a tweet? Not to mention that all the nutjobs — important component of the conservative base — is fully on his side", "time": 1607205460.0}, {"subreddit": "democrats", "text": "Assuming there will be a USA.....very wishful thinking.\n\nI am expecting a conversation more like “mom, dad, how was it like when it was the USA before the separation?”", "time": 1606623642.0}, {"subreddit": "democrats", "text": "This is why the electoral college should be repealed. Or be strictly following the popular vote of the state. Because this is how we will end up not having elections, because why the fuck vote when the state legislator or the governor can do what ever the fuck they want", "time": 1606623521.0}, {"subreddit": "democrats", "text": "Well, all the information he have access to is public information. The GOP is a party run by the rich on the shoulders of poor voters, because poor people should vote for less help for them and more help for the rich, because hey the democrats are socialists who will make this country a dump by offering a functioning federal government and affordable education and healthcare. End rant", "time": 1606623298.0}, {"subreddit": "democrats", "text": "Hold your horses. The red wave of 2022 and the white-lash of 2024 will bring people who will make Trump and QAnon sound like Saints.", "time": 1606623164.0}, {"subreddit": "democrats", "text": "Florida is gone for good. Let’s keep the focus on Texas and Arizona", "time": 1606623084.0}, {"subreddit": "democrats", "text": "Classic republican move, reconfigure the government to make easier to handicap it and maybe dismantle it by the next republican president", "time": 1606623033.0}, {"subreddit": "democrats", "text": "Moral of the story, you can spend all the money in the world and people in all ex confederate states will vote for white bigoted candidates — nowadays happens to also be republicans —", "time": 1606500539.0}, {"subreddit": "democrats", "text": "Pack the court. Fuck it.", "time": 1606500371.0}, {"subreddit": "democrats", "text": "He’s loosing his shit now that he got a taste of how he will be treated starting Jan 20th", "time": 1606500223.0}, {"subreddit": "democrats", "text": "What middle class? People who make between $10M-$100M? Because that’s the only middle class these crooks seem to care about", "time": 1606500163.0}, {"subreddit": "democrats", "text": "Did he really? Now that he’s pardoned, he can drop his 5th amendment rights, and start telling stories to the highest bidder. Or write a tell all book. Let that one sink", "time": 1606500098.0}, {"subreddit": "democrats", "text": "On a tank waging war on his own people like a true dictator. What the hell is happening to the republicans and conservatives", "time": 1606500031.0}, {"subreddit": "democrats", "text": "I disagree on that point, no sex worker should be shamed, their body, their choice. annddd that's why I believe all news outlets didn't want to go there, at least liberal one, the moral dilemma is a tough one.", "time": 1606232985.0}, {"subreddit": "democrats", "text": "I will give it to the left leaning media for not digging up her past. They should’ve.", "time": 1606198833.0}, {"subreddit": "democrats", "text": "Omg, MMT says, print money take care of your people, tax the rich and corporations and keep importing things that you can get away with not making at home, because it’s a pretty effective way to control money supply and then if the private sector won’t hire people, the government hires them at a humane minimum wage and put them to work on productive stuff like building highways, updating government software, you get the point. \n\nThat way the government spending — deficit, which is technically the private sectors surplus— stays steady in recessions and expansions while taking care of people and leaving no one behind. You can try to keep fighting over minimum wage all you want. The government can easily enforce it by hiring people at that and then the private sector will have no choice but to eat the bullet", "time": 1606192195.0}, {"subreddit": "democrats", "text": "You assumed I am libertarian. So I assumed you’re a liberal hence you think libertarians are morons and full of shit. Which they are except for their individual liberties and property rights stuff.", "time": 1606191877.0}, {"subreddit": "democrats", "text": "Hahaha. I am literally laughing. These are the most progressive liberal economists out there. And they are right economically. They just happened to be left leaning. Actually MMT has nothing to do with political opinions", "time": 1606191724.0}, {"subreddit": "democrats", "text": "He doesn’t need his donors. “Us vs them” and we know which base loved this attitude with a healthy dose of conspiracy theories.\n\nYour economics are not correct my friend. I highly recommend that you read either Stephanie Kelton’s The Deficit Myth or Randall Wray’s Modern Money Theory. What you’re preaching is as failed as the Friedman doctrine the GOP swears by", "time": 1606191317.0}, {"subreddit": "democrats", "text": "You’re mistaken. The GOP is a poor people party where tortoise comes from. They don’t give a fuck about wall st. And he will still be elected along side the other retards in the 40 GOP dominated states. \n\nI think that what you democrats are failing to understand. Lindsay graham won in face of $120M and a fine tuned political campaign and social movement, by 10 fucking points, why? Because they’re not voting for politics, they’re voting their instincts and religious convictions, NOT THEIR POCKETS.", "time": 1606189282.0}], "republican_score": 0, "democrat_score": 23}