{"name": "centerwingpolitics", "posts": [{"subreddit": "democrats", "text": "Isn’t the issue people being told to leave and the counting continuing without the bipartisan watchers/oversight? Also the rep from the Secretary of State apparently wasn’t there for the first hour either?\n\nI get bashing the right but the foundational issues are still present in this video. I’d suggest no one take an article by any organization and just think it’s 100% correct or factual. There are concerning points about this video from both sides. Let’s not let animosity stop us from holding people accountable to wrong doing.", "time": 1607145876.0}, {"subreddit": "democrats", "text": "Isn’t this the case where the judges made a comment in favor of Trump but it needed to be filed in a lower court first?", "time": 1607145678.0}, {"subreddit": "politics", "text": "That’s terribly sad. We can’t check into if these were legal votes because it’s too late? Shouldn’t we wait to declare a winner until we have said information? That is pretty unsettling whether you’re democrat or republican.", "time": 1607098609.0}, {"subreddit": "politics", "text": "Table and suitcases were brought in at like 8am. \n\nNormal ballot delivery for that day came in through doors and other areas. These are the only ones from under a table or from a suitcase. Therefore causing the questions and concerns.", "time": 1607097548.0}, {"subreddit": "democrats", "text": "I wonder how efficient Amazon would have been in a neutered state during this pandemic when so many needed them", "time": 1606399472.0}, {"subreddit": "politics", "text": "I guess it depends on your source of information.  Some have blamed Pelosi, Trump, McConnell, either way it’s still a crap show up there as a citizen. Party affiliation should t matter in these situations", "time": 1605841972.0}, {"subreddit": "politics", "text": "Lol. Talks have been stalled since the summer and at this point I don’t care who’s in office. It’s entirely irresponsible of both parties to not have worked this out by now. You have millions of people struggling their way through this and we choose now to draw these dumb party lines! It’s utterly disrespectful and disgusting to those of us who pay the taxes to pay their butts. I wish we literally had every seat up for election this November so we could have gotten rid of the whole lot of them", "time": 1605839882.0}, {"subreddit": "democrats", "text": "But.....isn’t there a law about how only those eligible to vote during the normal election are the ones eligible to vote in the runoff!? Maybe I misunderstood an interview on a local station", "time": 1605668848.0}, {"subreddit": "democrats", "text": "Well apparently they’re asking the Governor to reject this recount as they aren’t verifying signatures", "time": 1605590897.0}], "republican_score": 0, "democrat_score": 5}