{"name": "buckeyered80", "posts": [{"subreddit": "politics", "text": "A law passed by Congress in 1887 that if states have vote counts settled and certified for Congress to approve its electors by that date, it can’t be challenged anymore after that.", "time": 1607176783.0}, {"subreddit": "politics", "text": "Why not. Is knowledge ever a bad thing?", "time": 1607134944.0}, {"subreddit": "politics", "text": "We just need to get to Dec. 8. It’s the safe harbor law and it’s next Tuesday. Then Dec. 14 the Electoral College votes. I think it’s sealed after that and Trump can’t pull any rabbits out of his hat.", "time": 1607132993.0}, {"subreddit": "politics", "text": "It’s obvious. Every time the idiot held his rallies, the numbers went up.", "time": 1607132742.0}, {"subreddit": "politics", "text": "Good. Crowds suck.", "time": 1607132701.0}, {"subreddit": "politics", "text": "But now Trump says his recounts are just to find out who voted fraudulently.", "time": 1607132521.0}, {"subreddit": "democrats", "text": "For the Georgia runoffs? I don’t know. I don’t live in Georgia.", "time": 1607132446.0}, {"subreddit": "politics", "text": "Is that all Trump does is blame Democrats? What an idiot. Please get out of office.", "time": 1607132382.0}, {"subreddit": "democrats", "text": "Pray. I know it sounds funny, but many Christians think the Republicans are the party to pray for winning. Not me. A free and merciful democracy is what I think is actually better for religion than a theocracy. So, I pray Ossof and Warnock win.", "time": 1607084916.0}, {"subreddit": "politics", "text": "And it’s working for them. I don’t understand how the hell, but it is.", "time": 1607051170.0}, {"subreddit": "politics", "text": "In a way I’ve wondered if it’s all been scripted and he’s acting the part. But, somehow it’s real.", "time": 1607050920.0}, {"subreddit": "politics", "text": "They said the same crap about Tom Hanks and then he ended up hosting SNL. So, if you can be under secret arrest and also President, that’s an interesting concept.", "time": 1607050609.0}, {"subreddit": "democrats", "text": "My argument is that if for no other reason, let it be for judges. The Republicans got like nearly 200 federal judges and 3 SC judges. The Dems now need to let their remaining judges retire at least. And that is not even expanding, it’s just maintaining.", "time": 1606776331.0}, {"subreddit": "politics", "text": "I am tired of his supporters. It’s like they band together and threaten anyone who defies their leader. They still won’t take their freaking flags down either. I am not sure what can be done for people like that. The blind leading the blind.", "time": 1606770665.0}, {"subreddit": "politics", "text": "The main reason Dems will need the Senate is to    let some of the old dem judges retire. It will allow new ones to get in and replace them. Otherwise we get more of McConnell’s right wing theocrat judges. No thanks.", "time": 1606594806.0}, {"subreddit": "politics", "text": "This is America. We can talk to and about the President how we want.", "time": 1606522047.0}, {"subreddit": "democrats", "text": "Man that table really does look ridiculous.", "time": 1606493482.0}, {"subreddit": "politics", "text": "8 million views because our country is filled with a-holes.", "time": 1606491626.0}, {"subreddit": "politics", "text": "In defense of the Dems, there isn’t much they could do. If they come back hard against the Republicans, they get hammered by the right wing media and the MAGAs. And somehow they end up blaming Nancy Pelosi for it all.", "time": 1606490914.0}, {"subreddit": "politics", "text": "So he plans to overturn 4 swing states by 12/14? He either has something planned or he is bluffing to help his buddy McConnell grab the last two Senate seats.", "time": 1606445679.0}, {"subreddit": "politics", "text": "Good points made here. It always bothered me that I had to defeat someone else to climb up the corporate ladder and make more money. Anyone I defeat also has the same needs as me. This is why I agree it should be regulated somehow or mixed with some form of socialism. Some would argue we have the programs for retirement, social security, disabled benefits, Medicare/Medicaid, etc. We do, but it doesn’t reach enough in my opinion. I think disabled should reach also for people who are mentally disabled...many of whom have ended up homeless or in prison because they don’t have the faculties to make it in our system.", "time": 1606439671.0}, {"subreddit": "politics", "text": "Capitalism to me is survival of the fittest. I do agree that people should be rewarded for hard work. The problem though is that it cannot reward people when they get too old to work and it can’t reward disabled people. It also ends up rewarding cheaters who learned how to legally cheat. It can’t turn itself off like originally said here. How many old or disabled people get left out for not producing well enough?", "time": 1606436938.0}, {"subreddit": "politics", "text": "I know we can talk some sense into some of these. “Do you really want to fight for this fat billionaire who gives two craps about you?”", "time": 1606008382.0}, {"subreddit": "politics", "text": "This is total BS.", "time": 1606008297.0}, {"subreddit": "politics", "text": "This can’t come fast enough.", "time": 1605930770.0}, {"subreddit": "politics", "text": "I know. I am wondering if Biden needs to get a legal team moving.", "time": 1605908184.0}, {"subreddit": "politics", "text": "Now, quickly certify the votes before Trump tries something else.", "time": 1605875879.0}, {"subreddit": "politics", "text": "46!", "time": 1605837157.0}, {"subreddit": "democrats", "text": "Trump or a Sumo wrestler?", "time": 1605660183.0}, {"subreddit": "democrats", "text": "I know. In a normal world it would be impossible. But this reality lately, who knows. The only way they could do it is to invalidate a few states already called by proving there was fraud. It is unlikely they will be able to do so before the states certify their results.", "time": 1605545930.0}, {"subreddit": "democrats", "text": "I hope to God that’s all this is. Because if he and his crazy supporters pull off giving him a second term, our country is finished. This is a big deal.", "time": 1605531056.0}, {"subreddit": "politics", "text": "But it’s ok. Because, it was a Democratic governor.", "time": 1605318565.0}, {"subreddit": "politics", "text": "He won’t . I don’t think any past president will ever go to prison.", "time": 1605318364.0}, {"subreddit": "democrats", "text": "I’ve said it many times, but what the heck, I will say it again. He acts like a whiny, privileged child. The half of America who voted for him wants a man who never matured into a leader. It’s just so crazy that he even got so far.", "time": 1604929576.0}, {"subreddit": "politics", "text": "I imagine Trump supporters with their big flag and a mouth full of food spitting out as they chant “Trump!”", "time": 1604268875.0}, {"subreddit": "politics", "text": "Letting a school yard bully and his friends run the country...that’s what we’ve done.", "time": 1604268748.0}, {"subreddit": "politics", "text": "Oh yeah. For sure anyone with a disability shouldn’t want to vote Republican, let alone Trump. It’s funny because they claim to be the Christian and pro life party, but they actually believe in survival of the fittest. It’s all about getting out there and making your own keep. I agree with that, but I also believe that not everyone is suited for that life. They do not care if people have disabilities. I have seen it with a few family members I grew up with and were made to work and produce as others who are 100 percent able. This is why I prefer the Democrats, they will take care of those who need it. I agree it should not be abused, however.", "time": 1604267309.0}, {"subreddit": "politics", "text": "Come on, Georgia. Let’s do this. I don’t know if I can handle 4 more years of Trump “winning”. I do not want a country where his base runs everything. They don’t deserve that power.", "time": 1604249423.0}, {"subreddit": "politics", "text": "Let’s see Trump hit a three.", "time": 1604249065.0}, {"subreddit": "politics", "text": "I’d love to see it go Blue. But, unfortunately there are a lot of Trump supporters in TX. Our only hope is that there were a lot of silent Biden supporters who showed up.", "time": 1604169526.0}, {"subreddit": "politics", "text": "I couldn’t believe it when I read a few articles about Cuban Americans and Puerto Rican’s support of Trump. Why? It just makes no sense to me.", "time": 1604169416.0}, {"subreddit": "politics", "text": "Wow this is crazy. But, I already sensed Trump supporters becoming violent. I can’t believe what’s happening in our country with what this crazed man has done to people.", "time": 1604169282.0}, {"subreddit": "politics", "text": "Luke, together with Yoda we will use the force and make the ballot counts go for Biden.", "time": 1604018114.0}, {"subreddit": "politics", "text": "I never thought I’d be asking Biden to save me. But Biden and Georgia, lets do it.", "time": 1603853424.0}, {"subreddit": "democrats", "text": "True. But regardless, the end result is that.", "time": 1603801007.0}, {"subreddit": "democrats", "text": "I was really wanting Kamala to bring this up in that debate against Pence. Jaime Harrison called out Lindsey Graham on his hypocrisy on this, at least.", "time": 1603797998.0}, {"subreddit": "democrats", "text": "Not to mention, a third of the Supreme Court was picked by a President who was impeached by the House.", "time": 1603797699.0}, {"subreddit": "politics", "text": "One of my favorite shows of all time.", "time": 1603797100.0}, {"subreddit": "politics", "text": "I live in Texas and there are a WHOLE lot of Trump supporters here. However, the the majority of people are staying neutral and I do not know how they will vote. There are a lot of Democrats in Texas as well, most poor neighborhoods proudly have large Biden/Harris signs. Let’s just hope they all get their chance to vote.", "time": 1603796570.0}, {"subreddit": "politics", "text": "If he wins Florida or Texas, I think he will win the election. But, I just didn’t want to get my hopes up about them in case he doesn’t.", "time": 1603620549.0}, {"subreddit": "politics", "text": "Florida and Texas should both be close, but I think they’ll go red. Biden can still win without them.", "time": 1603589461.0}, {"subreddit": "politics", "text": "And he’s absolutely right. Even the people I work with who like Trump would not tolerate behavior like his in the workplace. That is one of the reasons it baffles me that they like him, but anyway.", "time": 1603577156.0}, {"subreddit": "politics", "text": "Ohio. Go Blue this time, please. We beg of you. For the love of all good :)", "time": 1603575636.0}, {"subreddit": "democrats", "text": "Congrats. Been on this side since 2018.", "time": 1603570193.0}, {"subreddit": "politics", "text": "I always wondered about what he was doing with those rallies. It’s like that’s all he really cared about doing. The fame he got with those people will probably keep millions coming in to his family long after he is out of office.", "time": 1603558250.0}, {"subreddit": "politics", "text": "Anyone from Hollywood would be for Biden. There is no Hollywood under Trump.", "time": 1603509930.0}, {"subreddit": "politics", "text": "Somebody just get this guy out of my face.", "time": 1603509212.0}, {"subreddit": "politics", "text": "Yeah. Yeah. They simply don’t understand that abortion is connected to sex. And sex is connected to human desires. They will never understand.", "time": 1603505165.0}, {"subreddit": "politics", "text": "Maybe he’s actually a resurrected mummy.", "time": 1603452532.0}, {"subreddit": "politics", "text": "Did he get bit by a venomous spider or what? That hand doesn’t look good.", "time": 1603452321.0}, {"subreddit": "politics", "text": "Maybe you can start with no encouraging your followers to not wear masks. Maybe not divide people over mask wearing. Just a thought.", "time": 1603319977.0}, {"subreddit": "politics", "text": "Projection!", "time": 1603319887.0}, {"subreddit": "politics", "text": "I agree here, Tyler. Trump has put us through the reality show of hell.", "time": 1603318667.0}, {"subreddit": "democrats", "text": "Just voted Biden/Harris and Hegar today in TX.", "time": 1603301439.0}, {"subreddit": "politics", "text": "Hmm. I like both. Tombstone is short hair.", "time": 1603298329.0}, {"subreddit": "politics", "text": "Ahh. Loved him in Roadhouse.", "time": 1603285283.0}, {"subreddit": "politics", "text": "Thank you 😊", "time": 1603135794.0}, {"subreddit": "politics", "text": "I seriously got downvoted twice for this comment? Come on, it wasn’t that bad.", "time": 1603114921.0}, {"subreddit": "politics", "text": "Trump is Thanos.", "time": 1603064802.0}, {"subreddit": "democrats", "text": "Nice job. I am similar in that I grew up around conservatives and never realized I was a Democrat until I researched it.", "time": 1602760976.0}, {"subreddit": "politics", "text": "I usually don’t like Goldman Sachs. But, if you are right here, I changed my mind about you.", "time": 1602503491.0}, {"subreddit": "politics", "text": "Of course. Because he is making America into a Taliban. It’s the Judeo-Christian Taliban.", "time": 1602386052.0}], "republican_score": 0, "democrat_score": 14}