{"name": "HikinOut8", "posts": [{"subreddit": "democrats", "text": "Can ex-President Trump be trusted with America's secrets?\n", "time": 1606973171.0}, {"subreddit": "democrats", "text": "Here's a new strategy - Meet the Dominatrix Forcing Trump Supporters to Vote Biden\n", "time": 1603561614.0}, {"subreddit": "democrats", "text": "Secret History of Kimberly Guilfoyle’s Departure from Fox (LOVE me some GOP 'morality')\n", "time": 1601599986.0}, {"subreddit": "democrats", "text": "Presidential debate organizers promise format changes after Tuesday night chaos\n", "time": 1601488308.0}, {"subreddit": "democrats", "text": "Biden's VP pick is a big deal.\n", "time": 1596654524.0}, {"subreddit": "democrats", "text": "Trump's Speech at Mt. Rushmore. What if?\n", "time": 1593660689.0}, {"subreddit": "democrats", "text": "Sit the hell down little one. You do know your little foot stomp had NOTHING to do with any comment in that thread, right? No one used the phrase \"x president.\" Which isn't even a phrase. If you'd been a big boy and read the story, you'd have seen that the headline read, \"When he leaves office.\" So there's the Ex-President component. Got it? So just stop, ok? Go yell at your Mom or something. Thanks.", "time": 1607102579.0}, {"subreddit": "democrats", "text": "Hey tiger? When you call people \"stupid\" it's a really wise move to use proper punctuation when doing so. There's your tip for the day. You're welcome.", "time": 1607101913.0}, {"subreddit": "democrats", "text": "That's actually a pretty valid point.", "time": 1607100546.0}, {"subreddit": "democrats", "text": "Probably right. Things just get hotter and hotter and then...boom. You're on someone's plate.", "time": 1607060550.0}, {"subreddit": "democrats", "text": "I stopped reading at \"ad hominem.\" I'll let you figure out why.", "time": 1607060419.0}, {"subreddit": "democrats", "text": "There's time. And it has to be handled wisely. This is a State election even though there are national implications. That's a fine line. He's wise and waiting to see what Trump does. There's also a pandemic and traveling there right now doesn't send the best message. But I have a question. What are YOU doing right now towards winning in Georgia?", "time": 1607059810.0}, {"subreddit": "democrats", "text": "Question. When you jumped the tracks, and lost control of reality, did it happen all at once or was it a gradual process?", "time": 1607059397.0}, {"subreddit": "democrats", "text": "Right on. Well done. Thanks for sharing.", "time": 1607055026.0}, {"subreddit": "democrats", "text": "Thanks for sharing that and think it's a pretty common situation. It seems there's a tendency for Conservatives to not have the same type of access to things like diversity of thought, culture and a tolerance of those things in the way that many Democrats do. So it becomes an 'us vs. them' thing. Their view of Democrats, that has been nurtured by right wing media, is so twisted and untrue that it ends up hurting the very people Democrats would like to see brought to the table. It really is the party that looks out for the 'regular Americans.' Seems like a lot of Conservatives would prefer to kiss the hand that beats them just so they can have an enemy. Makes no sense. And glad it seems you've turned the page and decided truth was the better call.", "time": 1606945102.0}, {"subreddit": "democrats", "text": "HA! The people who make up the Lincoln Project can bite me. But man...they have it let it fly and I gotta' hand it to them.", "time": 1606853318.0}, {"subreddit": "democrats", "text": "You can lead a horse to water...\n\nI now live in a rural, mountain community where MAGA is alive and well. What wasn't acknowledged here is 40 years of mind fuckery that speaks to white grievance, poor me,' and sheltered existences. It's why they co-opted 'patriotism,' the flag and 'real' American values. Easy to do and very effective. You don't beat that with facts. You beat it by changing their enemy. They NEED enemies. And the reality is that Democrats, by and large, just don't view the world through the same lens. You'd need Democrats to throw out their life view and feed lies, anger and hate. \n\nWhat I'd like to see is a Democrat with some STONES who, in no uncertain terms, lays out the propaganda those folks have been fed, WHY they've been fed it and get them to focus on their real enemy. An enemy that is shared by urban residents struggling to afford an apartment as well as the red hat wearing Bubba swinging a hammer. THE VERY RICH. Those who are pulling the strings and directly impacting the lives of most all of us. Coalesce them around that concept and you've got a winning hand.", "time": 1606853112.0}, {"subreddit": "democrats", "text": "We'll see. I see religion, faux-patriotism and racism as continuing to drive their train. You don't throw out a 40 year old playbook overnight. But this does speak to the total ineffectiveness of the Democrats to reach people with the truth. If they want \"Us vs. Them\" the Democrats have the perfect entry point. THEY should be the ones pushing class warfare. The rich get richer and some of have been convinced to kiss the hand that beats them.", "time": 1606844786.0}], "republican_score": 0, "democrat_score": 18}