{"name": "flambuoy", "posts": [{"subreddit": "democrats", "text": "I think someone just misspelled \"SOUP.\"", "time": 1607111116.0}, {"subreddit": "democrats", "text": "Break up big companies, increase competition for workers, get around RTW laws.", "time": 1606794805.0}, {"subreddit": "democrats", "text": "Gutsy, but in no case were they wrong.", "time": 1606222326.0}, {"subreddit": "democrats", "text": "Damn it you give that back right now mister!", "time": 1605103089.0}, {"subreddit": "democrats", "text": "And it’s all AOC’s fault!", "time": 1605059844.0}, {"subreddit": "democrats", "text": "Is this social media for incels?", "time": 1605038702.0}, {"subreddit": "democrats", "text": "It’s not lost on us Americans either. It’s why we voted the asshole out.", "time": 1604890839.0}, {"subreddit": "democrats", "text": "Now there’s a guy who looks good in a pair of jeans.", "time": 1604789428.0}, {"subreddit": "democrats", "text": "If there’s one thing we’re learning in this result it’s that assuming Latinos will vote for Democrats just because they’re POCs is wrong and kinda racist.", "time": 1604501492.0}, {"subreddit": "democrats", "text": "Y’all need to simmer the fuck down. You know loses out in a civil war? Everyone Democrats care about. The only people who won’t suffer are those rich enough to get away. \n\nWinning elections and returning to the rule of law is the only way forward. These morons deserve prison and rehabilitation, not summary execution. Fuck your revenge fantasies and dehumanizing language. You’re not helping.", "time": 1604248573.0}, {"subreddit": "democrats", "text": "This is such a lazy argument. \n\nNews from the 90s isn’t on dusty microfiche in some archive, you can google to see what the debate was about and what they were responding to. Snap judgment without context is a Republican trait, you can and should do better.", "time": 1604205928.0}], "republican_score": 0, "democrat_score": 11}