{"name": "cmaronchick", "posts": [{"subreddit": "democrats", "text": "What's your sense of Biden's response on oil industry?\n", "time": 1603429772.0}, {"subreddit": "democrats", "text": "Why does every non-devastating poll for Trump feel so terrifying?\n", "time": 1603320898.0}, {"subreddit": "democrats", "text": "What can I do now?\n", "time": 1603069945.0}, {"subreddit": "politics", "text": "I'll give you an upvote. How's that?", "time": 1607195195.0}, {"subreddit": "politics", "text": "Well, yes and no. Bullshitter? Yes. World class? Not so much.", "time": 1607156682.0}, {"subreddit": "politics", "text": "I was kidding my dude. The choice is pretty obvious.", "time": 1607151384.0}, {"subreddit": "politics", "text": "Can you dumb it down a shade for me? I'm having a tough time choosing.", "time": 1607144460.0}, {"subreddit": "democrats", "text": "A lot of people have joked about the Republican protest movement being a story that would be immediately rejected by a TV executive if you wrote it as a comedy, and yet they somehow continue to top themselves.\n\nTV exec: Sorry, this is funny, but it's just too unbelievable.\n\nWriter: what do you mean?\n\nExec: you have, in one month:\n\n* the President asking to stop the counting of votes, meaning he'd lose. \n* crowds changing \"Stop the count\" and \"Count the votes\" at the same time. That is just moronic.\n* the President's lawyers giving a press conference at Four Seasons Total Landscaping next to a crematorium and sex shop. I mean, come on. \n* the President's lawyer's hair dye dropping down the side of his face. What the hell even is that? \n* the President's lawyer audibly farting when addressing a House of legislators. We're aiming for the middle, so let's try to steer clear a base humor here. \n\nExec: I mean, one or two is out there, but five is just too outlandish even for a comedy show.\n\nWriter: OK, I'll go back and take another swing.", "time": 1607105868.0}, {"subreddit": "politics", "text": "The House of Representatives is not a court of law, and they have very limited power in terms of enforcing the rules.\n\nFor example, Attorney General Barr didn't appear in front of Congress as compelled by a congressional subpoena. He didn't show. They couldn't really do anything.\n\nBy contrast, if Barr had been compelled to appear by a criminal court and didn't appear, a judge would have charged him with contempt of court and he'd have a warrant served for his arrest.\n\nYou can blow off Congress; you cannot blow off a court of law.", "time": 1606973377.0}, {"subreddit": "politics", "text": "That's because that was a legit app. Hackers run a tighter ship. /s", "time": 1606510353.0}, {"subreddit": "politics", "text": "What I'm enjoying most is that every court case the fight with zero evidence only solidifies that the election was conducted in a secure fashion.\n\nIt won't make any difference to his followers, but history will note that his campaign provided no evidence over 30 times.", "time": 1606421804.0}, {"subreddit": "politics", "text": "Well alright then. You burst my bubble real nice.", "time": 1606090570.0}, {"subreddit": "politics", "text": "Well, I was speaking loosely and there will be exceptions to every rule, but I feel pretty safe in saying that the vast majority of judges work for many years before being appointed and have high standards for the cases brought to their courtrooms.", "time": 1606089646.0}, {"subreddit": "politics", "text": "I was worried about that, but I am comforted by the fact that when someone works their whole life for a position, in general they treat that with respect. So they may interpret the law with a conservative mindset, but conservative does not mean sloppy or lazy, and they have no patience for either in the courtroom. \n\nTrump inherited his wealth and his name which is why he treats them both like shit.", "time": 1606085946.0}, {"subreddit": "democrats", "text": "> For one, prosecuting a former president would be politically fraught, particularly in a country as divided as this one. The decision on whether to do so at the federal level will fall to the new administration.\n\nWhile my bloodlust runs high and my desire to see Trump burn at the stake is at maximum strength, I agree that it is a politically fraught area.\n\nWhat would truly be a hilarious and entirely predictable self-own by President Trump is to pardon himself. He gets Biden off the hook while doing nothing to insulate himself from the state charges that he is going to face.\n\nOf course, if he chooses to run again in 2024, Biden could drop the ol' indictment hammer on him in January 2024 and that would pretty much be that.", "time": 1605928377.0}, {"subreddit": "politics", "text": "Pfizer #1: Hey, looks like we have conclusive vaccine results. Should we announce so our stock price can skyrocket?\n\nPfizer #2: Nah, let's hold back, screw ourselves while conspiring with our competitors just so we can hurt the reelection of a guy who passed massive tax cuts for our executives.\n\nYep, story checks out.", "time": 1605917649.0}], "republican_score": 0, "democrat_score": 5}