{"name": "roundearthervaxxer", "posts": [{"subreddit": "democrats", "text": "Treason for the Season\n", "time": 1606998188.0}, {"subreddit": "politics", "text": "Analyst on if electors can vote against their state's popular vote\n", "time": 1606055857.0}, {"subreddit": "politics", "text": "Hoyer on Trump election challenges: 'I think this borders on treason'\n", "time": 1605893061.0}, {"subreddit": "politics", "text": "Biden brushes aside Trump attempts to overturn the election, confident his victory will stand\n", "time": 1605892986.0}, {"subreddit": "politics", "text": "Transcript: Post Live Election Daily with former White House counsel Don McGahn, Maryland Governor Larry Hogan and Biden campaign adviser Bob Bauer\n", "time": 1605892910.0}, {"subreddit": "politics", "text": "Post-Election Legal Briefing with Bob Bauer\n", "time": 1605891567.0}, {"subreddit": "politics", "text": "Campaign adviser Bob Bauer provides a post-election legal briefing and why Trump's attempt at stealing the election will fail.\n", "time": 1605891390.0}, {"subreddit": "democrats", "text": "Trump is actively defying democracy and testing the waters for a military coup. How are we supposed to forgive people that support this?\n", "time": 1605378769.0}, {"subreddit": "democrats", "text": "Loser: Donald Trump derided defeat – now he must live with it\n", "time": 1605107368.0}, {"subreddit": "politics", "text": "Fake Trump Time Magazine Cover Displayed at His Golf Courses\n", "time": 1604930128.0}, {"subreddit": "democrats", "text": "Remember this gem? Trump hangs photoshopped Time man of the year cover at golf course.\n", "time": 1604929657.0}, {"subreddit": "democrats", "text": "Vote, we did\n", "time": 1604658387.0}, {"subreddit": "politics", "text": "Supercut Counts Down Trump's '100 Most Tremendous Scandals' In Time For The Election\n", "time": 1604423055.0}, {"subreddit": "politics", "text": "Perspective | A rap sheet for a former president\n", "time": 1604422955.0}, {"subreddit": "politics", "text": "A list of Trump associates and their legal entanglements\n", "time": 1604422907.0}, {"subreddit": "politics", "text": "All the President’s Crimes\n", "time": 1604422836.0}, {"subreddit": "politics", "text": "A Catalog of Trump’s Worst Cruelties, Collusions, Corruptions, and Crimes\n", "time": 1604422786.0}, {"subreddit": "politics", "text": "Eminem Lends ‘Lose Yourself’ to New Joe Biden Campaign Ad\n", "time": 1604377697.0}, {"subreddit": "politics", "text": "All of the Trumpworld Figures Who’ve Been Arrested, Indicted, or Jailed\n", "time": 1604310591.0}, {"subreddit": "politics", "text": "U.S. individualism isn’t rugged, it’s toxic — and it’s killing us\n", "time": 1604309823.0}, {"subreddit": "politics", "text": "GOP planted a time bomb in their 2017 tax cut bill that will actually raise most people’s taxes\n", "time": 1604309656.0}, {"subreddit": "politics", "text": "FBI investigating alleged harassment of Biden campaign bus\n", "time": 1604284032.0}, {"subreddit": "politics", "text": "FBI investigating Biden bus surrounded by pro-Trump cars: report\n", "time": 1604283904.0}, {"subreddit": "politics", "text": "Taiwan just went 200 days without a locally transmitted Covid-19 case. Here's how they did it\n", "time": 1604091283.0}, {"subreddit": "politics", "text": "The congressional candidates who have engaged with the QAnon conspiracy theory\n", "time": 1604091240.0}, {"subreddit": "politics", "text": "Black And Latino Voters Flooded With Disinformation In Election's Final Days\n", "time": 1604064603.0}, {"subreddit": "politics", "text": "Election 2020: Trump and the rise of white supremacist extremism\n", "time": 1604064411.0}, {"subreddit": "politics", "text": "'He's a salesman': why rallies are Trump's last best hope of clinging to presidency\n", "time": 1604064167.0}, {"subreddit": "politics", "text": "The Plot to Kidnap Me\n", "time": 1603856018.0}, {"subreddit": "politics", "text": "Trump’s Fate Rests on Countrypolitan Counties\n", "time": 1603855953.0}, {"subreddit": "politics", "text": "2020: Largest fires in CA and CO ever recorded. Most hurricanes in LA, ever recorded. Arctic sea ice not forming, first time ever recorded. Biden’s comment about oil was aimed at the youth vote.\n", "time": 1603803324.0}, {"subreddit": "politics", "text": "No, we can’t agree to disagree. Trump is morally reprehensible.\n", "time": 1603635920.0}, {"subreddit": "politics", "text": "Federal charges: 'Boogaloo Bois' member fired 13 rounds into 3rd Precinct during Minneapolis riots\n", "time": 1603474314.0}, {"subreddit": "politics", "text": "CNN Poll: Biden wins final presidential debate\n", "time": 1603468146.0}, {"subreddit": "politics", "text": "Lmao", "time": 1607182413.0}, {"subreddit": "democrats", "text": "= traitor", "time": 1607145573.0}, {"subreddit": "democrats", "text": "Pro coup, clearly", "time": 1607145519.0}, {"subreddit": "democrats", "text": "This has to be the worlds longest meme. I want to see this movie now", "time": 1607094925.0}, {"subreddit": "politics", "text": "When he gets dragged out of the Whitehouse, the reality that he was a loser will come crashing down on his supporters. He is carving a fissure in the Republican Party, will face numerous state criminal probes along with his family. \n\nCovid vaccine will work, economy will come roaring back under Biden.\n\nHe will be there reviled and is finished politically.", "time": 1607093910.0}, {"subreddit": "politics", "text": "Damn right shit for brains. Tik Tok mfckr", "time": 1607062848.0}, {"subreddit": "politics", "text": "I dint trust this. Act as though this is disinformation to lull democrats into complacency", "time": 1607010685.0}, {"subreddit": "politics", "text": "Why not talk sensibly to them? Like somehow because millennials are on the scene making people uncomfortable that is some kind of win?\n\nYou alienate people. That’s it.", "time": 1606976404.0}, {"subreddit": "politics", "text": "Delicious", "time": 1606834135.0}, {"subreddit": "democrats", "text": "I don’t think that will work", "time": 1606818752.0}, {"subreddit": "politics", "text": "What a bunch of pussies", "time": 1606792899.0}, {"subreddit": "politics", "text": "[https://en.wikipedia.org/wiki/List\\_of\\_Republicans\\_who\\_opposed\\_the\\_Donald\\_Trump\\_2020\\_presidential\\_campaign](https://en.wikipedia.org/wiki/List_of_Republicans_who_opposed_the_Donald_Trump_2020_presidential_campaign)\n\n[https://www.latimes.com/politics/story/2020-11-01/bidens-secret-weapon-anti-trump-republicans](https://www.latimes.com/politics/story/2020-11-01/bidens-secret-weapon-anti-trump-republicans)\n\n[https://www.cnn.com/2020/09/02/politics/gen-z-conservatives-anti-trump-groups/index.html](https://www.cnn.com/2020/09/02/politics/gen-z-conservatives-anti-trump-groups/index.html)\n\nSome links I read researching your comment. It will be interesting what happens, especially with younger generations.", "time": 1606713571.0}, {"subreddit": "politics", "text": "Everything played its part, the impeachment, the sex scandals, Epstein, the biting ads, former GOP allying against him, all former presidents allying against him, gold star families and how they treated, gassing moms, the bible stunt... Trump's campaign failed by a thousand cuts. I am not 100%, I hope GOP voters finally got fed up. GOP leadership certainly didn't.", "time": 1606713525.0}, {"subreddit": "politics", "text": "He is going to carve a fissure right through the center of the gop. It is delicious.", "time": 1606658593.0}, {"subreddit": "politics", "text": "He can always go back to fiverr and top them off", "time": 1606451660.0}, {"subreddit": "politics", "text": "Your company should be able to be as rich as you want it to be, but your takehome should be capped.", "time": 1606422726.0}, {"subreddit": "politics", "text": "Maximum wage is as important as a minimum wage.", "time": 1606395542.0}, {"subreddit": "politics", "text": "Let’s be honest and call it the Christian Court", "time": 1606391900.0}, {"subreddit": "politics", "text": "It’s almost like someone is blackmailing them...", "time": 1606390831.0}, {"subreddit": "politics", "text": "I have this theory that Trump/Putin has, via Epstein, blackmail material on Ghoulliani, Graham and others. They are next level ass-kissers, ruining their reputations in the process... similar to how Hoover leveraged power.\n\nNot McConnell though, he is an evil backwater moron.", "time": 1606389062.0}, {"subreddit": "democrats", "text": "Her wearing the “I really don’t care do u?” jacket to visit kids at an immigration detention center was the cruelest thing I have ever seen coming out of any Whitehouse.\n\nIt was despicable. What a horrifying person.", "time": 1606231185.0}, {"subreddit": "politics", "text": "Good. That was a firing performance", "time": 1606213472.0}, {"subreddit": "democrats", "text": "He ran out of time on Nov. 3", "time": 1606155816.0}, {"subreddit": "democrats", "text": "12 chan, when you are so batshit crazy, 4 and 8 chan ain't enough.", "time": 1606155565.0}, {"subreddit": "politics", "text": "We need to make some serious changes. The Founding Fathers grossly overestimated the good will and intelligence of the American people.", "time": 1606155529.0}, {"subreddit": "politics", "text": "What is the game plan here. I feel like I am missing something.", "time": 1606154458.0}, {"subreddit": "politics", "text": "Who is she to school Biden on foreigner policy?", "time": 1606130254.0}, {"subreddit": "politics", "text": "There is good possibility that Maga cult will be reviled forever", "time": 1606129363.0}, {"subreddit": "politics", "text": "It begs the question, “is Steve King descendant of the KKK or Nazis?”", "time": 1606129287.0}, {"subreddit": "politics", "text": "He attacked democracy like a rabid badger. His supporters were there for every quarter note.\n\nThere is the racism, slathering criminality on top of criminality, the cruelty, but a pitch attack focused on wresting freedom and choice from all Americans is grounds to revile MAGA supporters forever.", "time": 1606128944.0}, {"subreddit": "politics", "text": "What a terrible person. FFS", "time": 1606103311.0}, {"subreddit": "politics", "text": "Thanks for sharing this. I don't see the Democrats doing the things he suggests. If Trump can find 30+ electors that he can buy off, pressure with blackmail or other means there will be insurmountable pressure and it will likely go to the Supreme Court.\n\nCan Trump resort to flat out buying off electors? He could probably offer them $5-10 million each and is immune from prosecution.", "time": 1606071588.0}, {"subreddit": "politics", "text": "Fucking traitors", "time": 1606033077.0}, {"subreddit": "politics", "text": "Voters everywhere", "time": 1606033046.0}, {"subreddit": "politics", "text": "ever seen? Ever.", "time": 1606013841.0}, {"subreddit": "democrats", "text": "Snowflake needs to cowboy up.", "time": 1606013683.0}, {"subreddit": "democrats", "text": "My niece and nephew calls them the Wile. E. Coyote administration", "time": 1605958920.0}, {"subreddit": "democrats", "text": "What?! Democrats have been fighting tooth and nail for working families for decades. Welfare, health care, minimum wage, pell grants, education, infrastructure, environmental regulation, food safety, the environment. 8 years under Obama saw the most recalcitrant opposition party in modern history. They have killed almost everything.\n\nThis kind of myopic analysis weakens the party and emboldens conservative ideology. ‘Blaming democrats’ is a conservative weapon and brought us the most criminal and greedy administration in this country’s history.\n\nProgressives blaming each other, using our enemies talking points is incredibly toxic. It ruined Hillary. Are you sure you aren’t part of the problem?\n\nWe are seeing the worst wealth inequality in over 100 years, if not ever.\n\nCherry picked? Any idea how many $70k salaries 150 billion buys? 50% of the wealth is in the hands of a handful of people.\n\nIt is all part of the voting record. If you want to run down Democrats, you need to bring receipts.", "time": 1605956943.0}, {"subreddit": "democrats", "text": "Billionaires are obscene", "time": 1605956052.0}, {"subreddit": "politics", "text": "Not to mention sedition, likely treason. All in one package.\n\nThey are traitors.", "time": 1605884831.0}, {"subreddit": "democrats", "text": "Much will fade, but images like this stain this administration forever.", "time": 1605875654.0}, {"subreddit": "politics", "text": "I think they will turn on him. It’s a game/reality show and when he fails on his big talk of stealing the election, reality will come crashing down, 5 stages of grief and people will remember the fly on pence‘ said head, ghouliani melting down attacking democracy and a quarter million Americans dead.", "time": 1605851777.0}, {"subreddit": "politics", "text": "Fuck cult trash. I won't stop resisting until the motherfucker's brand lay in utter ruin.", "time": 1605849956.0}, {"subreddit": "politics", "text": "May be wrong, but I think his brand will be ruined. Loser, disease president, racist, climate denier.\n\nold white ideology will fade and millennials and genz need a planet to live on.", "time": 1605822187.0}, {"subreddit": "democrats", "text": "He is the biggest fucking prick", "time": 1605674470.0}, {"subreddit": "politics", "text": "Do we dare NOT to?", "time": 1605646487.0}, {"subreddit": "politics", "text": "Can you purchase a membership on HSN to this club?", "time": 1605508841.0}, {"subreddit": "politics", "text": "No, he is the working class hero the nation needs. Trump is a toxic swill of battery acid and vomit.", "time": 1605450661.0}, {"subreddit": "politics", "text": "How about how many electoral votes you get is tied to your tax revenue?", "time": 1605450157.0}, {"subreddit": "politics", "text": "Shit for brains was a national security threat from day one.", "time": 1605405007.0}, {"subreddit": "democrats", "text": "Did they bring their anime pillows?", "time": 1605404919.0}, {"subreddit": "democrats", "text": "Honestly? I think he is testing and at the same time doing everything in his power to emotionally abuse liberals, forcing everybody to go into the holiday with avarice and fear. He is expressly replacing as many pentagon officials as he can and threatening not to leave. I think he will do the risk assessment and decide he can’t pull off a takeover and burn everything on the way out. \n\nWhat is more important is that his idiot followers DO believe him. They think this isn’t over.", "time": 1605395826.0}, {"subreddit": "democrats", "text": "Pence just said today that the plan is for Trump administration to govern for the next four years.\n\nNever in our history has a sitting president refused the results of an election. He attacks democracy from every possible angle. He has the police union on his hands and armies of red cult goons on the ready. Maybe the reality is that you are not in deep enough.\n\nRead better books.\n\nI don’t think he will do it and that is not the point.", "time": 1605395563.0}], "republican_score": 0, "democrat_score": 21}