{"name": "Spookyrabbit", "posts": [{"subreddit": "democrats", "text": "This Is The True Meaning Behind The Lingo Used By Corporate Democrats\n", "time": 1578350715.0}, {"subreddit": "politics", "text": "22 GOPers Have Announced Retirement Rather Than Continue Under Trump. America Can't Find Four Who'll Uphold the Constitution\n", "time": 1578070554.0}, {"subreddit": "democrats", "text": "GOPers Deploy Agitators To Democrat Town Halls To Kill Public Support For Impeachment\n", "time": 1570153273.0}, {"subreddit": "politics", "text": "Stop Calling Impeachment A Political Decision\n", "time": 1569273888.0}, {"subreddit": "democrats", "text": "My favorite thing about Rudy is not just his pushing of ludicrously terrible voter fraud affidavits (\"The ballot paper was too white\", & \"The PA system was too loud\", amongst many others) but also because he wants Trump to pay him $20,000 per day.  \n  \nIt also brings a smile to my face to realize he's so far gone he actually believes Trump will pay his any of invoices for 'legal' services rendered, $20k/day notwithstanding.  \n  \nThe number one reason Trump could find no credible law firms to represent him in his impeachment was he was going from top firm to top firm, offering the best lawyers in America the opportunity to represent him in his impeachment for free.", "time": 1607017447.0}, {"subreddit": "democrats", "text": "No, I said my sources were hundreds of different articles & sources, which is why I can't give you just one.  \n  \nBut here's the thing. I dgaf whether you believe me or not. I'm not your mother or research assistant. There's no spoonfeeding inbound. I gave you a starting point. The rest is up to you.    \n\nYou want to be ignorant, which apparently you do b/c you're carrying on like a pork chop about something which isn't there?  \nTis no skin off my back.  \n  \nNow go forth and multiply, friend.", "time": 1606790200.0}, {"subreddit": "democrats", "text": "ffs. I gave you one. Is Bing broken where you are?", "time": 1606785727.0}, {"subreddit": "democrats", "text": "Literally hundreds of different articles & sources. It's really only been the last couple of years where the full extent of his ineptness have become known. Prior to partial tax returns becoming available, for example, people still thought his resorts were profitable.  \n  \nThe NYT series on how Fred quietly propped up Trump & transferred $450million to his kids with minimal taxes via fraud & self-dealing is a good starting point.  \nThey've also got good articles on how Trump blew the lot on bad business decisions (always bought high, sold low).  \nEverything else is just many hours of reading.  \n  \nI couldn't keep a list of sources for people like yourself, even if I wanted to. There are so many different sources of information & I use too many different devices. I'd spend half my days just compiling lists.", "time": 1606776965.0}, {"subreddit": "democrats", "text": "That too, converted into USD by Deutsche on the way in & to be converted back by Deutsche on the way out.", "time": 1606776013.0}, {"subreddit": "democrats", "text": "You are very wrong here. All his assets are leveraged & losing money. The money those assets are losing is 100% borrowed from Russian oligarchs. \nIf Trump liquidated all his assets today he would still be in debt. The >$400million in loans that come due in the next 2-3 years were provided only after Trump personally guaranteed them - i.e no filing for bankruptcy to escape the debt. Trump doesn't have the money to cover the personal guarantee.  \n  \nHis net worth has never been over $1 billion. The consensus estimate is $200-300 million max. His total assets have never been worth a billion. Trump himself has said the majority of his net worth is the Trump brand, and he decides what that brand is worth depending on how he's feeling at the time.   \n    \nWhat Trump does have is rubes. Millions & millions of rubes.  \nTrump doesn't want the election overturned. He just needs to say he does so the rubes will keep donating amounts of <$8k (anything under $8k is split 60/40 with the RNC. Over $8k & it goes to 'fight voter fraud').  \n   \nOnce he's conceded the election he will, in all probability, keep doing rallies & coming up with new ways to con MWAGAs into giving him their money.\n\nIn the interests of saving democracy, which Trump will continue to threaten so long as he owes money to the Russians, Bezos should buy out all Trump's debts & promise not to foreclose so long as Trump goes away & shits himself in obscurity.", "time": 1606770912.0}, {"subreddit": "politics", "text": "tl;dr - 'Religious freedom' is as laughable as 'All men are created equal'.  \n  \nThis is complete horseshit. The pilgrims fled Europe after they fled England. What they were fleeing from was govt after govt telling them, \"Fuck no, you can't go around oppressing everyone.\"  \nThe pilgrims left England to oppress people in Europe. When the Europeans also eventually told them to fuck off, they left Europe to find a new country where they could oppress people to their theocratic hearts' content.  \n  \nIt is true that America was specifically founded as a secular republic. One where anyone could practice any religion & the govt couldn't do shit about it. However, having the most money & most socially-acceptable holy book, christian sects have spent centuries trying to undermine America's secularity & have christianity installed as the govt's preferred operating system.", "time": 1606459481.0}, {"subreddit": "politics", "text": "Obama did try to do something about the DAP, at least. Plus he tried to protect as much land as he could without any congressional support whatsoever.  \n  \nDemocrat voters really fucked Obama's whole presidency.", "time": 1606458195.0}, {"subreddit": "politics", "text": "If they were the legal name & not an alias like Diddy. He couldn't force Twitter to give him the name & the guy who had it turned down $30k to hand it over. Apparently he just wanted to piss Diddy off.", "time": 1605951393.0}, {"subreddit": "politics", "text": "Someone doesn't know their history of the Republican Party. The original Republican party members share approximately zero of its values with the present day Republican Party members.  \n  \nThis is why people talk in terms of conservatives & progressives. If there had been no Realignment in the late-20s/early-30s & no Southern Strategy, we could talk in terms of parties.  \nIf...", "time": 1605929799.0}, {"subreddit": "politics", "text": "Well no, it isn't & that's where I'm going to leave this delightful conversation. I have something less painful to attend to; stapling my fingers together.", "time": 1605738065.0}, {"subreddit": "politics", "text": "Unfortunately I've never really bothered to keep a list of the things I read. All I can suggest is read everything you can find & perhaps keep a list just in case someone asks :)", "time": 1605737225.0}, {"subreddit": "politics", "text": "> People want to label progress titles on Lincoln because they want/need him to be on their side.\n  \nNo, people label Lincoln a progressive b/c he was a progressive & not a conservative. Not the most progressive but also not a conservative masquerading as a progressive - e.g Joe fucking Lieberman.  \nConservatives dishonestly claim Lincoln simply b/c he was a Republican & they desperately need something good they can claim as their own, or ignorantly b/c they skipped too many history classes.\n    \nLarge govt & mass taxes are conservative talking point euphemisms, so they can misrepresent their goal of no govt programs or services as low-taxing small govt. Large govt isn't the goal of progressive policy. It's a by-product of govt doing what govt is supposed to do.  \nIn any case & despite their protestations, conservatives love big govt, so long as it's catering to conservative interests like subsidies, tax breaks & bail-outs for corporations & private interests.", "time": 1605737175.0}, {"subreddit": "politics", "text": "Here's what's being discussed:  \n   \n* Trump wants to put his cranks on the board of the Fed  \n* Said cranks want to fix the price of gold artificially low so they can transfer their portfolios to gold  \n* then they want to artificially fix the price of gold high to increase the value of their holdings.  \n* it's insane, which is why no one wants them on the board.  \n* keeping the cranks off the board & their reason for wanting to be on it is the topic of discussion  \n* how the price of gold & investing works is not the topic of discussion  \n* nor is anyone else who may have fixed, or wanted to fix, the price of gold.", "time": 1605735348.0}, {"subreddit": "politics", "text": "> which I dont overall think is a bad system if the leader of the executive branch is like a functional adult with interest in governing.\n\nIt's not a bad system under those conditions except for the fact it's inherently insecure & open to corruption. It's like saying the Titanic is a fine ship so long as it doesn't collide with an iceberg. It wasn't supposed to be sinkable right up until it was.", "time": 1605731099.0}, {"subreddit": "politics", "text": "My theory, even though it's exactly what these cranks have put forward as their goal, has no empirical basis because I didn't cover all the possible historical *but whatabouts* to your satisfaction?  \n  \nNext time you want to argue a point, at least try to make it about the same subject as whatever you're responding to.", "time": 1605730871.0}, {"subreddit": "politics", "text": "Since when did people stop reading complete sentences?  \nDid you get halfway through and decide you had enough to go on?  \n  \nThe full sentence:  \n> \"Conservatives losing to progress is a tale as old as time itself, as is future conservatives tying themselves up in fact-free knots trying to deny the L.\"  \n  \nLet's look at the first part, which you seem to be replying to half of:  \n  \n> \"Conservatives losing to progress is a tale as old as time itself\"  \n  \nDoes it say conservatives are losers? No  \nDoes it say they're not big and strong and tough and don't cry to mommy every time something doesn't go their way? No  \n  \nIt quite clearly says \"...losing to progress...\", which conservatives do... a lot.  \nIn fact, while conservatives win a lot of battles to make tomorrow last year, in the end they always lose to progress. It is how society advances - or progresses - after all.", "time": 1605730468.0}, {"subreddit": "politics", "text": "That's why most govt functions need to be managed by independent, non-partisan agencies. Too much stuff is partisan, dependent on partisan appointments or partisan elections.  \n  \nMost of the people Trump fired should be in statutory roles for a fixed period & un-fireable except for corruption & other criminal behavior. The idea that a president is not above the law falls down at the first hurdle, 'Can the president fire anyone who investigates them?'.  \n  \nIf the FEC, along with the other alphabet agencies were by statutory appointment, a significant quantity of govt corruption ends but - more importantly - agencies become trustworthy & less able to be corrupted or even influenced.  \nAll this crap about voter fraud would be non-existent & Trump would be out on his considerable ass with a minimum of fuss.", "time": 1605700215.0}, {"subreddit": "politics", "text": "That would be b/c Republicans were the good guys right up to the late-20s/early-30s, at which point the Democrats were split between northern progressives & southern racists...I mean, conservatives. Black people started bailing on the Republican party in favor of Democrats as the racists made their way to the Republican party.  \n  \nA lot of people think the switch happened in the 60s with the Southern Strategy. In fact it took place during the Realignment of the 1930s. The Southern Strategy was about conservatives openly campaigning as racists - or perhaps returning to open racism, & the end of the Southern Democrats (the Dixiecrats, conservative throwbacks).  \nIt wasn't an instant change but by the start of the Southern Strategy the Republicans were very much conservative & no longer the good guys. That mantle shifted to Democrats.  \n  \nIf you want more evidence of conservatives never being the good guys, in addition to going to war to keep slaves, it's been the mission of conservatives to undo everything that was achieved by the New Deal... y'know, that thing that saved America when conservative monetary policy - i.e obsession with the stock market - turned the whole country into a trash yard & pawnbrokers.", "time": 1605699088.0}, {"subreddit": "politics", "text": "I wish he was still in jail. Was recently introduced to one of the South's pre-eminent Civil War historians (so good I can't recall his name otmh). One of his introductions by talking about a big secret no one knows about which will change everything you know about the Civil War (hint: Republicans were progressives & Democrats were conservatives)  \n  \n[Here's one I prepared earlier](https://pbs.twimg.com/media/EllgXYhU0AElbwA?format=jpg&name=900x900)", "time": 1605697129.0}, {"subreddit": "politics", "text": "How many times did you have to repeat kindergarten and was it weird being the only 14yr old in first grade?", "time": 1605686402.0}, {"subreddit": "politics", "text": "I guess he thought he could slip it past the mods now that home-made fake incest porn is a marketable genre.", "time": 1605686174.0}, {"subreddit": "politics", "text": "You learning history may not have happened but the Democrats of the 1800s were conservatives who got their asses well & truly kicked by Lincoln's progressives.   \n  \nConservatives losing to progress is a tale as old as time itself, as is future conservatives tying themselves up in fact-free knots trying to deny the L.", "time": 1605685515.0}, {"subreddit": "politics", "text": "They don't care if red states all become vast wastelands populated by people trading bottle caps for white slaves b/c they're both worth more than Confederate Bucks.  \nSo long as their personal wealth is protected & tied to gold at a price set by the Fed, people in red states could be suffering cellular melting due to climate change & they still won't pass anything which might give Biden a win.", "time": 1605684862.0}, {"subreddit": "politics", "text": "They could care less about all of that. The Big Govt is just their talking point. The one & only thing they care about is having the govt set the price of gold for institutions & private gold buyers alike.  \n  \nIn short, they want to be able to transfer their private wealth into gold & not have it be subject to free market price fluctuations, thereby setting the value of their portfolios in stone & fuck whatever else the economy or gold price might do.", "time": 1605684420.0}, {"subreddit": "politics", "text": "Well, no. They haven't fallen at all. Lincoln was not a conservative. Conservatives were Democrats in the time of Lincoln. They may be Republicans now, but they have always been conservatives & they've always been about Me Above Country.  \n  \nIf anyone's fallen anywhere, it's progressives. The current 'progressive' party isn't anywhere near prepared to do what Lincoln's progressives were prepared to do.", "time": 1605684104.0}, {"subreddit": "politics", "text": "Usually when legislators draft 'Don't Do This' or 'You Must Do This' laws they include a penalty range & an enforcement mechanism.  \nCongress has managed to write so many laws so inexpertly they may as well say, 'Don't do this, or nothing will happen'.", "time": 1605226730.0}], "republican_score": 0, "democrat_score": 8}