{"name": "HowAboutThisOneSir", "posts": [{"subreddit": "politics", "text": "Gov. Reynolds to announce 'new steps to fight the virus' in statewide address\n", "time": 1605555172.0}, {"subreddit": "democrats", "text": "I had a lady come up to me and snap my mask off my face telling me I didn’t need to be wearing one while bartending, and that was in June :-) Thankfully I am now living in a very blue city who cares and follows the guidelines from the beginning. It’s a nice change of pace", "time": 1607014003.0}, {"subreddit": "democrats", "text": "It’s so heartbreaking to read because it stresses me out how Iowa is handling this. I was working at a bar for the first ~six months in iowa and the amount of people who just literally talked shit about corona and didn’t believe in it was insane. My mom lives in a very very very red small town where all the old people would all congregate and drink coffee together, until two people ended up in the hospital. One was in the hospital for three months before he died and the other one is still in there. There’s a bar in the small town who consistently was getting fines for breaking covid regulations and nothing would change. I walked around a grocery store for less than 10 minutes and counted 50 people not wearing a mask. Iowa is fucking crazy. I love Iowa so much but shit like this makes me remember why I got out.", "time": 1607008307.0}, {"subreddit": "politics", "text": "I’m sorry but if daddy can’t buy you college or can’t buy you a top position in your dream company, you’re just never gonna amount to anything", "time": 1606930190.0}, {"subreddit": "democrats", "text": "fucking iowa", "time": 1606106409.0}, {"subreddit": "politics", "text": "Is Iowa finally getting a mask mandate?", "time": 1605555185.0}, {"subreddit": "politics", "text": "Good. Make Trump Lose Again!!!!", "time": 1604951023.0}, {"subreddit": "politics", "text": "Well we didn’t want to make it look obvious duh \n\n(this is an actual trumpie reply i’ve heard back)", "time": 1604858055.0}, {"subreddit": "politics", "text": "OMG I JUST CACKLED SO HARD", "time": 1604682037.0}, {"subreddit": "politics", "text": "snowflakes", "time": 1604674891.0}, {"subreddit": "politics", "text": "only acceptable answer", "time": 1604674611.0}, {"subreddit": "democrats", "text": "I just don’t get why someone who put party over country is asking democrats what he should tell his parents why he voted for trump", "time": 1604641099.0}, {"subreddit": "democrats", "text": "What’s the point of this", "time": 1604640639.0}, {"subreddit": "politics", "text": "i love them together", "time": 1604600418.0}, {"subreddit": "politics", "text": "Agree.", "time": 1604473697.0}, {"subreddit": "politics", "text": "you need to have faith /:", "time": 1604469785.0}], "republican_score": 0, "democrat_score": 5}