{"name": "shirtofsleep", "posts": [{"subreddit": "democrats", "text": "So true.", "time": 1607135389.0}, {"subreddit": "democrats", "text": "The map is wrong. It shows no counties for Biden in Vermont, yet Biden won 13 of the 14 counties here.   Far less than 1/6 of the US counties are colored in. \n\nBiden won at least 477 counties, representing more people and more than 70% GDP. \nTrump won 2497 counties, representing less people and less than 30% GDP \n\nhttps://www.brookings.edu/blog/the-avenue/2020/11/09/biden-voting-counties-equal-70-of-americas-economy-what-does-this-mean-for-the-nations-political-economic-divide/", "time": 1606436202.0}, {"subreddit": "democrats", "text": "Edit: more accurate and shorter answer. \n\n\nhttps://mvic.sos.state.mi.us/RegisterVoter?Length=0 \n Scroll down to bottom third of page, for When you are already registered but need to change your address. \n\nYou have 2 good options. \n\n1. Go to your new city or township clerk’s office before 8pm Election Day. There you can update your address (bring all documentation) by re-registering to vote. You can then vote there. \n\nOR, better:\n\n2. Vote at your old voting location one more time. (It’s on the official link above as an option. And, since you don’t have 30-days of residency at your new address, this may be best)\n\nThe site also says you can request absentee ballot from old location, but Election is tomorrow, so absentee is not a good option.", "time": 1604360909.0}, {"subreddit": "democrats", "text": "What state are you in?", "time": 1604356681.0}, {"subreddit": "democrats", "text": "Ah, I only saw the top picture. Thank you!", "time": 1604249172.0}, {"subreddit": "democrats", "text": "So, where’s the more context for us?", "time": 1604183512.0}, {"subreddit": "democrats", "text": "No where does the article say the word was borrowed from Russian or Ukrainian. “Boffo” was made up by Variety magazine.  Decades ago. It’s Boomer slang. \n\nhttps://variety.com/2020/politics/news/boffo-donald-trump-bob-hope-tweet-1234809757/", "time": 1603163599.0}, {"subreddit": "democrats", "text": "Or directly from the Kentucky Secretary of State: \n\nhttps://www.sos.ky.gov/elections/Pages/Polling-Locations.aspx\n\nhttps://www.vote411.org by the League of Women Voters will show you who’s on your ballot with some info about them, and answers to common question like where you can vote and how early and mail-in voting works in your state.\n\nYou will need show proper photo ID when you vote in Kentucky, but if Covid-19 closures or illness prevented you from getting ID you can declare that as an excuse and still vote.", "time": 1603061784.0}, {"subreddit": "democrats", "text": "I look for who’s the most sane and honest and least corrupt. I look at who endorsed them. I look at their answers on https://www.vote411.org", "time": 1603061487.0}], "republican_score": 0, "democrat_score": 9}