{"name": "logicalpragmatic", "posts": [{"subreddit": "democrats", "text": "There are just too many agencies, too many distinct organizations....for every one there is a stovepipe. Also, there is the individualism permeating these agencies...I have heard countless gov folks saying that \"information is power\"...they deliberately do not share information for fear of losing relevance and status.\nThere are solutions to this, but unlikely to happen for not being politically palatable.", "time": 1607080230.0}, {"subreddit": "democrats", "text": "Just another rat leaving a sinking ship!", "time": 1606827478.0}, {"subreddit": "democrats", "text": "True...the whole idea of \"pre-existong conditions\" is another construct of our f'ed up healthcare system. It is the worst structure in the world...others may not have money, but structurally, ours is the worst.", "time": 1605927125.0}, {"subreddit": "democrats", "text": "Trump need to be spanked like a child, he needs to be treated like a chil in public. And worse, what he is doing is treasonous now that he lost and is trying to adopt a scorched earth policy. Serious, having almost 1/2 of the electorate just highlights how close to the dark ages we still are, how fragile is our society.", "time": 1605669124.0}, {"subreddit": "democrats", "text": "Locking Trump up after all, proving he is a crook, would the the best remedy to all his supporters, even though it is little when campared to the damage he did by himself. He should be used as an example to future politicians.", "time": 1605532107.0}, {"subreddit": "democrats", "text": "hahaha, he must live in ALABAMA!\nDumbass.", "time": 1604837275.0}, {"subreddit": "democrats", "text": "Scumbag of first order, not worth a spit.", "time": 1604786967.0}, {"subreddit": "democrats", "text": "You do get a point! \nBut of those 30, the great mojority are still scum.", "time": 1601604793.0}, {"subreddit": "democrats", "text": "30 senators of the worst kind of human beings you could find out there!", "time": 1601603127.0}, {"subreddit": "democrats", "text": "The mofo is not only a national problem, but also the personification of a symptom of our \"tax desease\".", "time": 1601399569.0}, {"subreddit": "democrats", "text": "No way, this crap is toxic! You breath in the fumes...there goes your brains!", "time": 1597891557.0}, {"subreddit": "democrats", "text": "He does that to draw the fire from Ivanka. He thinks he is impervious and nothing can touch him.\n\nJust this, should be enough to have him sleeping in jail for a month after he leaves office.\n\nMuller, please keep tabs on this bastard! He needs to be used as example so we can avoid someone even worse in the future!", "time": 1594871040.0}, {"subreddit": "democrats", "text": "Lock her up!", "time": 1594869327.0}, {"subreddit": "democrats", "text": "Because he is secure, he is a public servant with 40 years of service. Trump can't touch him, only sideline him.", "time": 1594696158.0}, {"subreddit": "democrats", "text": "wait .... If we do not set an example with Trump and prosecute him, his family and his gang, we will pave the way for someone worse next time. I am hoping once he is boooted out of the oval office Trump and his gang spend the rest of their days in court, die poor and in jail.", "time": 1594561705.0}, {"subreddit": "democrats", "text": "wait .... If we do not set an example with Trump and prosecute him, his family and his gang, we will pave the way for someone worse next time. I am hoping once he is boooted out of the oval office Trump and his gang spend the rest of their days in court, die poor and in jail.", "time": 1594561668.0}, {"subreddit": "democrats", "text": "wait .... If we do not set an example with Trump and prosecute him, his family and his gang, we will pave the way for someone worse next time. I am hoping once he is boooted out of the oval office Trump and his gang spend the rest of their days in court, die poor and in jail.", "time": 1594561639.0}], "republican_score": 0, "democrat_score": 17}