{"name": "ScaperMan7", "posts": [{"subreddit": "democrats", "text": "Enjoy... unfortunately there are quite a few holdouts in my area still.", "time": 1607106048.0}, {"subreddit": "politics", "text": "Nice to see he'll finally be back working in a situation where people appreciate science...", "time": 1607090648.0}, {"subreddit": "politics", "text": "There's an awful lot of lashing out going on, isn't there?  Somebody needs a nappie...", "time": 1606753861.0}, {"subreddit": "politics", "text": "Nero fiddling while Rome burns...", "time": 1606131406.0}, {"subreddit": "democrats", "text": "He finally grew a pair?", "time": 1606085371.0}, {"subreddit": "democrats", "text": "I miss Frank, both as a musician and social commentator.\n\nRemember him doing an hour long jam of Whipping Post in a little bar in Poughkeepsie way back when...", "time": 1605890806.0}, {"subreddit": "politics", "text": "Since noone is stopping them, they are creating a blueprint for the next smarter tRuMp clone, who will get it done in the name of the GOP.", "time": 1605886706.0}, {"subreddit": "politics", "text": "My emotional state has been fragile for the last 4 years with this ratfucker in office.", "time": 1605189697.0}, {"subreddit": "democrats", "text": "Barack is such a class act; I am proud to have voted for him. \n\nTo all the vets are there please accept my thanks for your service🙏.", "time": 1605117132.0}, {"subreddit": "politics", "text": "Hey, a $100 is a hundred bucks, amIright?\n\n/s", "time": 1605107073.0}, {"subreddit": "politics", "text": "I had a meditation teacher once who said everyone we interact with are our \"teachers\", whether it is good or bad.  He was so right; actually he taught me how much of a douche he was as his following grew and his ego swelled.\n\nDuring the last 4 years of hell I have learned a lot about myself, seeing the negative things I have done reflected in the news and people.", "time": 1605103869.0}, {"subreddit": "politics", "text": "Ordered one on Etsy!", "time": 1604948716.0}, {"subreddit": "politics", "text": "For his new organization and 2024 run, and the donations to...", "time": 1604948516.0}, {"subreddit": "democrats", "text": "I'm in!", "time": 1604604441.0}, {"subreddit": "politics", "text": "Billy was so on fire in that online event for the dems!", "time": 1604598355.0}, {"subreddit": "democrats", "text": "Thank you for your service and standing up for what is right.", "time": 1604594850.0}, {"subreddit": "democrats", "text": "Thank you for voting BLUE!", "time": 1604589794.0}, {"subreddit": "democrats", "text": "That's what has me scratching my head; what is the argument for Trump with the economy?\n\nIs it because average people (that aren't in the stock market) see that 'the markets are high\" and think that is the true indicator of a thriving economy? \n\nSomeone please enlighten me.", "time": 1604587644.0}], "republican_score": 0, "democrat_score": 8}