{"name": "frikandelpatatje", "posts": [{"subreddit": "democrats", "text": "Don't get the joke, can someone explain?", "time": 1607117482.0}, {"subreddit": "democrats", "text": "What is dumb about third party? I didn't like Biden or Trump so didn't want to vote for either", "time": 1605430734.0}, {"subreddit": "democrats", "text": "As a 3rd party voter, why not just let him take it to court? He will probably be proven wrong anyway so shouldn't you guys want him to take it to court?", "time": 1605399372.0}, {"subreddit": "democrats", "text": "I personaly like the electoral college but that is just my opinion. It would be a good idea tho to do 18+ citizens +2 votes instead of just population +2 votes.", "time": 1604785971.0}, {"subreddit": "politics", "text": "Let's start yelling Trump/Biden 2021 now it's taking so fucking long (looking at you Nevada and Alaska)", "time": 1604706156.0}, {"subreddit": "politics", "text": "CNN is heavy democrat tho and they aren't calling either. And they are extra carefull now because they miscalled Arizona", "time": 1604706030.0}, {"subreddit": "democrats", "text": "I love how New York just goes kaboom", "time": 1604653629.0}, {"subreddit": "democrats", "text": "I know, I said that I don't think there is any fraud, I am just saying that, after watching those clips, I can understand that they think there is fraud going on. If you look a bit deeper into it, you'll see that there is probably no fraud, but if you don't do your research and only see the clips, I can understand that some republicans might think there is fraud.", "time": 1604646574.0}, {"subreddit": "democrats", "text": "As someone who didn't vote (on purpose because I didn't like Biden  or Trump personally), half brown, and follows (almost) all sides of the news and subreddits. I gotta say it looked a bit sketchy when the observers were removed, and the windows were blocked. I don't say that there is any fraud, I don't think there is any fraud, I just wanna say that I get where they are coming from, looking at those clips. But Biden will probably win anyway so it doesn't matter that much.", "time": 1604610701.0}], "republican_score": 0, "democrat_score": 7}