{"name": "SaltResearcher4", "posts": [{"subreddit": "democrats", "text": "Can we please stop looking at pre-Trump Republicans with rose tinted glasses?\n", "time": 1595395932.0}, {"subreddit": "democrats", "text": "I don't think Newsom browses here.", "time": 1607046648.0}, {"subreddit": "democrats", "text": "It's the poorest county in the US, I'm pretty sure. It was also the most Democratic in 2012. I've heard stories of how the reservation is from people who have gone there and... yeah. This country's treatment of natives is shameful.", "time": 1607032002.0}, {"subreddit": "democrats", "text": "Sorry about Mississippi - was an Espy fan from afar.", "time": 1607031791.0}, {"subreddit": "democrats", "text": "It's so stupid. I say merry Christmas to people who celebrate Christmas. I say happy holidays to people who don't. I doubt anyone cares.", "time": 1607031549.0}, {"subreddit": "democrats", "text": "Yep, being a poll worker in Michigan was quite fun.", "time": 1607031471.0}, {"subreddit": "democrats", "text": "Because there's nothing to compete with!\n\nIf the government gives people free access to all the public roads, then I'd be \"banned\" from selling access to those roads - since I'd be scamming people. If I want to sell access to a toll road, that's fine.", "time": 1606944295.0}, {"subreddit": "democrats", "text": "You're making the same fallacy of people who voted for Trump because of \"defund the police\".", "time": 1606942206.0}, {"subreddit": "democrats", "text": "Your point on 3 is misleading. It's not that healthcare is banned - just that it'd be a scam to sell someone something they already get for free. If your job wants to provide *anything* that m4a *doesn't* cover, that's fair game.", "time": 1606942096.0}, {"subreddit": "democrats", "text": "To be fair someone would have to be pretty stupid to fall for that. But several people are pretty stupid.", "time": 1606941989.0}, {"subreddit": "democrats", "text": "Can we *please* not attack Bernie supporters? It's a bit frustrating, as one who supported Biden when Bernie dropped out - as most of us did.", "time": 1606941930.0}, {"subreddit": "democrats", "text": "There are people who are actually like that, yes.", "time": 1606847499.0}, {"subreddit": "democrats", "text": "To be fair, Obama used to run an auto-follow-back script. He follows some interesting people, like The Pirate Bay.", "time": 1606486945.0}, {"subreddit": "democrats", "text": "\"can't spell Brindisi without 'bs'\" is apparently a strong ad.", "time": 1606417567.0}, {"subreddit": "politics", "text": "This is *Vermont*, one of the most liberal states. This governor is a moderate Democrat in terms of policy.", "time": 1606331726.0}, {"subreddit": "politics", "text": ">we could see in the primaries that the registered Cuban democrates and other Hispanics in South-Florida were already rejecting Bernie en masse\n\nNo, the primaries were already pretty much over at that point. You can't draw data from late in the primaries and compare it to earlier. It's nonsensical.\n\n> he would've lost Florida in the biggest landslide ever\n\nHAH. Biden lost by \\~3 more points than Clinton did. I do not see any evidence to show Sanders would've had a similar loss.\n\n>Insisting that you are a socialist is not a defense against the attack that you are a socialist. You do realise that, no?\n\nThe point is showing that the policies are actually what matter. Universal healthcare isn't what's wrong with Cuba. Sanders was and still is much better at communicating what his policies are with voters than Biden. Sanders is also a much more active campaigner, and would've done more outreach to the Cuban community than Biden did.", "time": 1606327303.0}, {"subreddit": "politics", "text": "A Republican that voted for Biden.", "time": 1606326336.0}, {"subreddit": "politics", "text": "Sure, but the election to replace Harris will probably have Republicans fail to pass the primary.", "time": 1606326247.0}, {"subreddit": "politics", "text": "To be fair, Vermont politics are weird. It used to be the most consistently and strongly Republican state, now it's one of the most consistently and strongest Democratic states, yet it re-elects a Republican governor in a landslide every two years while having a socialist as a senator.", "time": 1606326192.0}, {"subreddit": "politics", "text": "So? That's politics.", "time": 1606326068.0}, {"subreddit": "politics", "text": ">AOC completely lacks any of Bernie's wider appeal, though. Her approval ratings are underwater in New York, let alone the rest of the country.\n\nYou don't think that could change?\n\nAOC will run for the next open senate seat in New York and probably use that to build her widespread appeal.", "time": 1606325982.0}, {"subreddit": "politics", "text": "There is a *huge* downside to him - he'd lose in 2022.", "time": 1606325803.0}, {"subreddit": "politics", "text": "Scott has criticized Trump and Trumpian Republicanism repeatedly. He's running in a very liberal state. He appoints a Republican and his career is dead.", "time": 1606325775.0}, {"subreddit": "politics", "text": ">Biden slaughtered Bernie among dems in Florida, and then even more specifically also slaughtered him in the Miami-Dade area that we are discussing right now, that then afterwards also said they disliked Bernie Sanders as he was a (selfproclaimed) socialist.\n\nThe primary was not a general election. This is not a good argument.\n\n>Bernie would've won Florida vs Trump?\n\nBecause of his general strength with Hispanics and his ability to deflect attacks about socialism in a much stronger position than Biden.", "time": 1606325520.0}, {"subreddit": "politics", "text": "I think Bernie would've done better than Biden in Florida - Biden's *policies* were not too socialist.", "time": 1606323104.0}, {"subreddit": "politics", "text": ">Also, the Trump team campaigned heavily in Florida to swing those votes. Candidates don't just sit around waiting to see certain groups like them or not. Trump campaigned way harder with Cubans than Biden did.\n\nDuh? I think Sanders would've had a more effective response than Biden since he could highlight his policies without attacking parts of his base.", "time": 1606323076.0}, {"subreddit": "politics", "text": ">it’s hard to argue that he had an easier shot at winning\n\nBernie did much better among Latinos than Biden did in the primary.\n\nWhen there were swings of up to *60 points* from Clinton to Trump in certain Latino heavy counties? I think Sanders would've done better, yeah.\n\n> Biden was unchallenging enough where it was impossible to legitimately cast him as a radical.\n\nIf this was true, why did Cubans swing so hard away from us?", "time": 1606292966.0}, {"subreddit": "democrats", "text": "You might wanna look at range voting - it's approval voting but more expressive.", "time": 1606171276.0}], "republican_score": 0, "democrat_score": 15}