{"name": "CygnusDisconcerted", "posts": [{"subreddit": "politics", "text": "Democrats Should Curb Their Enthusiasm for Mail-in Voting\n", "time": 1599143530.0}, {"subreddit": "democrats", "text": "Democrats Should Curb Their Enthusiasm for Mail-in Voting\n", "time": 1599143485.0}, {"subreddit": "democrats", "text": "Trump’s Coronavirus Claims Often Contradicted by His Own Experts\n", "time": 1585272489.0}, {"subreddit": "politics", "text": "Fair enough, it wasn't a good analogy for this point. My point holds that Trump is attempting an overthrow of our republic to install himself as a dictator.", "time": 1607123358.0}, {"subreddit": "politics", "text": "\"None of the institutions he needs are loyal.\" That means he'll fail, but he's still trying. He's making an attempt.", "time": 1607117575.0}, {"subreddit": "politics", "text": "\\*Planning\\* a coup? He is currently in the process of attempting one! He'll likely fail, but that doesn't mean he isn't trying. If Caesar's armies lost after crossing the Rubicon, that wouldn't mean he didn't attempt the overthrow of the Roman republic, it would simply mean he failed.", "time": 1607101311.0}, {"subreddit": "democrats", "text": "I had to pause that like 7 times so I could laugh without missing the next jokes.", "time": 1607088256.0}, {"subreddit": "politics", "text": "I'm sure this will convince Trump's supporters that their candidate lost the election. They've shown themselves to be reasonable people who are quite willing to see counter-arguments.", "time": 1606608011.0}, {"subreddit": "politics", "text": "This guy is a nightmare that doesn't end.", "time": 1606595726.0}, {"subreddit": "politics", "text": "You might be right, but polls show that pretty close to half of the electorate believe Trump really won the election and it was stolen.", "time": 1606595652.0}, {"subreddit": "politics", "text": "So it's a thing now that officials need to actually declare it \"undemocratic\" when a presidential candidate and his supporters blatantly try to overturn an election result. I thought that would be the definition.", "time": 1606548556.0}, {"subreddit": "politics", "text": "It's much more difficult to lie in court than it is to your vitriolic asshole base.", "time": 1605642938.0}, {"subreddit": "politics", "text": "Again? Didn't he just win it yesterday?", "time": 1605390089.0}, {"subreddit": "politics", "text": "I heart the Lincoln Project.", "time": 1605385092.0}, {"subreddit": "politics", "text": "Biden can't amend the Constitution to eliminate the electoral college by himself. Also, I always wonder by the EC is the biggest focus, rather than the Senate. Yes, the EC is a little undemocratic, but the Senate is absolutely awful, much worse than the EC. There should be Senate districts that each has roughly the same number of people in it.", "time": 1605275309.0}, {"subreddit": "politics", "text": "His supporters want a dictatorship as much as he does, so they're only too happy to support this chaos.", "time": 1605272667.0}, {"subreddit": "politics", "text": "Honestly, I kind of hope that is the case. His stated motivation is far more terrifying.", "time": 1605153525.0}, {"subreddit": "democrats", "text": "\"Thinks\"?? How about, \"Abrams is pointing out the fact that they're acting like dictators\"?", "time": 1605024209.0}, {"subreddit": "politics", "text": "That's appropriate, but we haven't overthrown him yet.", "time": 1604940159.0}, {"subreddit": "democrats", "text": "Thank you for realizing that support for Trump was a mistake.", "time": 1604939087.0}, {"subreddit": "politics", "text": "My thoughts and prayers are with this televangelist.", "time": 1604929569.0}, {"subreddit": "democrats", "text": "His model assumes a fair election. We need to scream from the top of our lungs and work as hard as we can to ensure that we get as fair of an election as possible.", "time": 1599535151.0}, {"subreddit": "politics", "text": "Well, first we need to ensure it's a fair election, and then we need to get out and vote, and then we need to make sure all the votes are counted, and then we need to be proactive in preventing Trump's cheating.", "time": 1599458246.0}, {"subreddit": "politics", "text": "I can't see the article, as I don't have a Washington Post account. I get the point, though, and I hear you. I should've been more careful in what I was posting though. My point in posting that was not to get Dems to all vote in person, but to get more Dems to start taking these problems seriously. We collectively need a plan to combat these problems. However, I picked the wrong article to post. I should've posted something that detailed the problems facing us with mail-in voting, but the thesis of which was not to get Dems to all vote in person.", "time": 1599237236.0}, {"subreddit": "politics", "text": "That sounds great! I'm assuming that Utah allows pre-processing of mail-in ballots, so that they can be counted in time.", "time": 1599220369.0}, {"subreddit": "politics", "text": "Trump and Putin are dictator buddies. I'm sure Trump can't wait to employ those tactics against his political enemies here in the US. So why would the Trump regime criticize the Putin regime?", "time": 1599169568.0}, {"subreddit": "politics", "text": "True, although in a saner world than that, if Biden were a major party nominee, he'd be the conservative party nominee. He'd split the vote roughly 50-50 with a progressive nominee of the opposing major party. And in an even saner world, there would be more viable parties, and we'd have proportional representation. But that's a story for another day.", "time": 1599155415.0}, {"subreddit": "politics", "text": "True. So let's do everything we can to make sure mail in votes are all counted and no results by the media are reported until a sufficient number of them are counted.", "time": 1599153299.0}, {"subreddit": "politics", "text": "And I'm getting torched in another thread because I'm trying to make people vigilant about the mail voting problems. Here's what we need to do for the general.  \n\n\n* Those who can, vote early\n* Those voting by absentee ballot, if possible, return it themselves\n* In states where both of those are impossible, if the lines are not too long and they can socially distance, maybe try to vote in person if they feel safe (those who have N95 masks should be safe)\n* Public pressure for the Senate to pass the funding for the USPS that the House passed\n* Public pressure for the USPS to prioritize elections ballots and get them to their destination on time if they were mailed by their states' deadlines\n* Public pressure for states to allow pre-election day processing of mail-in ballots, which will help them be counted faster\n* Public pressure for the media to resist reporting results until a sufficient number of mail-in ballots are counted, so it doesn't look like the GOP is winning a gargantuan landslide when only in-person votes are counted\n* Encourage for Republicans to vote by mail, for the same reason as the bullet above.", "time": 1599153192.0}, {"subreddit": "politics", "text": "Okay, then maybe I need to change my tone. I'm not trying to scare people out of voting, I'm trying to get us all to be pro-active and fix this problem. Maybe I should say, \"If we don't fix this problem, there's a chance votes won't be counted.\" Is that better? I wrote in another comment what I think we need to do.  \n\n\n[https://www.reddit.com/r/politics/comments/iluhzj/democrats\\_should\\_curb\\_their\\_enthusiasm\\_for\\_mailin/g3vctzx/?context=3](https://www.reddit.com/r/politics/comments/iluhzj/democrats_should_curb_their_enthusiasm_for_mailin/g3vctzx/?context=3)", "time": 1599152951.0}, {"subreddit": "politics", "text": "Those who are lambasting me, I am \\*NOT\\* saying that everyone should vote by mail. I'm just saying that we need to take this problem seriously and combat it. Here are some possible steps. Please add to them if you wish.  \n\n\n* Those who can, vote early\n* Those voting by absentee ballot, if possible, return it themselves\n* In states where both of those are impossible, if the lines are not too long and they can socially distance, maybe try to vote in person if they feel safe (those who have N95 masks should be safe)\n* Public pressure for the Senate to pass the funding for the USPS that the House passed\n* Public pressure for the USPS to prioritize elections ballots and get them to their destination on time if they were mailed by their states' deadlines\n* Public pressure for states to allow pre-election day processing of mail-in ballots, which will help them be counted faster\n* Public pressure for the media to resist reporting results until a sufficient number of mail-in ballots are counted, so it doesn't look like the GOP is winning a gargantuan landslide when only in-person votes are counted\n* Encourage for Republicans to vote by mail, for the same reason as the bullet above.", "time": 1599152803.0}, {"subreddit": "politics", "text": "You make a lot of good points. I myself am voting by absentee ballot, but rather than mailing it in, I'm bringing it back to the elections office myself. There are a lot of things we need to be doing in preparation for this. Sticking our heads in the sand is not one of them. I'm going to write a response to the main thread about this.", "time": 1599152725.0}, {"subreddit": "politics", "text": "Holy shit, I'm not saying everyone should vote in person. I'm just saying that we need to take this problem seriously, and address it, or else we're fucking dead because the GOP will absolutely steal the fucking election. What I'm personally doing is getting an absentee ballot, but rather than mail it in, I'm bringing it back to the elections office directly. I hope a huge portion of Dems voting by absentee ballot do that, if their state allows it. I hope Dem voters in states that allow early voting to take advantage of that as much as possible. If we get a huge percentage early voting that could help tremendously. I also hope that more Republicans decide to vote by mail, which would blunt the effect of an election night where Trump looks like he won because they haven't counted mail-ins. And maybe in places where the lines are not too long, I hope that, yes, some more Dems vote in person, if they can socially distance and feel safe. Furthermore, we need to apply public pressure for the USPS to prioritize election ballots and get them back in time, for the GOP Senate to pass the funding for the USPS that the House passed, for states to extend election deadlines, for the media to refuse to start showing results until mail-ins are counted, for the media to make it clear that we probably won't know the election winner the night of the election. How the hell is the entire Democratic party so complacent about this? You really don't think Trump will steal this fucking election?", "time": 1599152138.0}, {"subreddit": "politics", "text": "But this threat is real. Trump has sabotaged the USPS, and now millions of votes might not make it in time. And another problem is that, even if enough Dem votes make it in time, they're counted much slower. This means Trump will look like he's winning on election night, claim victory, and and then insist any attempt to count the mail-in votes will make for a fraudulent election. And then it would be up to the courts. He very much can steal this election.", "time": 1599144398.0}, {"subreddit": "politics", "text": "But he's right about this. There is a huge chance that Trump and the GOP steal this election by not counting mail-in votes.", "time": 1599144090.0}, {"subreddit": "politics", "text": "Yes, it's scary. We need to do something about it.", "time": 1598967373.0}, {"subreddit": "politics", "text": "It's what the polls are showing right now. I do hope it changes.\n\n [https://fivethirtyeight.com/features/bidens-supporters-appear-way-more-likely-to-vote-by-mail-than-trumps-that-could-make-for-a-weird-election-night/](https://fivethirtyeight.com/features/bidens-supporters-appear-way-more-likely-to-vote-by-mail-than-trumps-that-could-make-for-a-weird-election-night/)", "time": 1598903183.0}, {"subreddit": "politics", "text": "Yes, or get the absentee ballot but bring it back directly to the elections office, without relying on the postal service.", "time": 1598646542.0}, {"subreddit": "politics", "text": "This is scary.", "time": 1598617826.0}, {"subreddit": "politics", "text": "That's shocking.", "time": 1598497013.0}, {"subreddit": "politics", "text": "The first step in this plan would be to, instead of mailing absentee ballots back, taking them back to the elections offices directly. This USPS sabotage has slowed the postal service down to a crawl, and many ballots might not make it in time.", "time": 1598491562.0}, {"subreddit": "politics", "text": "Is it possible in your situation to get the ballot and send it back at least a month before the election?", "time": 1598490997.0}, {"subreddit": "politics", "text": "I don't think that matters. The USPS is still the USPS, and it's slow all around the country right now.", "time": 1598381555.0}, {"subreddit": "politics", "text": "I keep saying this. Don't mail it in. Democrats voting by absentee ballot need to fill it out and bring it back directly. The Trump fix is in.", "time": 1598375441.0}, {"subreddit": "politics", "text": "I'd say drop it off at the elections office, not the post office.", "time": 1598292201.0}, {"subreddit": "politics", "text": "Yes, I agree.", "time": 1598292169.0}, {"subreddit": "politics", "text": "That's terrifying.", "time": 1598292111.0}, {"subreddit": "politics", "text": "The question that has me losing sleep is, how many votes will be discounted due to lateness? The answer to that question will determine whether or not Trump and Republicans at all levels will be able to steal this election.", "time": 1598284286.0}, {"subreddit": "politics", "text": "Agreed.\n\nIt doesn't seem possible to me to get such a gargantuan voter turnout to make up for millions of discounted ballots. I hope I'm wrong about the rough number of discounted ballots we'll have.", "time": 1598282552.0}, {"subreddit": "politics", "text": "This is good news, but I'm still having an existential crisis about this election, due to the problems at the USPS. As I see it, millions of votes -- the vast majority Democratic -- will be discounted after arriving late, giving the GOP a stolen victory at all levels. Can anyone talk me down from the ledge here? Do we have a chance at a semi-fair election?", "time": 1598275997.0}, {"subreddit": "politics", "text": "The general looks like it's going to be even worse. The mail is severely backed up and running behind now, which could put millions of mail-in votes in danger of arriving late. Since far more Democrats than Republicans are planning on voting by mail this year, it's beginning to look like the GOP has already stolen this election at all levels.", "time": 1598270719.0}, {"subreddit": "politics", "text": "Unfortunately, I don't see how this is backfiring on the GOP. Trump has sabotaged the USPS. Postal service delivery has slowed to a trickle, and packages are arriving a month late. Since far more Democrats than Republicans plan on voting by mail, and late ballots won't be counted, millions or perhaps tens of millions more Dem votes than GOP votes will be thrown out. Given this, hasn't Trump already successfully stolen the election? Can anyone talk me down from the ledge here?", "time": 1598212344.0}, {"subreddit": "politics", "text": "No one is in play unless we get the post office issues fixed.", "time": 1598209994.0}, {"subreddit": "democrats", "text": "It couldn't have happened to more deserving people.", "time": 1597950020.0}, {"subreddit": "politics", "text": "Not surprising.", "time": 1597945357.0}], "republican_score": 0, "democrat_score": 7}