{"name": "DoremusJessup", "posts": [{"subreddit": "democrats", "text": "Over the past week, President Trump posted or reposted more than 135 messages on Twitter lashing out at the results of an election he lost. He mentioned the coronavirus pandemic now reaching its darkest hours four times — and even then just to assert that he was right and the experts were wrong\n", "time": 1607219372.0}, {"subreddit": "democrats", "text": "Republicans Pushed to Restrict Voting. Millions of Americans Pushed Back: Almost 160 million people voted this year, as new options made necessary by the pandemic removed many of the traditional barriers to casting ballots. Will it change the way America conducts elections?\n", "time": 1607206326.0}, {"subreddit": "democrats", "text": "PPP: Did the Government Help Those Who Most Needed It? The Data Says No\n", "time": 1607148830.0}, {"subreddit": "democrats", "text": "Of the 700 attempts to fix or abolish the electoral college, this one nearly succeeded: In 1969, Congress almost approved a constitutional amendment to get rid of the electoral college, which meets Dec. 14 to ratify Joe Biden’s election, despite President Trump’s refusal to concede\n", "time": 1607103941.0}, {"subreddit": "democrats", "text": "Trump Associates Said to Have Been Scrutinized in Suspected Pardon Scheme; A billionaire from the San Francisco area sought clemency for a psychologist convicted of monetary crimes. The Republican donor Elliott Broidy and a lawyer who later represented Jared Kushner were enlisted.\n", "time": 1607063380.0}, {"subreddit": "democrats", "text": "Committee Obtains New Internal Documents Showing Census Data Errors More Extensive Than First Reported\n", "time": 1606963541.0}, {"subreddit": "democrats", "text": "P.P.P. Loan Data Shows How a Sliver of Borrowers Got Much of the Help: Just 1 percent of borrowers received more than a quarter of the money given out in the form of forgivable loans\n", "time": 1606937837.0}, {"subreddit": "democrats", "text": "Parler’s got a porn problem: Adult businesses target pro-Trump social network: Hashtags like #keepamericasexy proliferate alongside conspiracy theories and conservative politics\n", "time": 1606931505.0}, {"subreddit": "democrats", "text": "DOJ investigating potential White House 'bribery-for-pardon' scheme: The heavily-redacted documents do not name the individuals who were potentially involved\n", "time": 1606867675.0}, {"subreddit": "democrats", "text": "AG Barr says DOJ hasn't uncovered widespread voter fraud in 2020 election\n", "time": 1606852132.0}, {"subreddit": "democrats", "text": "Debunking Trump allies’ latest arguments about fraud in the 2020 election\n", "time": 1606785688.0}, {"subreddit": "democrats", "text": "Racism is at the core of the debate to keep the electoral college", "time": 1607104003.0}, {"subreddit": "democrats", "text": "Barr: \"To date, we have not seen fraud on a scale that could have affected a different outcome in the election”", "time": 1606852300.0}, {"subreddit": "democrats", "text": "Before this election the largest vote total was Barack Obama, 69,498,516 in 2008.", "time": 1606239927.0}, {"subreddit": "democrats", "text": "New York State may have more than a million votes still to count.", "time": 1606238466.0}, {"subreddit": "democrats", "text": "Also she knows how to piss off the entire WNBA.", "time": 1606026728.0}, {"subreddit": "democrats", "text": "If she totally disregards the safety guidelines, how can we expect her  to protect the country?", "time": 1606021992.0}, {"subreddit": "democrats", "text": "Congress looks like it may be having a superspreader situation.", "time": 1605671542.0}, {"subreddit": "democrats", "text": "One grifter trying to grift another grifter. Time to start the popcorn.", "time": 1605641211.0}, {"subreddit": "democrats", "text": "From Lindsey's mouth, to  God's ears.", "time": 1604879248.0}, {"subreddit": "democrats", "text": "I don't want to see his supporters storming election centers trying to stop the count before it is finished.", "time": 1604270720.0}, {"subreddit": "democrats", "text": "Another dog whistle, telling his supporters to stand by.", "time": 1604270608.0}, {"subreddit": "democrats", "text": "It would be a dog whistle for his supporters.", "time": 1604267927.0}, {"subreddit": "democrats", "text": "This is an effort to cause chaos in the streets. The media needs to refuse to allow Trump free airtime to announce a phoney victory.", "time": 1604263175.0}, {"subreddit": "democrats", "text": "This strategy only works if there are close elections.", "time": 1604109186.0}, {"subreddit": "democrats", "text": "Trump: You get some Covid. You get some Covid. Everybody gets some Covid. /s", "time": 1604001481.0}, {"subreddit": "democrats", "text": "But he's still voting for Amy Coney Barrett.", "time": 1602798977.0}, {"subreddit": "democrats", "text": "There will be repercussions after this election. Justice will be returned to this country.", "time": 1602731916.0}], "republican_score": 0, "democrat_score": 28}