{"name": "mrsteven43", "posts": [{"subreddit": "democrats", "text": "Agreeable from ANY side of the argument", "time": 1607201614.0}, {"subreddit": "politics", "text": "What are you thoughts on the large crowd protesting throughout the year? All of them", "time": 1607156779.0}, {"subreddit": "politics", "text": "Here are just a few \n\nhttps://truepundit.com/new-york-democratic-leaders-caught-maskless-at-private-party-despite-covid-restrictions/\n\nhttps://www.google.com/amp/s/nypost.com/2020/11/18/photos-show-california-gov-newsom-at-maskless-party/amp/\n\nhttps://www.google.com/amp/s/www.the-sun.com/news/1792478/mayor-chicago-cancel-thanksgiving-celebrating-biden/amp/\n\nhttps://twitter.com/NineDaves/status/1325136195962040322?s=20\n\nhttps://www.bbc.com/news/world-us-canada-53994209\n\nhttps://www.westernjournal.com/joe-biden-spotted-maskless-telling-americans-part-wear-mask/", "time": 1607153627.0}, {"subreddit": "politics", "text": "Oh wow!!! Is this frowned upon? What about all the democrat leaders that have been doing this? The only thing they were 6 ft away from was their mask", "time": 1607134990.0}, {"subreddit": "democrats", "text": "And what is this place for y'all? Lmao", "time": 1606855399.0}, {"subreddit": "politics", "text": "Exactly, right! The senate and the house ARE on the same ballot as the presidential candidates. How often would you find someone vote  Biden and then vote Republican on the same ballot?? Republicans smashed the house and senate. Obama questioned the mail in ballots. Democrats claimed russian collusion for the past 4 years but all of a sudden the election is fair? You don't think there is something fishy about Biden getting a record 80+ million votes but overall Democrats underperformed Republicans everywhere else? Wouldnt Democrats likely outperform Republicans all around as well??", "time": 1606682191.0}, {"subreddit": "politics", "text": "Y'all don't even entertain the idea that voter fraud may exist. Everyone preaches about democracy but if the democrats rigged the election, isn't that clearly anti-democracy? Are y'all okay with that? Would y'all be outraged if there were reports of Biden votes flipping to Trump? I'm clearly conservative leaning but if the shoe was on the other foot, I'd support locking up Trump and all of his accomplices for rigging the election. Shouldn't everyone agree that an election should be fair and legal?", "time": 1606680525.0}, {"subreddit": "politics", "text": "One of many examples\nhttps://youtu.be/VkxKvZ2txGE \n\nAnd here is some additional information \nhttps://www.google.com/url?sa=t&source=web&rct=j&url=https://crsreports.congress.gov/product/pdf/R/R45945&ved=2ahUKEwj9gPy3l6ftAhUoQzABHRZ9AcEQFjAOegQIGhAB&usg=AOvVaw187lkXZ-po8ZNyIEg6szr2\n\nUnfortunately, I have a wait time between posting a comment in this subreddit.", "time": 1606633573.0}, {"subreddit": "politics", "text": "Who is burning american flags?", "time": 1606584453.0}, {"subreddit": "politics", "text": "One group chants death to America while the other chants we love America. Who do you think is going to get violent? Unfathomable", "time": 1606582354.0}, {"subreddit": "democrats", "text": "Where is the other half?", "time": 1606239935.0}, {"subreddit": "politics", "text": "Uh, clearly this sub is extremely anti Trump", "time": 1606171797.0}, {"subreddit": "democrats", "text": "Lmao you sound like a nice person", "time": 1606018004.0}, {"subreddit": "politics", "text": "Will Obama/Biden take credit for the cages as well?", "time": 1605755948.0}, {"subreddit": "politics", "text": "Wow. Much smart.", "time": 1605664143.0}, {"subreddit": "democrats", "text": "Why isn't anyone acknowledging obvious violence? Who is really tearing people apart?", "time": 1605463899.0}, {"subreddit": "democrats", "text": "Lmao nothing but hypocritical hate here", "time": 1605459893.0}, {"subreddit": "politics", "text": "Let's rebuild and undo all the damage!", "time": 1605434032.0}, {"subreddit": "democrats", "text": "Aren't the liberals still in the denial phase for the past 4 years?", "time": 1604779853.0}, {"subreddit": "democrats", "text": "Would you support biden for a second term?", "time": 1604769873.0}, {"subreddit": "politics", "text": "Wow how is this not racism lmao", "time": 1604706081.0}, {"subreddit": "democrats", "text": "This whole year the racist and violent have been destroying cities across the US. You can even see all these businesses expecting to be damaged so they are boarding up in attempt to protect their lively hood. These trump supporting rioters have been looting and burning until they get what they want. They want control over everything because they are FASCISTS!!! It's their way or the highway and if you disagree with their racist, authoritarian ideals, you'll be beat, stabbed or shot and executed. Did I say Trump supporters? Sorry, I meant Antifa/BLM/liberals. Look at all those examples! You think Trump supporters in their trucks look like the taliban? Tell me where Antifa got their stunning fashion statement from.", "time": 1604593092.0}, {"subreddit": "democrats", "text": "Remember, your vote matters unless you disagree with liberals", "time": 1604592420.0}, {"subreddit": "politics", "text": "Damn why is there so much hate in the party of love and tolerance", "time": 1604569186.0}, {"subreddit": "politics", "text": "Unhinged much", "time": 1604332857.0}, {"subreddit": "democrats", "text": "She adopted one 15 years ago and another 10 years ago. Trump must have been planning this for a very long time huh?", "time": 1602625917.0}, {"subreddit": "politics", "text": "Thank you for the information!", "time": 1602289715.0}, {"subreddit": "democrats", "text": "Why not just get it over with? Time to release them and move on", "time": 1602281244.0}, {"subreddit": "politics", "text": "The conservative subs told me the Wolverine Watchmen are anti-gov group. They also share a video of one of these guys expressing hate for Trump. Am I being misled?", "time": 1602278562.0}, {"subreddit": "democrats", "text": "I cant wait for the presidential super bowl", "time": 1602275407.0}, {"subreddit": "politics", "text": "Let's see if Nancy will approve a stand alone stimulus check", "time": 1602187167.0}, {"subreddit": "politics", "text": "So are they banning fracking or not?", "time": 1602186549.0}, {"subreddit": "democrats", "text": "Shame. Using bots for propaganda. Keep removing bots and we will all see what remains", "time": 1602182576.0}, {"subreddit": "politics", "text": "And left wing media says there is no voter fraud so it seems we are both being played", "time": 1602181508.0}, {"subreddit": "politics", "text": "He will just vandalize the office just like Clinton did before he left.", "time": 1602180908.0}], "republican_score": 0, "democrat_score": 14}