{"name": "Someoneoverthere42", "posts": [{"subreddit": "politics", "text": "Corrected headline; \"lame duck president begs governor to publicly break law, commit sedition\"", "time": 1607220783.0}, {"subreddit": "politics", "text": "I just assume the plan is for Kushner to confiscate the vaccine and resell it at as high as price as they can", "time": 1607197143.0}, {"subreddit": "democrats", "text": "Its like watching two serial killers have a slap fight over who gets to kill us first", "time": 1607195441.0}, {"subreddit": "politics", "text": "Annnnnnnd....its dead in the senate. So, (shrugs)", "time": 1607116152.0}, {"subreddit": "politics", "text": "So, how long until a right wing bobblehead declares that this is all a cover to create precedent so those darn liberals can repeal the 2nd amendment?", "time": 1607114380.0}, {"subreddit": "politics", "text": "Yeah, pre emptive pardons, which may not be legally binding, which may actually make the illegal things more illegal, which could legally be read as 'intent to commit.\" Pardons which require you to admit guilt. But yeah, hand those suckers out", "time": 1607110405.0}, {"subreddit": "politics", "text": "Well, that's not going to happen. Counter offer, we do absolutely nothing to change and then just blame the scientists when the world goes to shit.", "time": 1607103592.0}, {"subreddit": "politics", "text": "\"People often mention the banality of evil, but they rarely talk about the stupidity of it\"", "time": 1606963490.0}, {"subreddit": "politics", "text": "\"The international communist socialist left.\" What, was 'zionist' to hard for him to spell? We all know that's where he's going right?", "time": 1606942093.0}, {"subreddit": "democrats", "text": "Because he’s convinced just enough of them that he, and he alone, is the sole barrier between ‘Murcia and godless socialist homosexual immigrant hordes", "time": 1606872002.0}, {"subreddit": "politics", "text": "“We won’t forget, and we won’t forgive” we also won’t learn anything from this. History has shown that we’re....well....kinda dumb. Seriously liberals/democrats are basically Charlie Brown trying to kick the football. We keep believing that the other side will play fair for some reason. And every time.....thud", "time": 1606798007.0}, {"subreddit": "democrats", "text": "“Guy who is about to get fired, quits job no one wants him in”", "time": 1606780071.0}, {"subreddit": "politics", "text": "GAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHHHHHHHHHH! MAKE IT STOP! makeitstopmakeitstopmakeitstopmakeitstopmakeitstopmakeitstop.......aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaahhhhhhhhhh!", "time": 1606777330.0}, {"subreddit": "politics", "text": "So.....a normal trump speech", "time": 1606360127.0}, {"subreddit": "politics", "text": "\"But.....but....but....no one said there would be consequences for actions! No one! So unfair!\"", "time": 1606226595.0}], "republican_score": 0, "democrat_score": 3}