{"name": "username8oD", "posts": [{"subreddit": "politics", "text": ">It is because I registered as a no party what I should maybe done was register red and vote blue, but Hillary only helps hip-hop rap people. I should not live in the USA but the martial artist \"advertises\" and bastardizes my education I should not live in the USA and I should move to Massachusett, or be an illegal immigrant in sweedenbut there is no social mobility and there is just dooping people to dress as serious dissenter, there is no such thing as fashion. There should be more toll ways.", "time": 1607201790.0}, {"subreddit": "politics", "text": "ghostbusters!", "time": 1607193509.0}, {"subreddit": "politics", "text": "Is she going to take away the bachelor's degrees and make it a real number counting class only? Because that is what I am expecting from the government.", "time": 1607192608.0}, {"subreddit": "politics", "text": "Citizens United does not know the difference.", "time": 1607190241.0}, {"subreddit": "politics", "text": "They only want proven people, education is a hit or miss, and the community usually bastardizes foreigners.", "time": 1607189883.0}, {"subreddit": "politics", "text": "He eats out pussy on any moon cycle like a true atheist, but why complement his love life.", "time": 1607188352.0}, {"subreddit": "politics", "text": "Was his hands in the pudding.", "time": 1607187452.0}, {"subreddit": "democrats", "text": "Then we would be \"prejudice and would break the equality and not make ourselves into the people of Walmart look how much monies I made in my own country hard work\\*durrr\\* politicians are fucking stupid puppets, that want everyone sucking dick in the street for ketchup packets. Politics are the bottom degree it's for 0's. But it is a money maker.", "time": 1607187045.0}, {"subreddit": "politics", "text": "The only reason why there are private schools is a corporal punishment fetish because it is ok if it is ethnic. Only be a fucking citizen.", "time": 1607185579.0}, {"subreddit": "politics", "text": "They know how to \"live\" in New York.", "time": 1607184525.0}, {"subreddit": "politics", "text": "Let us ask Scotland.", "time": 1607181231.0}, {"subreddit": "democrats", "text": "> Hamberder\nhaha thanks I did not hear.", "time": 1607141703.0}, {"subreddit": "politics", "text": "And CD's and mirrors well erase all my mistakes.", "time": 1607136347.0}, {"subreddit": "democrats", "text": "Hamberger, check.", "time": 1607136019.0}, {"subreddit": "democrats", "text": "Trump is an annoying squeaky wheel getting all the grease.", "time": 1605712596.0}, {"subreddit": "politics", "text": "Most people I am around are going to say, so what he is rich and that is what you have to do.", "time": 1605399772.0}], "republican_score": 0, "democrat_score": 4}