{"name": "OMGFloriduh", "posts": [{"subreddit": "democrats", "text": "Michigan Board of State Canvassers Meeting at 1PM Eastern Live Stream\n", "time": 1606153028.0}, {"subreddit": "democrats", "text": "Uhm, what exactly in the math says it is impossible for Biden to win?  Honestly, that is the dumbest argument I have heard.\n\nAs for privately owned (as in a private corporation), as opposed to what a public corporation?  As if a public corporation isn't biased?  Please.  Republicans do nothing but serve large public corporations and billionaires.  They couldn't even care about you, me, or small businesses.  They will say the words, but they do not deliver anything but poison pills.\n\nIn any case, ask them why 12 of the 14 counties in Pennsylvania that Trump won used Dominion and there is no issue there?  Ask them why the two counties in dispute on their lawsuit didn't even use Dominion?  Ask them why Georgia & Wisconsin recounts resulted in no significant change, and no fraud was found?  Ask them why every secretary of state, governor, election official, CISA, etc all said there was no fraud found.\n\nFinally, ask the if they are insane.  Because if they still believe this shit, that is the problem.", "time": 1607194237.0}, {"subreddit": "democrats", "text": "They do not need to be charged, as I understood it.  But in the pardon you have to state the crime in specifics, in other words admit it via acceptance of the pardon.", "time": 1607168189.0}, {"subreddit": "democrats", "text": "Sure it makes sense, Donald is a racist who only hires the best of people (white criminals, based on the data so far).", "time": 1607116469.0}, {"subreddit": "democrats", "text": "Pardons have to be specific, so you basically have to admit the crime.", "time": 1607094388.0}, {"subreddit": "democrats", "text": "Clearly this is topic is baiting.", "time": 1607033938.0}, {"subreddit": "democrats", "text": "A personal injury attorney, so you know he has no qualms about cheating the system.", "time": 1607033491.0}, {"subreddit": "democrats", "text": "racist much?", "time": 1607021865.0}, {"subreddit": "democrats", "text": "Yeah, sure.  Someone is definitely in denial.", "time": 1606958339.0}, {"subreddit": "democrats", "text": "Well I guess that logic could be applied to why Donald Trump pushed tax cuts for the wealthy then.  (The difference is what he did affects 1% of the population, and himself and cronies.  Where what they are talking about affects 25% of the working population).", "time": 1606942198.0}, {"subreddit": "democrats", "text": "Their kids do have their work cut out for them.", "time": 1606602842.0}, {"subreddit": "democrats", "text": "I think someone is going to notice someone there with a screwdriver & memory card trying to open a voting machine.  For this to a viable threat, it needs to be done remotely (which these machines are not networked from what I read) or something doable from the touch screen.\n\nNot to mention there is a paper ballot printed, and as a voter you should be verifying the printout.  But it is also validated in a sampling, and in recounts.", "time": 1606521200.0}, {"subreddit": "democrats", "text": "good luck, moscow mitch will not have it unless there is at least 10X the spending for corporate bailouts.", "time": 1605734894.0}, {"subreddit": "democrats", "text": "Whaaaaa?  This boot licker wants to get paid?  Trump probably thinks he will do it for free.  How much do you want to bet that Trump will promise him and stiff him on the bill?\n\nLOL, can't wait for this drama to unfold and before you know it Ghouliani will have a tell all book and be all over Fox news.", "time": 1605646885.0}, {"subreddit": "democrats", "text": "Oof.  Foot in mouth?  I bet Lindsay didn't anticipate this outcome.", "time": 1605646726.0}, {"subreddit": "democrats", "text": "The documents are clearly the type of congressional oversight that we would want as citizens.  They are seeking information about the ownership of the company, it's investments in R&D, whether it is maintaining the machines & software, and so forth.  It also notes statements made by voters, but it never says anything about the findings or whether any claims are true.\n\nBy the way the Georgia **hand** recount findings of very little change in voter results.  Which confirms that the machines are in fact accurate and the voting process is secure.", "time": 1605564566.0}, {"subreddit": "democrats", "text": "I like the contrasting tweets, LOL.  Joe Biden is \"great job on your accomplishment\", Trump is \"it wouldn't have happened if it wasn't for me, it's a good thing I am a rocket scientist.\"", "time": 1605545605.0}, {"subreddit": "democrats", "text": "Doesn't defcon start at 5 and go to 1 (severe)?", "time": 1605526818.0}, {"subreddit": "democrats", "text": "Obama was down there the general election, he is a closer.  I wouldn't be surprised if he doesn't come in the last few days of the run off.\n\n[https://www.cnn.com/2020/11/02/politics/georgia-biden-obama/index.html](https://www.cnn.com/2020/11/02/politics/georgia-biden-obama/index.html)", "time": 1605526045.0}, {"subreddit": "democrats", "text": "He still has Mitch.  Let's work on that.", "time": 1605525440.0}, {"subreddit": "democrats", "text": "death treats", "time": 1605480543.0}, {"subreddit": "democrats", "text": "I would think Trump would be Michael, maybe Rudy could be Toby.  :)  This has to be a regular occurrence in the white house:\n\n[https://www.youtube.com/watch?v=qfNReBBUk\\_w](https://www.youtube.com/watch?v=qfNReBBUk_w)\n\nI love the emotional & uncomfortable outbursts from Michael, it reminds me of Trump a lot.  It's so uncomfortable but you can't turn away, and then your mind wanders about what the hell is wrong with this person, and then you realize he is 6.", "time": 1605351613.0}, {"subreddit": "democrats", "text": "if (money earned from legal fund scam > money spent on re-election campaign), then concede election else ramp up crazy", "time": 1605351231.0}, {"subreddit": "democrats", "text": "5 seconds later:\n\nTrump's lawyer: uhh your honor we will like to withdraw from this case.", "time": 1605304593.0}, {"subreddit": "democrats", "text": "Meanwhile he is ruining the reputation of Dominion over his own narcissism.  It looks like Dominion had to throw up a front-page to try and set the record straight.\n\n[https://www.dominionvoting.com/election2020-setting-the-record-straight/](https://www.dominionvoting.com/election2020-setting-the-record-straight/)\n\nPretty messed up, this dude just can't admit he lost.  And I am sure he doesn't understand why there was such a huge turnout for this election either, and +5M against him.  Personally I find it bizarre that 71M people voted for him, the dude completely disgusts me from the first moment he ran back in 2014-15.", "time": 1605215252.0}, {"subreddit": "democrats", "text": "It wasn't just Trump, it was every Republican down here that played this strategy.  This is why we lost 2 house seats from Florida.\n\nRepublicans also placed shill candidates on the ballot to draw away some votes.\n\n&#x200B;\n\n[https://www.local10.com/news/local/2020/11/11/evidence-suggests-several-state-senate-candidates-were-plants-funded-by-dark-money/](https://www.local10.com/news/local/2020/11/11/evidence-suggests-several-state-senate-candidates-were-plants-funded-by-dark-money/)", "time": 1605214522.0}, {"subreddit": "democrats", "text": "Just post [this](https://www.reddit.com/r/democrats/comments/jsdkw3/did_you_guys_hear_what_mike_lindell_is_up_to/) there.", "time": 1605178832.0}, {"subreddit": "democrats", "text": "[https://www.reuters.com/article/uk-factcheck-benford/fact-check-deviation-from-benfords-law-does-not-prove-election-fraud-idUSKBN27Q3AI](https://www.reuters.com/article/uk-factcheck-benford/fact-check-deviation-from-benfords-law-does-not-prove-election-fraud-idUSKBN27Q3AI)", "time": 1605142228.0}, {"subreddit": "democrats", "text": "Your concession is not necessary, have a nice day.", "time": 1605131343.0}, {"subreddit": "democrats", "text": "Not surprised at all.", "time": 1605131115.0}, {"subreddit": "democrats", "text": "Don't forget about those 160 fraudulent votes, that means he will only need 102.3% to close the gap.  Totally.....not....possible.", "time": 1605057604.0}, {"subreddit": "democrats", "text": "Right, they will go up just like the prices went down when they got that massive tax break from Trump.", "time": 1605045890.0}, {"subreddit": "democrats", "text": "The location for this presser is making total sense now.", "time": 1604963505.0}, {"subreddit": "democrats", "text": "LOL.  I like how the URL is flagged as \"problematic\" by bit.ly.", "time": 1604963095.0}, {"subreddit": "democrats", "text": "Honestly I didn't think Trump could find anyone dumber than Michael Cohen.", "time": 1604918337.0}, {"subreddit": "democrats", "text": "Sounds good.", "time": 1604614681.0}, {"subreddit": "democrats", "text": "Please send more democrats to Florida, we need the help.", "time": 1604613011.0}, {"subreddit": "democrats", "text": "This is truly mind-boggling line of thought.  This person wants a dictatorship and he thinks things will get better?  I would love to see what this person thinks when all of their civil liberties are stripped away, their wages are reduced to $1/hr,  and their lord and master is sapping the country dry of every single dollar he can steal from taxpayers.\n\nBecause that is what will happen if that guy gets what he wants.", "time": 1604611476.0}], "republican_score": 0, "democrat_score": 38}