{"name": "LogosPathos339", "posts": [{"subreddit": "democrats", "text": "GOP Swamps Democrats with 400% More Cash in Georgia Senate Races\n", "time": 1607135219.0}, {"subreddit": "politics", "text": "Biotech group to sue Trump administration over drug pricing plan -STAT news\n", "time": 1607103290.0}, {"subreddit": "democrats", "text": "Trump campaign, RNC have raised $207.5 million since Election Day\n", "time": 1607047318.0}, {"subreddit": "politics", "text": "Bill Gates just released a plan for US leadership on climate change, including $35B in funding\n", "time": 1607028858.0}, {"subreddit": "democrats", "text": "McEnany hits Democratic leaders for not following their own COVID-19 restrictions\n", "time": 1606943040.0}, {"subreddit": "politics", "text": "McEnany hits Democratic leaders for not following their own COVID-19 restrictions\n", "time": 1606942924.0}, {"subreddit": "politics", "text": "Biden won — so why did Trump's popularity hit its highest point ever?\n", "time": 1606153331.0}, {"subreddit": "democrats", "text": "Financially troubled startup helped power Trump campaign\n", "time": 1605738137.0}, {"subreddit": "democrats", "text": "Indigenous Democrats Helped Flip Arizona, No Thanks to Party Leaders\n", "time": 1605737419.0}, {"subreddit": "democrats", "text": "‘I’m not a f---ing socialist’: Florida Democrats are having a postelection meltdown\n", "time": 1605720168.0}, {"subreddit": "politics", "text": "Zuckerberg, Dorsey to Face Republicans Furious About Trump Loss\n", "time": 1605586059.0}, {"subreddit": "politics", "text": "Fewer Americans say justice system is 'not tough enough'\n", "time": 1605549157.0}, {"subreddit": "democrats", "text": "Andrew Yang: A Warning For Democrats Obsessed With The Suburbs\n", "time": 1605473961.0}, {"subreddit": "democrats", "text": "AP FACT CHECK: Trump wrongly takes full credit for vaccine\n", "time": 1605307624.0}, {"subreddit": "democrats", "text": "Trump's most loyal senator is still on the ballot\n", "time": 1605300269.0}, {"subreddit": "politics", "text": "Trump's most loyal senator is still on the ballot\n", "time": 1605300224.0}, {"subreddit": "democrats", "text": "Climate crisis denier Senator David Perdue lives in beachfront mansion reinforcing for sea-level rise\n", "time": 1605241001.0}, {"subreddit": "politics", "text": "America's forest sector is ready for climate action and rural America can benefit\n", "time": 1605218009.0}, {"subreddit": "democrats", "text": "America's forest sector is ready for climate action and rural America can benefit\n", "time": 1605217955.0}, {"subreddit": "politics", "text": "Voting machine company denies Trump claims about software issues\n", "time": 1605217603.0}, {"subreddit": "democrats", "text": "Republicans join forces to raise cash for Georgia Senate runoffs\n", "time": 1605216742.0}, {"subreddit": "politics", "text": "Republicans join forces to raise cash for Georgia Senate runoffs\n", "time": 1605216707.0}, {"subreddit": "democrats", "text": "‘Poor judgment’ used in Jeffrey Epstein plea deal, Justice Department says\n", "time": 1605215818.0}, {"subreddit": "politics", "text": "‘Poor judgment’ used in Jeffrey Epstein plea deal, Justice Department says\n", "time": 1605215734.0}, {"subreddit": "politics", "text": "Iran’s low-enriched uranium stockpile 12 times beyond limit: IAEA\n", "time": 1605144504.0}, {"subreddit": "politics", "text": "Iran finishes moving first batch of advanced centrifuges underground\n", "time": 1605144363.0}, {"subreddit": "democrats", "text": "Iran’s Enriched Uranium Stockpile Is 12 Times Nuclear Accord’s Cap, U.N. Agency Says\n", "time": 1605144172.0}, {"subreddit": "politics", "text": "Iran’s Enriched Uranium Stockpile Is 12 Times Nuclear Accord’s Cap, U.N. Agency Says\n", "time": 1605144084.0}, {"subreddit": "democrats", "text": "Senate Republicans urge Trump to go all-in on Georgia\n", "time": 1605119298.0}, {"subreddit": "politics", "text": "Senate Republicans urge Trump to go all-in on Georgia\n", "time": 1605118128.0}, {"subreddit": "democrats", "text": "Pence doesn't provide evidence of voter fraud in meeting with GOP senators\n", "time": 1605045876.0}, {"subreddit": "democrats", "text": "Trump gains with Latino voters driven by rural support\n", "time": 1604862035.0}, {"subreddit": "politics", "text": "Well said, it’s annoying to see we can’t criticize our own parties yet are constantly encouraged to turn to good old fashion tribalism", "time": 1606953510.0}, {"subreddit": "democrats", "text": "The spokeswoman for hypocrites, criticizing other hypocrites", "time": 1606949372.0}, {"subreddit": "politics", "text": "100% Agree", "time": 1606943532.0}, {"subreddit": "politics", "text": "I agree, polling needs to change. 2016 and 2020 proved why", "time": 1606154439.0}, {"subreddit": "politics", "text": "The title could be better, however it’s mostly referring to a Rasmussen reports/pulse opinion research poll of an approval rating of 51%. https://projects.fivethirtyeight.com/trump-approval-ratings/", "time": 1606154248.0}, {"subreddit": "democrats", "text": "Should we learn from any of our mistakes? \n\nEstablished Democrats: \"No\"", "time": 1605738381.0}, {"subreddit": "politics", "text": "It’s all understandable friend, this pandemic hasn’t helped either. Stay strong, and pass forward the kindness to strangers.\n\nHope you have a good day", "time": 1605559423.0}, {"subreddit": "politics", "text": "Ya, nature acts as a good mental reset. Especially as you’re forced to not have any wifi to help break away from our own phones lol\n\nEdit: wording", "time": 1605558124.0}, {"subreddit": "politics", "text": "Nice! I haven’t kayaked for awhile, I always found it to be very peaceful. Do you like to go camping too?", "time": 1605557792.0}, {"subreddit": "politics", "text": "Same, I’m on lunch beak too. Traffic was annoying today. This weekend should be decent, I’m planning on barbecuing", "time": 1605557558.0}, {"subreddit": "politics", "text": "Hi peter, how’s your day going", "time": 1605557244.0}, {"subreddit": "politics", "text": "Do you wanna be friends? I think you need a friend", "time": 1605557137.0}, {"subreddit": "politics", "text": "Typical redditor, you make us all proud", "time": 1605556875.0}, {"subreddit": "politics", "text": "Agreed, it seems a bit encouraging that more people are viewing the down stream affects of our justice system and less of a need to be ‘tougher on crime’", "time": 1605556793.0}, {"subreddit": "politics", "text": "Did you read the entire article?", "time": 1605556617.0}, {"subreddit": "politics", "text": "Agreed, the US could learn a thing or two from how scandinavian prisons work and their success.", "time": 1605556522.0}, {"subreddit": "politics", "text": "Read the article, less people are viewing the need to be ‘tougher on crime’", "time": 1605556299.0}, {"subreddit": "politics", "text": "that is due to users like gearstars only allowing what they want on r/politics", "time": 1605149650.0}, {"subreddit": "politics", "text": "Are you ignoring how trump has also [talk about going to war with iran](https://thehill.com/homenews/administration/476631-trump-repeatedly-said-obama-would-start-war-with-iran-to-get-elected) regarding [US president's and election time](https://www.youtube.com/watch?v=lfTVL3Vjdzk)?\n\nEdit: Formatting", "time": 1605149034.0}, {"subreddit": "politics", "text": "Trump has talked about [going to war with Iran regarding presidents and election time](https://thehill.com/homenews/administration/476631-trump-repeatedly-said-obama-would-start-war-with-iran-to-get-elected). We even have a [video of him](https://www.youtube.com/watch?v=lfTVL3Vjdzk) talking about this subject", "time": 1605148850.0}, {"subreddit": "politics", "text": "Who would’ve thought that a deal the USA in 2015 signed off of and having president trump no longer abide by wouldn’t be considered apart of US news... oh that’s right a troll would", "time": 1605146453.0}, {"subreddit": "politics", "text": "You’re really trying to tell me that this won’t have an impact on US policy making at all? Or how Trump pulled out of the 2015 deal?", "time": 1605146054.0}, {"subreddit": "politics", "text": "Could you explain what’s off topic about this article?", "time": 1605145699.0}, {"subreddit": "politics", "text": "Could you link some of those articles/post? I haven’t noticed any probably due to the election", "time": 1605145510.0}, {"subreddit": "politics", "text": "Had Iran went along with the 2015 deal, it would’ve take them about a year to produce enough enriched uranium to use within missiles/weapons instead of a shorter time frame of 2 to 3 months. Giving other countries time for diplomatic talks.", "time": 1605145354.0}, {"subreddit": "politics", "text": "Wish these politicians would stop counting their chickens before they hatch and win the Georgia run off elections first", "time": 1605120581.0}, {"subreddit": "politics", "text": "Lol, Australia has done its fair share of messing up the environment too and hasn’t changed", "time": 1604901223.0}, {"subreddit": "politics", "text": "Get rid of police union’s so bad cops can actually be punished/fired and good cops won’t face retaliation", "time": 1604871967.0}, {"subreddit": "politics", "text": "About time", "time": 1604766758.0}, {"subreddit": "politics", "text": "If the people of San Francisco truly wanted to improve things then why don’t they take a look at how their zoning and building regulations hurt their own city. \n\nThey need to stop the NIMBY mentality.", "time": 1604595653.0}, {"subreddit": "politics", "text": "A valid logical question, sadly the average user in this subreddit doesn’t care or didn’t even think of that.", "time": 1604595460.0}, {"subreddit": "politics", "text": "The severe NIMBY mentality is hurting San Francisco", "time": 1604595242.0}, {"subreddit": "politics", "text": "Why is it that San Francisco doesn’t relax their zoning and building regulations? They’ve had a big NIMBY mentality", "time": 1604594739.0}, {"subreddit": "politics", "text": "What do you consider rich? \n\nWould you classify someone who makes $500k in ordinary income (taxed at 35%) the same as someone like warren buffett?\n\nSince Buffett could \"make\" billions in long term capital gains (if he were to sell his shares, being taxed at 20%) and takes a $1 salary (lowest tax bracket) considering he is able to live off of dividends instead (due to \"lowest tax bracket\" and has to pay 0% in qualified dividends)?\n\nBuffett is playing by the rules yet due to his situation is \"taxed\" lower percentage wise compared to the person making $500k in ordinary income", "time": 1604386699.0}, {"subreddit": "politics", "text": ">In the region, single-and multi-family households account for 60 percent of water consumption—70 percent of which is used for landscaping.\n\nwow... look at that, they found what is consuming most of their water and are taking steps to educated and promote water conservation. What a shocking concept \n\n>SNWA has undertaken significant efforts to promote water conservation and manage regional water resources.\n\n>between 2002 and 2014, despite the addition of 520,000 people during those years, for a per capita water use reduction of 40 percent.\n\nLol, the sky is not falling. Please read your own material\n\nEdit: Formatting", "time": 1604382008.0}, {"subreddit": "politics", "text": "Learn to exist without water? You know they get their water from the Colorado river right? Do you even know how hot it already gets in some of these places?", "time": 1604354973.0}, {"subreddit": "politics", "text": "You realize that people have different Preferences right? Some people might like a desert scenery", "time": 1604337655.0}, {"subreddit": "politics", "text": "Which state are you referring? Is it California, New York or New Jersey?\n\nhttps://reason.org/policy-study/24th-annual-highway-report/", "time": 1604337573.0}, {"subreddit": "politics", "text": "I wonder if people in these states also want a more Swedish approach to societal issues? If so they should take a look at the pension reforms that took place in Sweden. \n\nLeft leaning people would need to except a bitter pill after they learn from one of their prized countries they like to compare us against.", "time": 1604337215.0}, {"subreddit": "politics", "text": "Should we cut the pork from our state budget? No, of course not why would we remotely think of it. Let’s just constantly increase taxes without a second thought to our new remote/work from home world. People totally wouldn’t leave right? /s", "time": 1604336888.0}, {"subreddit": "politics", "text": "Trump talks about law and order yet somehow falls silent here /s", "time": 1602361871.0}, {"subreddit": "politics", "text": "Trump was busy [saluting a North Korean general](https://www.politico.com/story/2018/06/14/trump-north-korea-general-salute-646248) to even notice.", "time": 1602347179.0}, {"subreddit": "politics", "text": "Making fun of him will only provide more free publicity. \n\nGet others to vote and educate them on voting procedures instead.", "time": 1601151968.0}, {"subreddit": "politics", "text": "Or... an even crazier idea, why not support both? And good job not reading into what the Lincoln Project is about at all.", "time": 1596326403.0}, {"subreddit": "politics", "text": "Don’t forget how the vast majority of people in 2016 thought trump had no chance at winning the election then. \n\nDo not underestimate the power of his cult, we need to proactively spread and support organizations trying to persuade their fellow republicans away from trump such as the [Lincoln Project] (https://lincolnproject.us/) and [republican voters against trump] (https://rvat.org/).", "time": 1596316232.0}, {"subreddit": "politics", "text": "Some Republicans don’t even like him which is why we need to help spread and support organizations like the [Lincoln Project] (https://lincolnproject.us/) and [Republican Voters Against Trump] (https://rvat.org/). They are actively trying to persuade fellow republicans away from trump.", "time": 1596315212.0}, {"subreddit": "politics", "text": "If you really want to stop trump continuing to undermine our health and safety, then get more people to help spread and support organizations persuading Republicans away from trump like the [Lincoln Project] (https://lincolnproject.us/)", "time": 1596314369.0}, {"subreddit": "politics", "text": "This is why we need to help spread and support organizations like the [Lincoln Project](https://lincolnproject.us/) to stop trumpism from hurting more people.", "time": 1596313858.0}, {"subreddit": "politics", "text": "This is why you need to vote", "time": 1596313466.0}, {"subreddit": "politics", "text": "I wonder if his [supporters](https://www.wzzm13.com/mobile/article/news/local/absentee-ballot-application-protest/69-d2a6c00b-ea74-4813-ade5-533d8d7d1a0a) are gonna burn the ballots again instead.", "time": 1596311159.0}], "republican_score": 0, "democrat_score": 19}