{"name": "mackinoncougars", "posts": [{"subreddit": "politics", "text": "Any other president this would be an article of impeachment.", "time": 1607204997.0}, {"subreddit": "democrats", "text": "They’ll still keep voting for Republicans. I have no doubts.", "time": 1607201847.0}, {"subreddit": "politics", "text": "Reminder journalism is important to democracy. The facists want the WH to control the media, a free press is vital.", "time": 1607176183.0}, {"subreddit": "politics", "text": "https://www.reddit.com/r/TheMajorityReport/comments/jxeiq2/rudy_giuliani_smears_snot_all_over_his_face/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "time": 1607175477.0}, {"subreddit": "politics", "text": "More so profiting off of them...", "time": 1607174381.0}, {"subreddit": "politics", "text": "Don’t skip out on the smearing boogers all around his face.", "time": 1607174132.0}, {"subreddit": "politics", "text": "Legalized marijuana depends on you voting democrat. Mitch will not send this to vote.", "time": 1607121056.0}, {"subreddit": "politics", "text": "And she said it saying that’s why we need to require photo IDs... the dumbest, craziest and most bigoted people.", "time": 1607113594.0}, {"subreddit": "politics", "text": "The biggest fight is the endlessly growing population.", "time": 1607105551.0}, {"subreddit": "politics", "text": "He’s also got some pretty bigoted views. Not shocking.\n\n> At a Republican National Coalition for Life luncheon Holtz fervently spoke out against the “invasion” of immigrants in the United States, saying that immigrants need to better assimilate to the United States and, well, “become us.”\n\n> “I don’t want to become you,” he said, as reported by The Daily Beast. “I don’t want to speak your language, I don’t want to celebrate your holidays, I sure as hell don’t want to cheer for your soccer team!”", "time": 1607091036.0}, {"subreddit": "politics", "text": "Neckbeard says it all.", "time": 1607090550.0}, {"subreddit": "politics", "text": "To indoctrinate on all their platforms. Push extremism.", "time": 1606878412.0}, {"subreddit": "politics", "text": "These Republicans sound so silly and it’s so sad any audience sees this as something other than a childish farce. It’s like a bad improve theatre troupe saying buzzwords they are told to say.", "time": 1606878344.0}, {"subreddit": "politics", "text": "I don’t care about in fighting. Literal drama for drama’s sake.", "time": 1606876030.0}, {"subreddit": "politics", "text": "He’s no fan of Trump.", "time": 1606876001.0}, {"subreddit": "politics", "text": "States are outlawing abortion. “States rights” are never the answer to civil rights. Segregation would still be on full display in the Deep South if we followed your mentality. Couldn’t disagree more.", "time": 1606498831.0}, {"subreddit": "politics", "text": "If he respected the First Lady he wouldn’t cheat on her with pornstars and “move on” married women.", "time": 1606490114.0}, {"subreddit": "democrats", "text": "Church over state. If human sacrifice was a religious tradition they would rule in favor of the church to do so.", "time": 1606448814.0}, {"subreddit": "politics", "text": "Church over state! Laws will mean nothing because religion will not answer to the government.", "time": 1606411693.0}, {"subreddit": "politics", "text": "There is no separate of church and state in America. It’s church over state.", "time": 1606398466.0}, {"subreddit": "politics", "text": "One has a FOX news job, the other will soon.", "time": 1606345507.0}, {"subreddit": "politics", "text": "I’m sure he’ll have a FOX gig, on right after Ollie North.", "time": 1606345475.0}, {"subreddit": "politics", "text": "Trump now sharing Randy Quid tweets. The guy who fled to Canada and had a conspiracy that hit men from Rupert Murdoch were out to get him. Who, somehow is a huge right wing Trumper despite the whole Murdoch thing...", "time": 1606315690.0}, {"subreddit": "politics", "text": "Disappointed in all the Kentucky voters who picked this man as their leader.", "time": 1606261107.0}, {"subreddit": "democrats", "text": "People will forget, but she wouldn’t even live at the WH for the first 6 months. Unprecedented.", "time": 1606214268.0}, {"subreddit": "politics", "text": "Wisconsin GOP might be the most toxic in the country.", "time": 1606048098.0}, {"subreddit": "politics", "text": "Republicans sit quietly in support of Trump’s tear down of democracy.", "time": 1605966811.0}, {"subreddit": "politics", "text": "Republicans will always be shamelessly okay with their tactics.\n\n“Stop the steal” was a lie, they just wanted to create a steal of their own. Zero morals.", "time": 1605964042.0}, {"subreddit": "politics", "text": "Always vote out Republicans.", "time": 1605963846.0}], "republican_score": 0, "democrat_score": 3}