{"name": "strukout", "posts": [{"subreddit": "democrats", "text": "Lol, polls. LMAO", "time": 1607126577.0}, {"subreddit": "democrats", "text": "Not worth your energy", "time": 1607124256.0}, {"subreddit": "democrats", "text": "Why bother? EC was built to protect slavery, and the logistics of a true democratic voice in the 1800s.\n\nNow, tech enables us to take a stronger voice in our government. We should downsize the role of the republic and embrace direct voice on major issues/amendments, etc.", "time": 1606662269.0}, {"subreddit": "democrats", "text": "...and a few not so prominent Democrats, legal scholars, economists, and anyone in the space with a pulse", "time": 1606513574.0}, {"subreddit": "politics", "text": "This...bottom 5 states in education are deep red states.", "time": 1605663436.0}, {"subreddit": "democrats", "text": "For the record I DON’T like the Chiefs flag, mostly bc I’m jealous. \n\nHeck of a night for our country though!", "time": 1604884695.0}, {"subreddit": "democrats", "text": "Would the senate confirm?", "time": 1604786219.0}, {"subreddit": "democrats", "text": "Oh no, I started a horrible image, but somehow you made it worse...🤢", "time": 1604711259.0}, {"subreddit": "democrats", "text": "Yeah sorry, but here this picks me up every time:\n\nGeorgia:\nBiden 2,456,566\nTrump 2,452,569", "time": 1604711174.0}, {"subreddit": "democrats", "text": "Thanks for this", "time": 1604632961.0}, {"subreddit": "democrats", "text": "Cue TrumpTV", "time": 1604632425.0}, {"subreddit": "democrats", "text": "We have to accept there is a new major party, the Republican Nationalist. \n\nThis close election is going to permanently shift the GOP, bc they will see it as a clear path of win. GOP has shown they are willing to burn it down if they get to rule over the ashes.", "time": 1604582358.0}, {"subreddit": "politics", "text": "Hoping you are right, but I think it was called way to early by Fox and AP.\n\nA quick analysis: if Trump maintains 6:4 ratio of the most recent drop from Maricopa and Biden maintain his higher than Clinton performance, Trump would eek out 80k votes vs. Biden’s current lead of 79k!!! \n\nSo, decision desk at Fox and AP are smarter than me... so I sincerely hope there was a obvious exit poll or early vote analysis in play", "time": 1604546052.0}, {"subreddit": "politics", "text": "Herpes is better than aids, doesn’t make it good", "time": 1604267376.0}, {"subreddit": "politics", "text": "People are idiots... and most don’t pick up enough books or talk with those unlike them to learn empathy", "time": 1604267006.0}, {"subreddit": "politics", "text": "Lmao .. thank you", "time": 1604266775.0}, {"subreddit": "politics", "text": "I love how people say “never retire” in the absence of social security... anyone know want ads for a 75yo? There is no job market, they will be destitute, and growing old in America will once again mean Poverty like it was before the new deal.", "time": 1604266521.0}, {"subreddit": "politics", "text": "Or AZ, losing PA is not an electoral death knell, but likely indicates demographic trend across multiple states that are in play. \n\nAlmost feels like this will either be a landslide Biden win or a low margin Trump victory.", "time": 1604264574.0}, {"subreddit": "politics", "text": "Cause they’ll lose", "time": 1604264121.0}, {"subreddit": "politics", "text": "Yeah....welcome to the new “Banana” Republic; we look around the world and judge dictators and wonder how they come to power. \n\nRepublicans are making one right here at home", "time": 1604263984.0}, {"subreddit": "politics", "text": "Since when does the GOP need data to support anything. This party views data, science, and education general as something to look down on.", "time": 1604263593.0}], "republican_score": 0, "democrat_score": 11}