{"name": "1000000students", "posts": [{"subreddit": "democrats", "text": "CAP Action on Twitter--Just in case you forgot: Trump is the worst jobs president in American history.\n", "time": 1607219815.0}, {"subreddit": "politics", "text": "Tenants Sue Trump Over Scheme That Drove Up Their Rents\n", "time": 1607145253.0}, {"subreddit": "democrats", "text": "Steven Beschloss on Twitter--Over 3,100 deaths in a single day, over 276k deaths in total, and America doesn't have a president spending a single minute addressing this deadly nightmare.\n", "time": 1607141581.0}, {"subreddit": "democrats", "text": "Travis Akers on Twitter--Trump campaign’s star witness, Mellissa Carone, was on probation for a year for committing a computer crime court records reveal.\n", "time": 1607052391.0}, {"subreddit": "politics", "text": "Trump's corona virus lies were much worse\n\n15 cases it will be zero soon\n\nits like the flu\n\nIt;ll just disappear oone day", "time": 1607220205.0}, {"subreddit": "politics", "text": "Are you familiar with Randi Rhodes?? Reach out to her on twitter, she mentioned it i wasnt able to grab her source cuase i was movig aroud at the time--she's a dependable radio host--i will reach out as well", "time": 1607218893.0}, {"subreddit": "politics", "text": "lol yeah ...i didnt mention that", "time": 1607217939.0}, {"subreddit": "politics", "text": "see my profle for a fuller list that includes that story--its pinned to the top", "time": 1607148076.0}, {"subreddit": "politics", "text": "pinned to my profile are these points in a fuller list with  links\n\nthanks for the compliment--i do this cause republican governors cut education at everyturn and ppl are making the wrong decisions--its not a coincidence that the places where trump exceeded biden in the doble digits are places much lower on the education totem pole\n\ni believe  when people know better they do better", "time": 1607145928.0}, {"subreddit": "politics", "text": "DId you know that Trump Tower is a haven for crooks and foreign spies??\n\nKellyanne Conway\n\nPaul Manafort\n\nThe Saudis own the etir 45th floor --the irony\n\nBin Laden's half-brother, Shafiq Bin Laden, lived in an apartment in Trump Tower\n\nRussian Mafioso--Vadim Trincher, David Bogatin and Vyacheslav Ivankov.\n\n\nHelly Nahmad.  Owns the entire 51st floor of Trump Tower.\n\nPleaded guilty and received 12-month prison sentence in 2014 for operating an illegal, multi-million $ gambling business out of Trump Tower. Case tied to notorious Russian mafia \"boss of all bosses\" Semion Mogilevich\n\nVadim Trincher, former condo owner on 63rd floor of Trump Tower. Mastermind of Trump Tower gambling ring with Nahmad. 5 years in federal prison and $20 million in asset forfeiture for racketeering.\n\nJean Claude \"Baby Doc\" Duvalier. Haitian dictator, tied to death and torture of thousands of its citizens. Arrested upon return from exile and charged with embezzlement and human rights abuse.\nOwned a condo at Trump Tower valued at $2.5 million.\n\nFelix Sater. Worked in an office out of the 24th floor of Trump Tower and a Trump Org employee. Lead negotiations for Trump Tower Moscow and Trump Soho.\n\n15 months in prison for stabbing a man with a margarita glass. Also convicted in $40 million stock trading scheme.\n\n\nJoseph Weichselbaum. Trump's personal chopper pilot in the 1980s. Upgraded from 32nd floor Trump Tower apartment to adjoining 49th floor condos while he was serving federal sentence for smuggling cocaine out of Colombia via Miami.\nThe condos were paid for with all cash.\n\nAnatoly Golubchik and Michael Sall. Co-conspirators in the Trincher Trump Tower Gambling Ring. Golubchik was described as an enforcer for the group, collecting debts with threat of violence.\n\nBoth Golubchik and Sall forfeited their Trump Tower condos as criminal assets.\n\nTrump Tower Gambling Ring: They reported to Russian mob boss Alimzhan Tokhtakhounov, also charged with rigging figure-skating at the 2002 Olympics.\nSteven Hoffenberg. Leased office space on the 15th floor of Trump Tower mere months after the SEC sued him for operating the largest Ponzi scheme in American history until the Madoff scandal.\n\nNote on Hoffenberg: he's now in the news as he has alleged that Jeffrey Epstein amassed his own fortune during his role in the Towers Financial scheme. https://thedailybeast.com/did-jeffrey-epstein-help-steven-hoffenberg-swindle-dollar460-million-in-ponzi-scheme\n\nhttps://www.newsweek.com/trump-tower-criminal-tenants-thread-twitter-russian-mafia-renters-owners-1452138", "time": 1607145429.0}, {"subreddit": "politics", "text": "The lawyer of the pc shop owner is suig Rudy  Guiliani claimig the Rudy added the russian information to the computer and has gone into hiding", "time": 1607145037.0}, {"subreddit": "politics", "text": "i guess they asked Democrat Katie Hill to resign for the same reason-- i dont mean kinds the same reason i mean there were photos of her naked having consensual sex and smoking weed--the only difference was that hers was revege porn and she is a democrat", "time": 1607144618.0}, {"subreddit": "politics", "text": "a fuller list is pinned to my profile --if interested", "time": 1607143943.0}, {"subreddit": "politics", "text": "\"Everything toxic about the corporate Democratic Party is embodied in Neera Tanden,\" tweeted Briahna Joy Gray,\n\nALSO\n\n\nGray has stated that she voted for Jill Stein in the 2016 presidential election. After joining the Sanders campaign in March 2019\n\nNeera voted for Hillary in 2016--Wana guess who  voted for??--it wasnt Russian agent Jill Stein-- i votedd for the one who predicted every single thing Trumo would do if he won the presidency", "time": 1607143190.0}, {"subreddit": "politics", "text": "> Republicans are willing to commit crimes \n\nFormer U.S. Attorney Asks Georgia to Investigate Lindsey Graham for Potential Election Crimes Dec 3rd 2020", "time": 1607142855.0}, {"subreddit": "politics", "text": "Four weeks ago Hunter Biden was a suspect in an international criminal enterprise and now  Trump's 3 eledest children need pardons.\n\nSOLVED", "time": 1607142726.0}, {"subreddit": "politics", "text": "FUN FACTS\n\nWhere did Matt Gaetz come up with all that money to run for congress? The obvious suspect was his dad. It would have been illegal for Don Gaetz to lend six figures to the campaign, but he appears to have found another way to funnel money to his son’s race.Matt Gaetz sold a house he owned for just under $100,000. Three months later, he sold several vacant lots he’d bought years earlier. All of Gaetz’s real estate was purchased by the same buyer: a company called Treveron, which, it turns out, is owned by his dad.\n\nAND\n\nHouse Speaker Ray Sansom, a friend of Don Gaetz for whom Matt had worked as a legislative aide during law school. In April 2009, Sansom was indicted on corruption charges, accused of tweaking the state budget to funnel more than $25 million to Northwest Florida State College in Niceville. Of those funds, $6 million was earmarked to build a hangar at the Destin airport for a jet company owned by one of Sansom’s friends and donors, real estate developer Jay Odom. Odom was also a client of Matt Gaetz, who handled Odom’s hangar lease. (In 2013, Odom would be sentenced to six months in prison for illegally funneling $23,000 into former Arkansas Gov. Mike Huckabee’s failed 2008 presidential campaign. In the past decade, Odom has contributed thousands of dollars to Gaetz’s political campaigns\n\nAND\n\nMatt Gaetz co-sponsored bill to abolish the department of education \n\nAND\n\nU.S. Rep. Matt Gaetz accused of creating sex game with 'points' for sleeping with staff https://www.sun-sentinel.com/news/politics/fl-ne-gaetz-latvala-twitter-20200114-hrbeklwtxnbvfnbwvu57nlxvpy-story.html\n\nThe rest i'll save for later", "time": 1607142506.0}, {"subreddit": "politics", "text": "LOLGOP\n\nJuly 19, 1992\n\n\n\n\n″Congressman Newt Gingrich bounced 22 checks\n\n″For more than 26 grand.", "time": 1607051576.0}, {"subreddit": "politics", "text": "Misleading-----> Mitch Mcconnell's propsal excluded Covid relief", "time": 1607051118.0}, {"subreddit": "politics", "text": "In case you  missed it America has been much worse off under Trump in all areas\n\nThere were less jobs --1.5 million less created in his first 3 years 2017 , 2018 and 2019 than Obama'a last 3--2014, 2015, 2016\n\n\nMexico did not  pay for a wall and less that 30 miles of new construction--some of which is falling into the Rio Grande and blowing over in the Sanat Ana winds\n\n260,00 Americans are dead 12 milllion are infected\n\nmore coal plants shut down under Trump's 4 years than Obama's 8\n\nThere is more industrial pollution in the ground water and sol--more kids with birth defects on the horizon\n\nThe recession started in February--before the pandemic\n\nOur allies no longer trust us\n\nThe largest trade pac this year did not include America", "time": 1606961318.0}, {"subreddit": "politics", "text": "like 50 days--5 Scaramuccis", "time": 1606960840.0}, {"subreddit": "politics", "text": "> She says it like everybody is going out and looting.\n\nMinnesota Officials Link Arrested Looters to 'White Supremacist'\n\nMan who helped ignite George Floyd riots identified as white supremacists", "time": 1606960595.0}, {"subreddit": "politics", "text": "The parents of White House Press Secretary Kayleigh McEnany received between $1 to $2m in Paycheck Protection Program money for their roofing company, according to Small Business Association data.\n\nThough the PPP loans were intended to help very small businesses – generally those with 10 or fewer employees – businesses such as those of Ms McEnany’s parents, which appears to employ 131 people, have also received the money.\n\nSO SHE AnD HER PARENTS ARE GOING --to Melania's party", "time": 1606960362.0}, {"subreddit": "politics", "text": "They know they are gonna be in court for ages--They also know that they need good lawyers,  Which is why they are fleecing their followers \n\n\nTrump bilks $170 million from supporters to fund suits—but his PAC pockets most of the cash\nhttps://www.salon.com/2020/12/01/trump-bilks-170-million-from-supporters-to-fund-suitsbut-his-pac-pockets-most-of-the-cash-report/", "time": 1606959273.0}, {"subreddit": "politics", "text": "She is better known as Kremlin Barbie\n\nA--- FBI has been looking into the negotiations and financing surrounding Trump International Hotel and Tower in Vancouver, tHAT TRUMP TOWER CLOSED FOR GOOD IN OCTOBER--Did you kow that?\n\nB- Alleged fraudster in Panama, working with Ivanka, helped make Trump's first international hotel venture a success. The broker was in business with a money-launderer and two criminals from the former Soviet Union-- Russia Russia Russia. Then he fled.  TRUMP HOTEL PANAMA KICKED THE TRUMP'S OUT OF BUSINESS BECAUSE OF TRUMP FRAUD IN 2018--The Trump Crime Family Made Millions from Drug Cartels and the Russian Mafia in Panama City\n\nC--Ivanka Trump’s ex-business partner ensnared in federal fraud probe\n\nD---Ivanka's Diamond business was  embroiled in alleged fraud\n\nE--Chilean billionaire rented home to Jared Kushner and Ivanka Trump then got permission for mine\n\nG--Jared Kushner, Ivanka Trump use private email servers\n\nH--Ivanka and Jared both failed to get security clearances-Jared lied on his application 135 times--he revised and lied on the forms 135 times--lying once is a felony \n\nI- Ivanka—who purportedly closed her business in 2018 to avoid further conflicts of interest—was somehow still reporting income from her company in 2019. The American people deserve an “explanation as to how a business can both cease all operations and still be making her as much as a million dollars a year,”\n\nK--She was busted for stealing from a chsirtyand has been barred from serving by the State of NY on ay boards for like 19 years i  think--plus she had to take classes on how not to steal from a charitty\n\nL--Her clothing business --when it was open copied other desiger's styles and sold then under her name--i think there were lawsuits\n\nSHE IS A FELON", "time": 1606957254.0}, {"subreddit": "politics", "text": ">  think your position would be stronger \n\n\nThis is about science not whether when can assuage a virus with originalist goobly gook--a gathering inside a church or mall etc can have dire consequences, the basic fact that people are expelling a lot of hot air\" makes matters worse inside houses of worship\n\nAmerica has 4 percent of the worlds population and the raw data most amount of deaths and infections and red states with similar ideologies to Gorusch and Amy Covid Barrett are leading the way..and i can see why\n\nExpect no further responses", "time": 1606881350.0}, {"subreddit": "politics", "text": "I stated the facts of the case and have no interest in being distracted from just that, Thank you for stopping by", "time": 1606880981.0}, {"subreddit": "politics", "text": "Very Rich Betsy DeVos Has 10 Boats, Two Helicopters, A Yacht Scheduler\n\nhttps://www.newsweek.com/can-you-afford-betsy-devoss-lavish-lifestyle-708369", "time": 1606880592.0}, {"subreddit": "politics", "text": "Gorsuch's \"science\"  is wrong and he uses his twisting of scientific fact to make his conclusions--I have never been to a liquor store or bike shop where people sing together episodically for a hour or more as well, expelling droplets into the air around them And a large number of people in an indoor gathering offer more vectors of transmission among each other than do a few people in a shop. And thus present a greater epidemiological risk to their communities and not just themselves\n\nThere was no need to tie the hands of officials who are seeking to save lives in the midst of a public health crisis. Especially when one defines oneself as Pro-life--what a fking joke", "time": 1606880073.0}, {"subreddit": "politics", "text": "umm no\n\nPope FFrancis Blasts Those Who Criticize COVID Restrictions in the Name of “Personal Freedom”--published less than a day after the Supreme Court struck down restrictions on religious services that had been put in place due to the pandemic.\n\nPope Francis was seriously ill with pneumonia while he was a young man studying for the priesthood. “I have some sense of how people with COVID-19 feel as they struggle to breathe on a ventilator,” he said. As he has detailed before, Francis wrote about how he made it through thanks to nurses who understood his illness better than doctors and increased his dosage of antibiotics and painkillers. “They taught me what it is to use science but also to know when to go beyond it to meet particular needs,” he wrote. “", "time": 1606878961.0}, {"subreddit": "democrats", "text": "True--but--pardoning Flynn to hide his corruption can complicate that", "time": 1606875895.0}, {"subreddit": "democrats", "text": "> Trump could’ve done the same to Hillary\n\nCept there was no wrongdoig as far as Hillary was concerned\n\nWith Trump there is\n\nTrump can't pardon State crimes.", "time": 1606875707.0}, {"subreddit": "politics", "text": "i give this 1 week before there are verified claims of \n\ngrift and fraud\n\nRacist threats of violence against people of color\n\nMisogynistic statements or tweets\n\nTV interviews gone off the rails\n\nA Corona Virus outbreak\n\nEssetially a day in the life of the republican party", "time": 1606798383.0}, {"subreddit": "politics", "text": "Reminder\n\nRepublican Senator Graham pressured Georgia secretary of state to throw out legally cast ballots https://www.washingtonpost.com/politics/brad-raffensperger-georgia-vote/2020/11/16/6b6cb2f4-283e-11eb-8fa2-06e7cbb145c0_story.html", "time": 1606794633.0}, {"subreddit": "politics", "text": "Please explain how Lindsey Graham has not resigned after he asked the state’s secretary of state about the possibility of throwing out legal ballots in Georgia? And more importantly how is he chairing the Senate committee that oversees our justice system?", "time": 1606794497.0}, {"subreddit": "politics", "text": "Florida Republican Gov. SeSantis pursues coronavirus herd . MANY WILL DIE", "time": 1606792523.0}, {"subreddit": "politics", "text": "AFTER--the Iranian was killed..interesting", "time": 1606791093.0}, {"subreddit": "politics", "text": "Time to head back to answering the phones at your dad's roofing compay--hired not becuase of skill but becuase she looked like ivanka", "time": 1606789984.0}, {"subreddit": "politics", "text": "Controversy", "time": 1606788791.0}, {"subreddit": "politics", "text": "Wot?", "time": 1606788579.0}, {"subreddit": "politics", "text": "This is where i would start for an investigation into Trump", "time": 1606788030.0}, {"subreddit": "politics", "text": "Where have you been for the last 4 years?\n\nNoticing this now after that bunch kidnapped and caged 70,000 kids while calling themselves kkkristian \n\nIs this a satirical article?", "time": 1606787863.0}, {"subreddit": "politics", "text": ">  outraged by the dumbest shit.\n\nThat should be the tagline we brand Fuks with, Not fair and balanced but\n\nOutraged by the dumbest shit.", "time": 1606786608.0}, {"subreddit": "politics", "text": "LOLGOP--Mitch McConnell is the sole reason this country does not have COVID19 relief. Not \"congresss\", not \"both sides\"...just MITCH.", "time": 1606786291.0}, {"subreddit": "politics", "text": "Dr. Scott W Atlas has expertise in Strokes--No experience in pandemics\n\nTrump has been accused of hiding a stroke that may have caused an emergency Trip to Walter Reed a year ago,", "time": 1606785824.0}, {"subreddit": "democrats", "text": "bingo", "time": 1606784151.0}, {"subreddit": "politics", "text": "South Dakota nurse says many dying patients still insist COVID-19 'not real'\n\nYEAH-Some are beyond dumb\n\nAll those cuts to education by republican governors inorder to pay for tav cuts for the rich are bearing fruit", "time": 1606701708.0}, {"subreddit": "politics", "text": "it might be--becuase the pardon --issued by Trump involved coverig up a crime instigated by Trump ad was done to protect the orage overlord..ad if a lawyer could prove sedition or somethig approaching treason..well then it could get real iteresting for both of them\n\nbut --am not a lawyer\n\nbut on twitter ask Lwrence Tribe, Glenn Krischer, or Joyce Vance might be much more helpful", "time": 1606699319.0}, {"subreddit": "politics", "text": "NO--the difference is the ruling in Louisana was before Amy Covid Barrett and now the superspreader--a term once reserved for Melania--has found her way to scotus\n\nThe handmaiiden is here everyone", "time": 1606612083.0}, {"subreddit": "democrats", "text": "Generally violence is only 7 percent effective when it comes to gov't changes-------///non-violent approaches like protests have been historically better", "time": 1606610997.0}, {"subreddit": "politics", "text": "lol --its the law and yes", "time": 1606610416.0}, {"subreddit": "democrats", "text": "No--firstly its meaning was distorted---most people leave out the well regulated militia portion--aka the national guard-- a force thats background checked and trained\n\nNot a bunch of wife beaters runnung around in camo shooting people of color and kids in school", "time": 1606609025.0}, {"subreddit": "politics", "text": "But that is exaclty what Alito is allowing in New York--\n\n Supreme Court blocks NY from enforcing Covid limits on churches. The court said the restrictions violate religious freedom and are not neutral--Supreme Court Blocks Covid-19 Restrictions on Religious Services in New York\nJustice Amy Covid Barrett--OR-- 1 case Amy-- cast the pivotal vote to depart from past cases--Alito joined in-- Court blocked New York from imposing strict limits on attendance at religious services to combat Covid-19,", "time": 1606605534.0}, {"subreddit": "politics", "text": "Trump in 2016 considered Pence a 'loser,' says a former top campaign official\n\n“Why would I want a guy like that to be my VP?” Trump said when his then-campaign manager Paul Manafort pushed to have Pence, then governor of Indiana\n\nIn the spring of 2016 polls showed Pence was 10 points behind in his bid to win reelection as governor.", "time": 1606604580.0}, {"subreddit": "politics", "text": "> may be white about them.\n\nha", "time": 1606603896.0}, {"subreddit": "politics", "text": "The illegitimate Robert's court has never met a voter rsuppression tactic they haven't fallen in love with\n\nRepublican installed Chief Justice John Robert's=There is not enough racism to justify the voting rights act--- June 2013\n\n\n2020--Trump is actively spending millions of dollars --tens of millions to throw out the legally cast votes of Afircan Americans because he believes that black people are 3/5s of a human being", "time": 1606603873.0}, {"subreddit": "politics", "text": "Flynn plead guilty TWICE--under oath\n\nFlynn’s lies mattered because they may have concealed a deal between Trump and Russia over sanctions. Keep in Mind Trump himself was not yet the American President and had no authoirty to make policy on behalf of the American people either\n\nALSO\n\nOn Election Day in 2016, Flynn wrote an op-ed in The Hill criticizing cleric Fethullah Gulen, an enemy of Turkey's president living in self-imposed exile in Pennsylvania, as a \"radical Islamist\" and \"shady Islamic mullah.\" The Wall Street Journal later reported that Flynn and his son twice met with Turkish representatives to discuss kidnapping Gulen and forcibly extraditing him to Turkey\n\nNot forgetting\n\nCongressional Republican report says Flynn went to infamous Russian spymaster’s house for ‘very productive’ 2015 meeting\n\nAdmission of Guilt\n\nFlynn admitted that he had lied to the FBI about his conversations with Kislyak, and that he also had lied to agents about his efforts to influence foreign diplomats regarding a December 2016 UN resolution condemning Israeli settlement construction. He also admitted that he had lied to the Justice Department in a Foreign Agents Registration Act filing by claiming he was not aware he was lobbying for Turkey", "time": 1606603222.0}, {"subreddit": "politics", "text": "Republican PA Senator Mastriano Censored by Twitter Over Voter Fraud Concern\n\nIdiot", "time": 1606601653.0}, {"subreddit": "politics", "text": ">  Twitter does actually ban people for not following their rules\n\nthey created a special class for Trump and havent baned him or his spawn...sooo", "time": 1606601262.0}, {"subreddit": "politics", "text": "THIS --RIGHT HERE", "time": 1606601217.0}, {"subreddit": "politics", "text": "There’s no tradeoff between COVID and the economy, and no way to get the economy back until COVID is under control. \n\nShutdowns are only viable if accompanied by disaster relief so Americans can survive financially.\n\n\nDemocrats passed the Heroes act in the Middle of May this year 2020. Since then Republicans have jeered at it, ignored it, went on vacation for an entire month--4 weeks- in August, Confirmed several unqualified \"teenaged\" judges, Confirmed Amy Covid Barrett to the Supreme court who just ruled that mass gatherings at churches are okay in new york, They have gone to superspreader events at the whitehouse, Taken time for thanksgiving break this week but refuse to vote to help the people who pay their salaries\n\nMeanwhile there are 4 mile long lines for food banks in Arizona and Texas and ohio", "time": 1606585982.0}, {"subreddit": "politics", "text": "The law punishes hacking under the computer crime statutes. ... The law also punishes unauthorized access to a computer or computer network, with penalties ranging from a class B misdemeanor to a class D felony (punishable by up to five years in prison, a fine of up to $5,000, or both)", "time": 1606584828.0}, {"subreddit": "politics", "text": "I think twitter will create a special category for Trump after he leaves office to allow him to continue this nonsense\n\nFacebook is allowing 'Banon to stay active after he called for the beheading of Fauci--bet anyone here doing the same wont last an hour and wull probably get a visit from the FBI and be on the no-fly list\n\nNever underestmate the willingness of white men to cover for other white men--while pointing and yeaaalling ---\"Criminal\"-- to people of color", "time": 1606584743.0}, {"subreddit": "politics", "text": "17 year old white man used covid stimulus money to buy a gun, then got driven cross border in the middle of a pandemic by his MOTHER , defying dual state lockdowns to kill 2 individuals and injure at least 1--the left the scene of the murder to go home ad sleep i his own bed, walking right past the police--who earlier had hi-fived him\n\nTHAT IS THE PERP YOU BAILED OUT", "time": 1606433834.0}, {"subreddit": "politics", "text": "To stop the program that he forced them to start\n\nMeanwhile\n\nU.S. shared nuclear power info with Saudi Arabia after Khashoggi killed--LAST I CHECKED OF THE 19 911 HIJACKERS 17 WERE SAUDI --Zero were Iranian\n\nAttacking Iran on any level would drive up oil prices and enrich Russia--it is their main export", "time": 1606433576.0}, {"subreddit": "politics", "text": "Thanksgiving Celebrations Could Double U.S. COVID-19 Death Rate to 4,000 a Day, Professor Predicts\n\n\nTrump: 'We're going to win so much, you're going to be so sick and tired of winning'. May 26, 2016.", "time": 1606433392.0}, {"subreddit": "politics", "text": "No one disrespects the troops more than Trump\n\nRight now he is junking a treaty—and 2 planes multi-million dollar planes—designed to stop nuclear war\n\nSYRIA\n$4.1 Million in U.S. Military Gear Unaccounted for in Syrian War, Some Due to Trump's 'Unexpected Withdrawal'--left behind for \nRussia", "time": 1606433288.0}, {"subreddit": "politics", "text": "> Trump is just playing 4D chess \n\nWould not surprise me if Trump doenst know how to play checkers--the man is a fking idiot--he does excel in scams though", "time": 1606431453.0}, {"subreddit": "politics", "text": ">  Trump’s “delivered” absolutely zilch on anything pandemic-related\n\nNOT TRUE!!\n\nTrump delviered misinformation\n\nFrom COVID-19 to voting: Trump is nation's single largest spreader of disinformation, studies say https://www.usatoday.com/story/tech/2020/10/05/trump-covid-19-coronavirus-disinformation-facebook-twitter-election/3632194001/\n\nAND\n\nTrump campaign rallies led to more than 30,000 coronavirus cases, Stanford researchers say  SAT, OCT 31 2020 CNBC\n\nTHESE THINGS ARENT NOTHING--THEY ARE TANGIBLE AND MEASURABLE!! Give the man some credit", "time": 1606416820.0}, {"subreddit": "politics", "text": "The Health and Economic Recovery Omnibus Emergency Solutions Act or Heroes Act (H.R. 6800) is proposed legislation acting as a $3 trillion stimulus package in response to the COVID-19 pandemic, and is intended to supplement the earlier CARES Act stimulus package.\n\n\nprovides FY2020 emergency supplemental appropriations to federal agencies;\n\nprovides payments and other assistance to state, local, tribal, and territorial governments;\n\nprovides additional direct payments of up to $1,200 per individual;\n\nexpands paid sick days, family and medical leave, unemployment compensation, nutrition and food assistance programs, housing assistance, and payments to farmers;\n\nmodifies and expands the Paycheck Protection Program, which provides loans and grants to small businesses and nonprofit organizations;\n\nestablishes a fund to award grants for employers to provide pandemic premium pay for essential workers;\n\nexpands several tax credits and deductions;\n\nprovides funding and establishes requirements for COVID-19 testing and contact tracing;\n\neliminates cost-sharing for COVID-19 treatments;\n\nextends and expands the moratorium on certain evictions and foreclosures; and\nrequires employers to develop and implement infectious disease exposure control plans.\n\nThe bill also modifies or expands a wide range of other programs and policies, including those regarding\n\nMedicare and Medicaid,\n\nhealth insurance,\n\nbroadband service,\n\nmedical product supplies,\n\nimmigration,\n\nstudent loans and financial aid,\n\nthe federal workforce,\n\nprisons,\n\nveterans benefits,\n\nconsumer protection requirements,\n\nthe U.S. Postal Service,\n\nfederal elections,\n\naviation and railroad workers, and\n\npension and retirement plans.\n\n\nDemocrats passed the Heroes act in the Middle of May this year 2020. Sice then Republicans have jeered at it, ignored it, went on vacation for an entire month--4 weeks- in August, Cofirmed several unqualified \"teenaged\" judges, Confirmed Amy Covid Barrett to the Supreme court, Gone to suprspreader events at the whitehouse, Taken time for thanksgiving break\n\nMeanwhile there are 4 mile long lines for food banks in Arizona and Texas and ohio", "time": 1606416513.0}, {"subreddit": "politics", "text": "> PPP\n\nRemember whe Trump didnt know what the TPP was and he stupidly thought someone said PPP--What the heck did we bring on ths country??", "time": 1606414470.0}, {"subreddit": "politics", "text": "Here comes that Trump pardon", "time": 1606412632.0}, {"subreddit": "politics", "text": "fking AMY COVID BARRETT", "time": 1606408444.0}, {"subreddit": "politics", "text": "> By February 1st, there was no way to know we would have the diease hit us this way\n\n\nYET TRUMP WARNED ISRAEL AT THAT TIME--AND NOW THAT WE KNOW HOW DANGEROUS IT IS ...WHAT HAS HE DONE EXCEPT MADE IT WORSE", "time": 1606270791.0}, {"subreddit": "politics", "text": "The reason the larger Republican Party isn't pushing back is that they largely agree with this underlying argument that African -Americans are 3/5ths of a human being and should not have the right to vote--Republican appointed -John Roberts of the Supreme Court said in 2014, That there wasnt enough racism to justify the voting rights act\n\nRepublicans appreciate the idea that voters in certain areas — notably, cities where Black people outnumber white people — shouldn't really have the right to vote. --\n\nThis core belief of Republicans is especially evident in their enthusiasm for voter suppression--PRIOR TO TRUMP--LIKE ALABAMA CLOSING 30 DRIVERS LICENSES OFFICES IN BLACK DISTRICTS\n\nTrump's post-election attack on areas where minoroties live have served to de-legitimze those folks--Apparently they were all born in KENYA--And republicans --they love it more than Chick-Fil-A", "time": 1606223047.0}, {"subreddit": "politics", "text": ">  Secondhand marijuana smoke is a lot like tobacco smoke \n\nexcellent....HOW ABOUT THE POPO ARESSTING PPL FOR CIGARETTES", "time": 1606222952.0}, {"subreddit": "politics", "text": "> We didn't know how bad it was by February 1st, and we do know the flu is always bad\n\nWRONG\n\nTrump knew about coronavirus' severity in January ...\n\naD THAT IS ON TAPE AND HAS BEE PLAYED MULTIPLE TIMES BY bOB wOODWARD", "time": 1606222878.0}, {"subreddit": "politics", "text": "there have been 2 know White House outbreaks and they  are planning a christmas party ...so..YES\n\nTrump Plague", "time": 1606222729.0}, {"subreddit": "politics", "text": "“Protect and Serve” Is Just a Motto\n\nWhen the Los Angeles Police Department had a contest in Feb. 1955 to select a motto for the department, officer Joseph S. Dorobek submitted the winning slogan that has since been adopted by many police forces: “To Protect and to Serve.” \n\nSmoking marijuana does not inflict direct harm upon another person--police officers should assess if they are protecting and serving anyone when they stop a consenting adult from partaking in a nonviolent act. Without a victim, there is no one to resist the activity, and no one to file a complaint. To threaten or use force against a nonviolent, consenting adult if they do not comply with arrest can only result in a miscarriage of justice.", "time": 1606194153.0}, {"subreddit": "politics", "text": "ITS ABOUT TME--to take Trump's losses off the front pages ad use Amerca's soldiers to do so\n\nWATCH THE MEDIA GO ALONG WITH THIS NONSESE\n\nOil prices will shootup--its Russia's only export outside of steroids and prostitues and Americans will once again pay", "time": 1606193802.0}, {"subreddit": "politics", "text": "That place is a haven for crooks and foreign spies\n\nKellyanne Conway\n\nPaul Manafort\n\nThe Saudis own the etir 45th floor --the irony\n\nBin Laden's half-brother, Shafiq Bin Laden, lived in an apartment in Trump Tower\n\nRussian Mafioso--Vadim Trincher, David Bogatin and Vyacheslav Ivankov.\n\n\nHelly Nahmad.  Owns the entire 51st floor of Trump Tower.\n\nPleaded guilty and received 12-month prison sentence in 2014 for operating an illegal, multi-million $ gambling business out of Trump Tower. Case tied to notorious Russian mafia \"boss of all bosses\" Semion Mogilevich\n\nVadim Trincher, former condo owner on 63rd floor of Trump Tower. Mastermind of Trump Tower gambling ring with Nahmad. 5 years in federal prison and $20 million in asset forfeiture for racketeering.\n\nJean Claude \"Baby Doc\" Duvalier. Haitian dictator, tied to death and torture of thousands of its citizens. Arrested upon return from exile and charged with embezzlement and human rights abuse.\nOwned a condo at Trump Tower valued at $2.5 million.\n\nFelix Sater. Worked in an office out of the 24th floor of Trump Tower and a Trump Org employee. Lead negotiations for Trump Tower Moscow and Trump Soho.\n\n15 months in prison for stabbing a man with a margarita glass. Also convicted in $40 million stock trading scheme.\n\n\nJoseph Weichselbaum. Trump's personal chopper pilot in the 1980s. Upgraded from 32nd floor Trump Tower apartment to adjoining 49th floor condos while he was serving federal sentence for smuggling cocaine out of Colombia via Miami.\nThe condos were paid for with all cash.\n\nAnatoly Golubchik and Michael Sall. Co-conspirators in the Trincher Trump Tower Gambling Ring. Golubchik was described as an enforcer for the group, collecting debts with threat of violence.\n\nBoth Golubchik and Sall forfeited their Trump Tower condos as criminal assets.\n\nTrump Tower Gambling Ring: They reported to Russian mob boss Alimzhan Tokhtakhounov, also charged with rigging figure-skating at the 2002 Olympics.\nSteven Hoffenberg. Leased office space on the 15th floor of Trump Tower mere months after the SEC sued him for operating the largest Ponzi scheme in American history until the Madoff scandal.\n\nNote on Hoffenberg: he's now in the news as he has alleged that Jeffrey Epstein amassed his own fortune during his role in the Towers Financial scheme. https://thedailybeast.com/did-jeffrey-epstein-help-steven-hoffenberg-swindle-dollar460-million-in-ponzi-scheme\n\nhttps://www.newsweek.com/trump-tower-criminal-tenants-thread-twitter-russian-mafia-renters-owners-1452138", "time": 1606193229.0}, {"subreddit": "politics", "text": "You know all those \"Never Forget\" things that republicans cling to and tur into scadals when they should be teachable moments or in some cases nuttin burgers like emails\n\n\n\nNEVERFORGET\n\nMore than 130 Secret Service officers are said to be infected with coronavirus or quarantining in wake of Trump’s campaign travel\n\nTRUMP'S ABSOLUTE CARLESSNESS\nNever forget him forcing Secret Service agents to ride aroud i a sealed vehicle with him 2 days after he tested covid positive--to wave to his proud boys fans", "time": 1606191784.0}, {"subreddit": "politics", "text": "A New Covid Outbreak at the White House \nOct 26, 2020\n\nCoronavirus Infections in Trump's Inner Circle\nNov 11, 2020 \n\nWhy not round out the year with more infections in December", "time": 1606191257.0}, {"subreddit": "politics", "text": "When we did the opposite the country did well--real well--Clinton--Obama and hopefully Biden\n\nWhen we followed him we got Bush Jr and Trump--both of whom killed thousands and hundreds of thousands of Americans and crashed expading economies they inherited", "time": 1606190272.0}, {"subreddit": "politics", "text": "Yeah--the pope just came out in support of gayi arriage and civil unions\n\nI have my own suggestion for some of these men if they want a better planet--Stop showing your penises on America's playgrounds", "time": 1606189879.0}, {"subreddit": "politics", "text": "immunty from prosecution for killing 250,000 Americans\n\nRaiding the taxcoffers by charging taxpayers hundreds of millions to play golf every weekend\n\n\nTwitter and facebook immunity", "time": 1606189295.0}, {"subreddit": "politics", "text": "The Civil War ended 154 years ago. The Confederacy was on the wrong side of humanity --Our public entities should no longer play a role in distorting history by honoring a secessionist government that waged war against the United States to preserve white supremacy and the enslavement of millions of people.\n\nIt’s past time for the South – and the rest of the nation – to bury the myth of the Lost Cause once and for all. \n\nWhy the fck should the tax money from hard working black people go towards maintaining the false history of those who sought to lynch them??", "time": 1606189188.0}, {"subreddit": "politics", "text": "LOLGOP--THE IRONY\n\nRush Limbaugh was wrong about Sarah Palin's fitness for office\n\nRush Limbaugh was wrong about Obama Exploding the deficit\n\nRush Limbaugh was wrong Obama not being a citizen\n\nRush Limbaugh was wrong about Obama destroying the economy\n\nRush Limbaugh was wrong about pushing the narrative that the country needed to impeach Bill Clinton\n\nRush Limbaugh was wrong about Reagan Economics--we had 2 big recessions under Reagan'\n\nRush Limbaugh was wrong that George Bush would give us a great economy--We had the worst recession since the great depression\n\nRush Limbaugh was wrong of there being Weapons of mass destruction In Iraq\n\nRush Limbaugh was wrong that we would be greeted as liberators in Iraq\n\nHowever, Its is not Rush Limbaugh's job to the right--it is Rush Limbaugh's job to get every single low white information American to vote to fuck themselves--to vote to poison the air, the water, the soil. It is Rush Limbaugh's job to get these low information gun totin guys who call themselves patroits to vote for politicians who take money away from kids, older Americans and disabled persons because that rich guy needs a bigger yatch, That is Rush Limbaugh's job, His singular purpose in life...AND HE IS GOOD AT IT", "time": 1606188676.0}, {"subreddit": "politics", "text": "my thoughts exactly--no wonder tesla is makinng money", "time": 1606188536.0}], "republican_score": 0, "democrat_score": 8}