{"name": "General-Freedom4632", "posts": [{"subreddit": "democrats", "text": "How did Biden still win?\n", "time": 1606021798.0}, {"subreddit": "democrats", "text": "Question about trump masks\n", "time": 1603849475.0}, {"subreddit": "democrats", "text": "The perfect gift for my trump supporter friends", "time": 1607089972.0}, {"subreddit": "democrats", "text": "I said merry Christmas on a zoom call yesterday and seal team six busted down my door and shot me like osama", "time": 1607060474.0}, {"subreddit": "democrats", "text": "I love this response. It isn’t my job to tell a women what she can or can’t do with her body", "time": 1606768422.0}, {"subreddit": "democrats", "text": "Trumps presidency is dead so I think that falls on number 3", "time": 1606709608.0}, {"subreddit": "democrats", "text": "Still way too many people voted for trump", "time": 1606341395.0}, {"subreddit": "democrats", "text": "I can’t either especially with all that’s happened in the last year", "time": 1606254123.0}, {"subreddit": "democrats", "text": "The trump administration has given up on “dealing” with the pandemic. It seems like they plan on passing the Biden administration a bomb.", "time": 1605996635.0}, {"subreddit": "democrats", "text": "I voted for trump out of fear. I was scared of Clinton winning. My family is super Republican I guess a bit of that had stuck with me and I never even had thought about voting democrat. Going off my family I lived in a rural very white Republican area. I was only 18 and never had to work for much. I hadn’t been out in the “real world” I had a false sense of reality", "time": 1605931241.0}, {"subreddit": "democrats", "text": "I guess I didn’t think he would be that bad for whatever reason. I didn’t really have a good reason other than fear of Clinton winning", "time": 1605931095.0}, {"subreddit": "democrats", "text": "I agree any mail in ballots for biden is fraud!!!! /s", "time": 1605918678.0}, {"subreddit": "democrats", "text": "STOP THE COUNT", "time": 1604801001.0}, {"subreddit": "democrats", "text": "PA lookin mighty fine now too 🥵. Biden is 26k behind there", "time": 1604634576.0}, {"subreddit": "democrats", "text": "Las Vegas metro and Reno metro make up 80% of AZ population this gives me hope", "time": 1604523345.0}, {"subreddit": "democrats", "text": "As a Michigander who went blue for the first time I was filled with energy to see Michigan flip this morning", "time": 1604522486.0}, {"subreddit": "democrats", "text": "If Texas goes blue the Republican Party won’t win anything for a while!", "time": 1604441193.0}, {"subreddit": "democrats", "text": "I was republican in 2016 but after seeing how trump handled covid or really didn’t handle it, I switched over.", "time": 1604373624.0}, {"subreddit": "democrats", "text": "Trump is breaking new records every day!! Oh wait that’s not a good thing", "time": 1604257567.0}, {"subreddit": "democrats", "text": "But I thought BiDEn wAnTEd to RaISE eVerYBodYs tAXeS and TrUmP oUr LoRD anD SaViOr WaNtS to LoWeR tHEm", "time": 1604198294.0}, {"subreddit": "democrats", "text": "I miss having a president who I am not ashamed of. I literally watch videos of Obama and get sad because we used to have a decent human being as president.", "time": 1604153633.0}, {"subreddit": "democrats", "text": "Trump already had the virus so that means America beat the virus", "time": 1604153547.0}, {"subreddit": "democrats", "text": "Mr. joans is a very nasty person. And quite frankly is very mean to trump.", "time": 1603939148.0}, {"subreddit": "democrats", "text": "It was red by a little over 10,000 votes last election. That’s a crazy small margin. So your vote does matter a lot especially in swing states.", "time": 1603927619.0}, {"subreddit": "democrats", "text": "COVID-20", "time": 1603885663.0}], "republican_score": 0, "democrat_score": 25}