{"name": "11591", "posts": [{"subreddit": "politics", "text": "Clyburn says Biden not naming enough Black cabinet members\n", "time": 1606357778.0}, {"subreddit": "democrats", "text": "Poll: Dead heat between Trump and Biden in Texas, Hegar narrows gap with Cornyn\n", "time": 1596665612.0}, {"subreddit": "democrats", "text": "In Florida, they had an astronaut senator. And they voted him out for a corrupt governor.\n\nAnd Alabama went from an amazing civil rights lawyer to a college football coach this election. Depressing.", "time": 1606967881.0}, {"subreddit": "democrats", "text": "Captain Kelly is now Senator Kelly!", "time": 1606945902.0}, {"subreddit": "politics", "text": "It's very true. Voting republican will cause antifa to show up to your house and kidnap you. Best to stay home or vote for Warnock and Ossoff.", "time": 1606029729.0}, {"subreddit": "politics", "text": "I like to believe that if the incumbent doesn't have 50%, that the undecideds break towards the challenger. That is the rule of thumb. Not sure if it holds.", "time": 1604197793.0}, {"subreddit": "politics", "text": "Harris - Ossoff in 2024!", "time": 1604028500.0}, {"subreddit": "politics", "text": "Thomas and Alito are the biggest political hacks on the court. Even worse than Gorsuch and Kavanaugh. At least Gorsuch and Kavanaugh ruled against Trump on his tax case.", "time": 1603786097.0}, {"subreddit": "politics", "text": "I doubt she recuses herself on many cases even when she should.", "time": 1603785987.0}, {"subreddit": "politics", "text": "Polling in Texas always overestimates GOP support by around 3%. Beto was supposed to lose by 6 or so percent and lost by  2-3%\n\nTrump was supposed to carry Texas by 12 points but he carried it by 9.", "time": 1603773077.0}, {"subreddit": "politics", "text": "I wonder if its because Abbott thinks that Biden will win Texas and all the Angry Trumpers will go crazy or if he thinks that Biden will get more votes but he will find a way to give the electoral votes to Trump against the will of the people and cause Biden voters to protest.\n\nIf Trump wins Texas, that is par for the course as the GOP  has alway won Texas in the past.\n\nOn the other hand Trump could win Texas and lose the election causing a lot of anger from the right.", "time": 1603761872.0}, {"subreddit": "politics", "text": "I might be wrong but I believe his base is not growing. Many of his 2016 voters have buyers remorse and are voting for Biden.\n\nAlso, due to many of his supporters being elderly, some of the 2016 voters have probably died off.\n\nIn Texas, the rural areas are shrinking as the cities and suburbs are growing. And those rural areas generally vote for Trump.", "time": 1603427856.0}, {"subreddit": "politics", "text": "The republican party typically adds about 100k voters in each presidential election in Texas. McCain got just under 4.5 million. Romney got just under 4.6. And Trump got just under 4.7.\n\nThe democrats have been closing the gap for years. If there are 10 million votes or higher (which we will know how many votes are cast by election day, even if we don't know the breakdown), then you can guess that Biden eclipsed Trump.\n\nI don't anticipate third parties getting very much of the vote this year, unless it's disassociated Republicans voting for Jo Jorgensen.", "time": 1603400371.0}, {"subreddit": "politics", "text": "Same thing happened to me in Texas in 2000 when I was in third grade at a private school. I voted for Gore in the mock election and everyone else voted for  Dubya. They didn't really make fun of me but said things like \"OMG I HATE GORE.\" \n\nWhen they combined our homeroom total with all the other homerooms, there were only two Gore votes. In the ENTIRE school.", "time": 1603178366.0}, {"subreddit": "politics", "text": "Hopefully John James in Michigan also loses two races in two years. Of course he is not an incumbent.", "time": 1603056113.0}, {"subreddit": "politics", "text": "Also Barbara Bollier in Kansas is shaping up to be really close. She is a former republican running as a democrat in a red state, but seems to be polling ahead of her GOP opponent according to some polls.\n\nThen there is Bullock in MT.", "time": 1603055679.0}, {"subreddit": "politics", "text": "It's sad the Cornyn is the smarter of our two senators.", "time": 1601970034.0}, {"subreddit": "politics", "text": "If Barr gets it, then it's game over for that fat f*ck.", "time": 1601915906.0}, {"subreddit": "democrats", "text": "The Montana at large seat might flip, according to one poll.", "time": 1601271900.0}, {"subreddit": "politics", "text": "I live in that district. The GOP candidate is running as a Trump Republican in a district that Hillary carried in 2016 and Beto carried in 2018. \n\nIn 2016, the GOP incumbent (Culberson) won despite Hillary carrying the district.\n\nI worry that Fletcher might be hurt by the elimination of straight ticket voting, but it seems that the GOP needs to be playing defense in other districts.", "time": 1600462533.0}], "republican_score": 0, "democrat_score": 4}