{"name": "fetusbucket69", "posts": [{"subreddit": "democrats", "text": "y’all know some of the dem favs would be plastered with just as much evil bullshit as mcconnell? like pelosi?", "time": 1607198740.0}, {"subreddit": "democrats", "text": "trump will never see a jail cell, probably best to drop that fantasy early", "time": 1604692987.0}, {"subreddit": "democrats", "text": "remember her trotting Bloomberg around during the primaries? embarrassingly groveling for VP? no thanks", "time": 1604689754.0}, {"subreddit": "democrats", "text": "did they all cheer for your jokes you fucking doofus? i think you’re projecting w this “go outside” bs", "time": 1603642829.0}, {"subreddit": "democrats", "text": "you’re delusional lol everyone cheering at a dumb fucking joke at the polls, no they didn’t", "time": 1603557202.0}, {"subreddit": "democrats", "text": "lol jesus.. no i’ve never experienced that and doubt you have either. totally different made up scenario tho, you really think the line at the polling place cheered?", "time": 1603503716.0}, {"subreddit": "democrats", "text": "lol no it’s not plausible actually", "time": 1603499048.0}, {"subreddit": "politics", "text": "Well the machines definitely are not foolproof, and there’s a bunch of different models out there so security varies widely. It’s a topic that needs more attention but let’s not be hysterical here. Is there any evidence of widespread election machine hacking by the Russians? Or collusion with local election officials? It’s a huge, sensational leap based on what? I have no doubt the GOP will try to cheat, but this defeatist nonsense of “the Russians are already in all the voting machines!” Helps nothing and frankly sounds ridiculous.", "time": 1598371100.0}, {"subreddit": "politics", "text": "This is so deranged. Do y’all sincerely believe that Russia has the ability to somehow mount a conspiracy that would involve local election officials in every city and county in the US? Because that’s what it would take to get to all the election machines. This is so fucking ridiculous, russiagate really is qanon for MSNBC liberals.", "time": 1598370214.0}, {"subreddit": "politics", "text": "You’re not even gonna drip the title?", "time": 1598147909.0}], "republican_score": 0, "democrat_score": 7}