{"name": "notwithagoat", "posts": [{"subreddit": "politics", "text": "Yea thats pretty typical to get it that nyt best seller sticker, to sell more.\nNyt should stop letting that happen but whatever.", "time": 1607098400.0}, {"subreddit": "politics", "text": "Or move to a ranked choice voting system.", "time": 1607034161.0}, {"subreddit": "democrats", "text": "And michael cohen", "time": 1607012842.0}, {"subreddit": "politics", "text": "Right? Stop making him news worthy", "time": 1606950004.0}, {"subreddit": "democrats", "text": "And were trying!", "time": 1606941937.0}, {"subreddit": "democrats", "text": "Reform? Nah, start over then replace maybe. We've tried reform when you were in office, took less then a year to undo all the executive orders you put in, and another 2 years to put them back. Start a new service don't hire unionized cops, work on mental care and descelation.", "time": 1606934213.0}, {"subreddit": "politics", "text": "Two more blue snetors if this passes.", "time": 1606920002.0}, {"subreddit": "politics", "text": "No, fix democracy now. Hurts us in the short run, but a better country in the long run.", "time": 1606863232.0}, {"subreddit": "politics", "text": "Im praying you're right, but untill dems win those 2 seats this is a ruse.", "time": 1606853960.0}, {"subreddit": "politics", "text": "It's all a ruse anyways. I don't for a instant think these goergians are buying parler memes.", "time": 1606852046.0}, {"subreddit": "politics", "text": "Policy over person, if we can get in government healthcare, more oversight over government and less foreign entanglements i don't care who it comes from.", "time": 1606413472.0}, {"subreddit": "politics", "text": "Blue voting georgians please assume that this is some ruse to get you comfortable and not vote. Please go out and vote as if this article isn't true.", "time": 1606401104.0}, {"subreddit": "politics", "text": "1200 dollars for nine months of covid, couldn't spend that if i tried.", "time": 1606400859.0}, {"subreddit": "politics", "text": "Stop giving established companies subsidies, want them to compete start municipality internet", "time": 1606400774.0}, {"subreddit": "politics", "text": "As they would be used in court and be sooooo embarrassing", "time": 1606359429.0}, {"subreddit": "democrats", "text": "Im saying, this may dissuade blue voter as it makes it seem Republicans won't vote. Don't buy this team blue. Vote as if they are voting.", "time": 1606320859.0}, {"subreddit": "democrats", "text": "Don't buy it. Goergians go vote.", "time": 1606317498.0}, {"subreddit": "politics", "text": "Typically poor and minority frontline workers in healthcare and essential services.", "time": 1606315549.0}, {"subreddit": "politics", "text": "This is probably fake so goergians go out and vote.", "time": 1606307178.0}, {"subreddit": "politics", "text": "Maybe stop putting him in the news.", "time": 1606255178.0}, {"subreddit": "democrats", "text": "Also wanna know wtf they did with Venezuela around February.", "time": 1606251062.0}, {"subreddit": "politics", "text": "Or troll or post on r/selfawarewolves", "time": 1606176018.0}, {"subreddit": "politics", "text": "That was my thought, also they're having issues with trolls and booting real members.", "time": 1606175703.0}, {"subreddit": "democrats", "text": "Look what they say in court is meaningless and have no consequences. Fox is where they tell the true true", "time": 1606171532.0}, {"subreddit": "democrats", "text": "The mountains of evidence and cases the courts are accepting is mind blowing staggering.", "time": 1606168455.0}], "republican_score": 0, "democrat_score": 8}