{"name": "littleclever", "posts": [{"subreddit": "democrats", "text": "been waiting for this, lol", "time": 1607108150.0}, {"subreddit": "politics", "text": "Is this the hill progressives want to die on?  lol.", "time": 1606969299.0}, {"subreddit": "politics", "text": "I fail to understand why people find it so hard to believe that more people voted for Biden than Trump.  It's a weird state of denial they're in.  I guess an echo chamber can do that for a person.\n\nThey're broken.", "time": 1606942393.0}, {"subreddit": "politics", "text": "No it's not.  \n\nThey just had a taste and if anyone thinks they're going to stop trying to destroy our democracy they are in for a rude awakening.  I fear that president-elect Biden is going to do little to nothing to fill the gaps that have been exposed and the next time is going to be much much worse. \n\nNow that they know that a huge segment of our citizenry is fully on board they are going to go for it again but next time they'll be smarter about it.\n\nUnity should not be Biden's main rallying cry, it should be protecting our country from tyranny and domestic threats.", "time": 1606912819.0}, {"subreddit": "democrats", "text": "I could care less about \"unity\", they can all kick rocks as far as I'm concerned but do you have any specific progressive policies in mind? \n\nJust curious because as a centrist (Biden) I'm not feeling too confident that Joe is going to be willing to swing too far to the left but at the very least he should try to keep any promises he made during the campaign to try to appeal to the progressive voters.", "time": 1606876693.0}, {"subreddit": "politics", "text": "a centerfold", "time": 1606835580.0}, {"subreddit": "politics", "text": "I've been considering this option as the only hope as well.  I really wish this would\\could be seriously explored.", "time": 1606774892.0}, {"subreddit": "democrats", "text": "We were always divided, trump just empowered the quiet but sizeable minority and made it cool to hate out loud again.  \n\nThere's no going back and I'm ok with that. It's good to know where you stand with people.\n\nI just hope Biden doesn't waste too much time trying to reason with a bunch of cultists.", "time": 1606365132.0}, {"subreddit": "democrats", "text": "They were.  [this explains how and when things changed](https://www.livescience.com/34241-democratic-republican-parties-switch-platforms.html)", "time": 1606313834.0}, {"subreddit": "democrats", "text": "Spot on.  I know President-elect Biden has been promoting healing and unity but I sincerely hope that he understands that things have changed and if these traitors are allowed to get away with what they've done, if we do not close the loopholes trump exploited for 4 years with no lube that we are doomed.  DOOMED. The confederates were given a slap on the wrist immediately after the civil war and right there the seeds of this mess were planted.\n\nThe next trump is going to be smarter and more dangerous.  We have to protect this country.  Abolish the electoral college, pack the supreme court and executive order the sh!t out of whatever he has to to right this ship.\n\nI understand Biden has to appear to be about uniting this country but I hope to god that despite that he plans to bury these traitorous fools. If we win those 2 seats in GA there will be no excuse not to.  \n\nThis fight is far from won.", "time": 1606272378.0}, {"subreddit": "democrats", "text": "Wow.  He was (is) a bigger piece of shit than I thought...", "time": 1606210348.0}, {"subreddit": "democrats", "text": "I'm sorry but I don't think healing is possible.  I don't engage with them, I'm just preparing for the worst from them.\n\nI sincerely hope I am wrong.", "time": 1605111639.0}, {"subreddit": "democrats", "text": "they love their echo chambers don't they...", "time": 1605023537.0}, {"subreddit": "democrats", "text": "This.  And it's the root of the problem.  they close their eyes, cover their ears and deny what leaks through.", "time": 1605021349.0}, {"subreddit": "democrats", "text": "humiliated who? how?  And they called us snowflakes", "time": 1604980407.0}, {"subreddit": "democrats", "text": "I think it's time for a change.", "time": 1604932328.0}, {"subreddit": "democrats", "text": "good luck with that.", "time": 1604881999.0}, {"subreddit": "democrats", "text": "amazing isn't it.  this and other democratic subs didn't do this to avoid their vitriol, we took it on the chin.  But that's their MO anyway, avoidance.", "time": 1604870687.0}, {"subreddit": "democrats", "text": "[taxes](https://www.nytimes.com/2020/10/31/opinion/republicans-biden-taxes.html)\n\nif you research the rest you'll find holes in the rest of it as well.", "time": 1604805724.0}, {"subreddit": "democrats", "text": "they made it private apparently. they were getting hammered unmercifully. it was glorious.", "time": 1604779069.0}, {"subreddit": "democrats", "text": "I'm with you.  Ignore the polls, vote with the mindset that yours is the deciding vote.  Polls are part of the reason we're in this mess in the first place.", "time": 1604345715.0}, {"subreddit": "democrats", "text": "exactly.  it's not wise to count the chickens before they hatch.", "time": 1603072495.0}, {"subreddit": "democrats", "text": "...knowing that the senate is not going to pass it right before they leave to campaign.  I wish they would stop playing politics and sort this out", "time": 1601598996.0}], "republican_score": 0, "democrat_score": 18}