{"name": "thatguy2366", "posts": [{"subreddit": "politics", "text": "No shit, the gun losers love to say things like \"the founder's would understand.\"  Understand what, that they've turned a well-meaning piece of legislation that was needed then (but clearly no longer) into a terrorist doctrine by a bunch of McDonald's grease crusted manboobed losers with nothing better to do than jerk off to civil war fantasy porn? These terrorists are dangerous and need to be dealt with before they turn the US into a bigger shithole than they tried to make in under DiaperDon.", "time": 1607198386.0}, {"subreddit": "politics", "text": "That's our secret Cap... no one with an education takes him seriously.", "time": 1607158333.0}, {"subreddit": "politics", "text": "If you haven't heard the whining and sobbing for the last month someone lost the election. So now they are full on \"fuck you\" mode. But the second the cloth from Biden's suit hits that WH seat you can bet your ass the fucking republicans will suddenly the most fiscal watchdogs ever and trying to blame everything on Democrats.", "time": 1607157619.0}, {"subreddit": "democrats", "text": "All that hate and not one real American in that picture.", "time": 1607143107.0}, {"subreddit": "politics", "text": "Yup gotta stay on our toes to stay ahead of the red terrorist party.", "time": 1607142258.0}, {"subreddit": "politics", "text": ">pants-shitting Adderall-addicted emotionally-crippled imbecile throwing a 24/7 tantrum \n\nMan she got trump's description down to a T.", "time": 1607132296.0}, {"subreddit": "democrats", "text": "To be absolutely fair to them they do ban anyone with an IQ digit to the left of the decimal.  Can't be having \"goodest thinkerers\"  making people look bad you know?", "time": 1607118190.0}, {"subreddit": "democrats", "text": "Lol making their little snowflake safe space just a little bit snowflakier.", "time": 1607117931.0}, {"subreddit": "politics", "text": "But ask that fat, lazy fuck about his tiny desk or qanon and he won't shut up.", "time": 1607062870.0}, {"subreddit": "politics", "text": "Quick question, why are we even inviting him?.. Also, I want a close-up shot of Biden sitting behind the desk the first day and not even reading trump's letter just crumple that bitch and toss it over his shoulder.", "time": 1607062597.0}, {"subreddit": "politics", "text": "How do you say \"buh bye\" in Russian?", "time": 1607017232.0}, {"subreddit": "politics", "text": "Uh huh.. anyway your shit needs to be packed for January.  Get on that, moron.", "time": 1606961286.0}, {"subreddit": "politics", "text": "On one hand, I hate trump on the other..... well, if his people are stupid, nah wait let's go hard 'R' here.  If his people are retarded enough to just throw money at his whiner who absolutely gives less than zero percent shit about any of them then they deserve to be fleeced as well.  Fuck him and fuck them.  The upcoming stimulus should only be for Democrat voters this time around since they've apparently got $150 million to just give away.", "time": 1606864784.0}, {"subreddit": "politics", "text": "The \"well-regulated militia\" in place for when or if America needed to break glass for emergency becomes the arm of tyranny.", "time": 1606792680.0}, {"subreddit": "politics", "text": "Terrorists gonna terrorist.", "time": 1606792259.0}, {"subreddit": "politics", "text": ">I'm 200% positive that if he read your message he would chuckle and go back to eating his caviar.\n\n\\*eating his live babies", "time": 1606774219.0}, {"subreddit": "politics", "text": "It's almost as if the complaint paperwork stopped on Christopher Wray's desk.  Don't you just hate when something you feel needs to be done stops on someone's desk?  Boy, I sure do.", "time": 1606677977.0}, {"subreddit": "politics", "text": "He could brand my toilet and put his face in the toilet bowl.. for a couple million paid to me.. in cash right then.", "time": 1606677452.0}, {"subreddit": "democrats", "text": "It's a fucking nor'easter in conservative reddit due to all the snowflakes.", "time": 1606676323.0}, {"subreddit": "politics", "text": "Not anti-trumpers.  We're Americans taking the flag back from the terrorist anti-American right.", "time": 1606675831.0}, {"subreddit": "politics", "text": "Nah, I'm your stepdad trying to make up for lost time after committing crime after falling into debt with the wrong guys left behind to take the fall.", "time": 1606673815.0}, {"subreddit": "politics", "text": "Ooof this got real dark.", "time": 1606673202.0}, {"subreddit": "politics", "text": "True, but I think in the long term AOC will bring in the votes.  Think positive you know?", "time": 1606630065.0}, {"subreddit": "politics", "text": "Sure I promise.. go grab your coat inside, I'll wait for you in the car. \\*squeals out in his mid-90s Geo Tracker blasting Kid Rock from one functional speaker\\*", "time": 1606627456.0}, {"subreddit": "politics", "text": "GOP is begging for help scaring their voters with doom and gloom that won't ever come to pass and AOC is like \"fuck it I'll just game and see what happens..\" It is nice having fresh faces in government that will definitely change the way things work in the future.", "time": 1606619105.0}, {"subreddit": "politics", "text": "Hey slugger, you wanna go out and kick a couple homeruns or whatever?", "time": 1606618397.0}, {"subreddit": "politics", "text": "Hello, Not Complaining I'm Thatguy2366!", "time": 1606611953.0}, {"subreddit": "politics", "text": "Lamest Duck", "time": 1606609326.0}, {"subreddit": "politics", "text": "You sure did little buddy now run along back to the kid's table.  The grown ups are talking.", "time": 1606584400.0}, {"subreddit": "politics", "text": "That's fair, some people are still fighting the civil war rent-free in their heads and forming militias incase the redcoats come back and that's been over for how long?  We just need to ignore their opinions on things and focus on correcting this sinking ship.", "time": 1606584231.0}, {"subreddit": "politics", "text": "He should have done that from his widdle table, sure thing lil' guy. Ok now, run along adults are talking.", "time": 1606583062.0}], "republican_score": 0, "democrat_score": 4}