{"name": "TwoKeyLock", "posts": [{"subreddit": "democrats", "text": "Really interesting take on McConnell’s next gamble. Frightening as heck but likely correct. Tank the economy, blame Biden, win down ballot votes, and win in 2024. More dead, overrun hospitals but he knows there’s a loyal and unending supply of dupes who will always vote Republican. Dang.", "time": 1607172416.0}, {"subreddit": "democrats", "text": "But it’s a great example of the irresponsible nature of modern day conservatives. InfoWars is one of their go to sources for ‘the truth’. And yet there is no accountability, no one takes responsibility when they get ‘the facts’ wrong in a story, no retraction and correction. Tomorrow there will be another story, another lie. It is the literal definition of insanity.", "time": 1607172028.0}, {"subreddit": "democrats", "text": "Can confirm. I work with a team in Georgia and I love them but it’s still a touchy and sensitive subject.", "time": 1607083764.0}, {"subreddit": "politics", "text": "Combine a 6-3 conservative majority with the new normal of unlimited Executive powers and the absence of a prohibition in the Constitution of self pardons and wa-la! I pardon myself from all future crimes that I may or may not have committed! I can imagine the sad, sophomoric, pretzel logic of ACB now.", "time": 1607081865.0}, {"subreddit": "democrats", "text": "My barber told me ‘all will be revealed.... all this evidence is going to come out ..... you’ve got to do your own research’. It all sounds eerily familiar. Fanciful conspiracy theories from deep within the know sources. We can only trust these fringe news sources as all other sources are part of the the cover up. Can’t you see? You’re the one getting played. I’m the one that sees the truth. It’s not just stupid, it’s delusional.", "time": 1606824505.0}, {"subreddit": "politics", "text": "Brilliant observations. Their absence of gratitude and grace are the exact opposite of what they learn on Sunday. It makes it impossible to reason with them, impossible to negotiate with them. There is no good faith effort if all they are constantly doing is scheming to hold and gain power, scheming to help themselves, and scheming to help the wealthy. All of this while claiming that they are the victims.", "time": 1606748827.0}, {"subreddit": "politics", "text": "The article does not mention how he will be able to monetize his time in office. He will gain an income stream from his serfs via campaign donations, the Trump defense fund, and other crowdfunding sources. Mara Lago will become a sort of Vatican where wannabes seek his blessing. You too can become a Congressman for the low low price of $250,000.", "time": 1606398939.0}, {"subreddit": "democrats", "text": "Woulda, coulda, shoulda. Conservatives live in a fantasy world of their own creation. There is no going back for the Republicans. They are the party of Donald Trump and likely will be for the next 25 years.", "time": 1605717930.0}, {"subreddit": "democrats", "text": "Imagine talking to a person who uses measuring devices that are all different from what you use. The weight scale, measuring tape, ruler, measuring cups, etc. are all different than yours. Now imagine trying to show them that your equipment is accurate and theirs is wrong. It would be difficult for you to convince them. Without a common set of rules, definitions, and measuring devices it’s almost impossible to have a conversation about facts, data, and solutions. IMO conservatives have opted to invent their own universe, making it difficult to achieve any sort of compromise or even a meaningful conversation.", "time": 1605700108.0}, {"subreddit": "democrats", "text": "Yup!", "time": 1605307082.0}, {"subreddit": "democrats", "text": "I’ve started thinking that too many people identify with their party the same way they think of themselves as a sports team fan for their hometown team. They see political competition as winning or losing like a Saturday afternoon college game rather than a math problem that should be evaluated based on outcomes and effectiveness. Republicans have polarized politics in ways that were unimaginable 30 or 40 years ago. IMO, they have destroyed the political conventions that served the nation up until the mid-80’s and the rise of social media has accelerated the destruction sealing our dysfunction for the foreseeable future. We are at our best when we work together.", "time": 1605266558.0}, {"subreddit": "democrats", "text": "She is speaking to all of the people who voted for Trump. She knows that there are basically no limits to what she can say so long as it’s something like ‘Democrats are bad.....’ The whole of the GOP now knows that they never have to be honest about anything again because their supporters live in a completely different information universe. Can’t you see that the lack of evidence is all the evidence you need? It’s truly the stuff of ‘1984’.", "time": 1605182320.0}, {"subreddit": "politics", "text": "Trump supporters blocked the northbound lane of the New Jersey Turnpike. I guess you’d call it a road block. Local reporting of these events remains solid but I feel like CNN, etc. should be covering these stories. Maybe I missed. The nation needs to see, read, and hear about these events.", "time": 1604319507.0}, {"subreddit": "democrats", "text": "What body of evidence is your teacher using that supports the observation? Are there other countries that they could cite where a center, center-left party led to fascism? Can they cite specific party platforms in the last 100 years that reveal any hint of what they are arguing? The obvious answer is no. Your teacher needs to support what they are teaching with facts and data otherwise it’s just a crazy old uncle rambling on.", "time": 1604263492.0}, {"subreddit": "politics", "text": "In Fox News world, the ‘loss’ of the documents gets reported as news and then their viewers mention the loss on their Facebook page. So rather than pause for a second and wonder why not publish on the Fox News website from the source, why not email, why not upload it to the cloud, it becomes a news story, a meme, a talking point for FN commentators, and a few Republican politicians. A classic form of disinformation that sows doubts.", "time": 1603975207.0}, {"subreddit": "democrats", "text": "It’s simple. Any change in gun policy no matter how small or reasonable is ‘an attack on our rights to have lots and lots and lots of guns’. The second amendment cites ‘a well Regulated Militia’ first. Obviously, the framers intended to emphasize the importance of a regulated militia. 2nd amendment advocates and the NRA turned this on its head sometime in the early 80’s. Scalia went so far as to suggest that you could ignore the prefatory clause (so much for originalist readings). The framers were literally thinking about a true and well regulated militia.  They were mortally afraid of maintaining a standing army, there was no constabulary like there is today, there were actual threats from hostile parties at the edge of the colonies. They really weren’t thinking about a guy in his truck wearing lounge pants at Walmart with a long gun strapped on his back. The gun industry and pretend army guns basically snuck up on society. And the Conservative party realized that they could make it a political issue to garner a reliable voting block.", "time": 1603912158.0}, {"subreddit": "democrats", "text": "You can’t reason with them. They are like children when it comes to Trumpism. All the facts in the world, all the open questions in the world, none of it matters to them.", "time": 1602703211.0}, {"subreddit": "democrats", "text": "Any question that starts with ‘can you explain’. Can you explain why the debt and the deficit have gone up x% during your presidency when you told voters that you were going to fix it. Can you explain why after 3+ years in office you haven’t repealed and replaced ACA with a better plan? Can you explain why after your time in office the trade deficit is worse than when you started when you said that you were going to fix it. Focus on something technical that also impacts people’s lives or wallets.", "time": 1602702927.0}, {"subreddit": "democrats", "text": "Real ‘fake news’ has become its own multi billion dollar industry. Who wants to read actual news from actual news organizations with high reporting standards when you can read about Pizza-Gate? The thing about the actual news is that it’s generally accurate. It’s common to get parts of the story wrong but exceptionally rare for the story to be mostly wrong or made up altogether. Even Fox News’s lawyers recently argued persuasively that Tucker Carlson should never be taken seriously. We have gotten to this point because there’s a willing market for the product. What’s really disappointing is that ‘smart, successful’ people have allowed themselves to be sucked into the rabbit hole of that world.", "time": 1601551086.0}, {"subreddit": "democrats", "text": "The GOP play book is well established. Cut taxes, decrease regulations (modestly), and increase spending. They will crow about the evils of big government but do absolutely nothing about it. It’s been 40 years of the same thing. Once a democratic is in, all of a sudden they’ll raise concerns about the debt and the deficit. The democrats are boring, they’re responsible, they fix the mess created by the Republicans. Republicans measure greatness by how rich they are. Democrats measure greatness by how well America is doing. All Americans. It’s about creating an opportunity infrastructure. Republicans want a Christian/Conservative/Kleptocracy that serves about 2% of the population. Their other supporters just think they are insiders.", "time": 1601490543.0}, {"subreddit": "democrats", "text": "Great work. Thank you for assembling and posting. Words mean nothing to the GOP. They know that they can say whatever suits the current circumstances. Their supporters just don’t care. Republican voters support the values & ideology of the Republicans . It’s like being a fan of a really sucky sports team. Yes they suck, yes they’ll never win the championship, but by god, they’re my sucky team. They will never change. And it could get worse. Russia wants the GOP to win!! Don’t people see or understand that Russia is rooting for the sucky team?? Why else would Russia help the GOP?", "time": 1600566141.0}, {"subreddit": "democrats", "text": "Keep being the shining beacon of kindness, light, humanity, and humor of North America!", "time": 1598806009.0}, {"subreddit": "democrats", "text": "It’s a waste of your time and not worth the drama or hard feelings you may cause. Think of it like trying to convince a Dallas Cowboys fan to become a Philadelphia Eagles fan or a Patriots fan. People are not rational about their sports teams and most are not rational about politics. Conservatives are generally hopeless. Science, data, news, policy experts, doctors, etc. are all lying or have an agenda or are funded by Soros. Just smile and wave. Smile and wave.", "time": 1597023190.0}, {"subreddit": "politics", "text": "I can’t believe newspapers continue to cover anything that Trump says as true or serious. It seems as though reporters never ask or follow up about all the things he says he’s going to do. Mr. President what is the status of the plan to _______ you mentioned two weeks ago. When will the American people see the benefits of the plan you touted?", "time": 1596471529.0}, {"subreddit": "democrats", "text": "This no excuse, but we don’t know what their media universe looks like. We can guess but it is likely far worse than we can imagine. A toxic mix of Fox, Facebook trolls & memes, conspiracy theories, YouTube documentaries from ‘reliable sources’. It is likely that they are utterly certain of their beliefs and are literally beyond helping. They are incapable of learning or moving away from their beliefs, however consequential.", "time": 1596219054.0}, {"subreddit": "politics", "text": "Good post! I agree wholeheartedly with your observations. It’s why I believe the election will be much closer than anyone expects. There are his ardent supporters, his secret racist supporters, and his I’ll never vote for a democrat supporters. All of them, in their own way want to turn back the clock to an imagined time in American history before ‘it changed’. Wear a mask! Vote this November!", "time": 1596159846.0}, {"subreddit": "politics", "text": "It’s plausible but unlikely. Doctors, healthcare workers, funeral directors, medical examiners take death certificate accuracy very seriously. What’s more plausible is that it’s accurate and Miller is being Miller. He’s better off asking for privacy and grieving about the passing of a loved one.", "time": 1595606631.0}, {"subreddit": "democrats", "text": "Florida will hit 1 million cases by mid to late August unless they take action in the next week or so. They are due to exceed New York by the end of July.", "time": 1594915959.0}, {"subreddit": "politics", "text": "Are we still waiting for Paul Ryan to save the day? Wasn’t he the bright rising star who was going to fix the debt and the deficit? Today’s HYDRA/GOP are a danger to the republic. They won’t stop until they have destroyed the country and can commence rebuilding it into a near totalitarian state. HailGOP.", "time": 1575239185.0}, {"subreddit": "democrats", "text": "In college too? What do we do when we get a job that has reality as a job expectation?", "time": 1573824285.0}], "republican_score": 0, "democrat_score": 21}