{"name": "flaskman", "posts": [{"subreddit": "democrats", "text": "Adam Schiff was right about every single effing thing!\n", "time": 1607201487.0}, {"subreddit": "democrats", "text": "McConnell and his GOP ghouls are actively trying to sink the economy at this point. You see all that red that's who they are going hurt the worse.\n", "time": 1607102678.0}, {"subreddit": "democrats", "text": "The teacher says every time a Republican denies Covid a relative gets their wings\n", "time": 1607053258.0}, {"subreddit": "democrats", "text": "LOL, these people whine and whine about cancel culture and that is all they want for everyone who doesn't do Dear Leader's bidding or support his every whim. They are so weak-minded.\n", "time": 1606870833.0}, {"subreddit": "democrats", "text": "Based on Trump's lawsuits and the voters he is trying to disenfranchise maybe Blexit was never about courting Black Voters rather instead just canceling their votes.\n", "time": 1606069513.0}, {"subreddit": "democrats", "text": "Hello, 911...uhhh yes I would like to report a murder. Oh, the killer? Well, he is early 60's about 6ft tall clean-cut. He burned his victim to death. I'll stay on the line.\n", "time": 1605975420.0}, {"subreddit": "democrats", "text": "Let’s not forget 10’s of millions of Trump supporters put all their eggs in this guy’s basket 🤷‍♂️\n", "time": 1605890055.0}, {"subreddit": "democrats", "text": "According to this article, we are to believe these two GOP legislators from MI are going to fly a Covid tube to meet with the Covid King just for shits and giggles?\n", "time": 1605826662.0}, {"subreddit": "democrats", "text": "Managers in a Tyson pork processing plant in Iowa had an actual betting pool on how many employees on the floor would get sick with Covid.\n", "time": 1605807873.0}, {"subreddit": "democrats", "text": "Are we sick of the phrase \"Republicans are telling me privately...\" yet?\n", "time": 1605714447.0}, {"subreddit": "democrats", "text": "He’s not draining the Swamp by firing Krebs he is firing him for the same reason he has fired the rest. No one ever told Donald NO as a child and he is still a child who absolutely cannot tolerate being told no\n", "time": 1605662027.0}, {"subreddit": "democrats", "text": "Guys...Senator Ron Johnson needs to hear from you on voter fraud\n", "time": 1605201130.0}, {"subreddit": "democrats", "text": "Lt. Gov Dan Patrick is offering a million dollars of his campaign money for any proof of voter fraud. I just called his office and turned in Louis DeJoy good luck to the rest of you!\n", "time": 1605053065.0}, {"subreddit": "democrats", "text": "MAGA list of 50 dead voters debunked by Daniel Dale doing god's work\n", "time": 1605026397.0}, {"subreddit": "democrats", "text": "Lara Trump says the fraud hotline has a new number, and they'll keep getting new numbers if they have to. Thought you all would want to know..ya know in cause you see a fraud\n", "time": 1604954775.0}, {"subreddit": "democrats", "text": "You mean the people who want martial law to over turn the election and are crying on Parler right now to start a civil war if Trump doesn’t remain president so they can “kill libtards” those people? Cry harder. I’m pointing out a economic reality they are trees who keep voting for the axe because the handle is wood so they think it is one of them.", "time": 1607130216.0}, {"subreddit": "democrats", "text": "Ahhhhhhhahahahahahahahahahahahahahahaha! Sure. First off I live in CA one of the top AG producers in the world. I OWN my 70 acre farm, so I’m fairly sure I’m not gonna starve. Owning a double wide is not the same as owning a home because I’ve owned a few of those as rentals as well. Finally many of those red states ALSO HAPPEN TO BE some of the biggest welfare states per capita as well so 🤷‍♂️", "time": 1607126451.0}, {"subreddit": "democrats", "text": "Even jobless, penniless, and homeless the red-state voters will incredulously try to find a way to justify a way to vote GOP.", "time": 1607102751.0}, {"subreddit": "democrats", "text": "May his inbox RIP", "time": 1606840964.0}], "republican_score": 0, "democrat_score": 19}