{"name": "ThoughtKontrol", "posts": [{"subreddit": "democrats", "text": "I miss superspreader rallies!", "time": 1607134890.0}, {"subreddit": "democrats", "text": "More like Democracy vs. Fascism!", "time": 1606401266.0}, {"subreddit": "democrats", "text": "Yes - I agree, the wall was a giant waste of tax-payer money.", "time": 1606028348.0}, {"subreddit": "democrats", "text": "disturbing in so many ways!", "time": 1605746738.0}, {"subreddit": "democrats", "text": "LOL - death treats!", "time": 1605673882.0}, {"subreddit": "democrats", "text": "This man is a disgusting piece of shit. Definition of the word \"sellout\".", "time": 1605672659.0}, {"subreddit": "democrats", "text": "LG+DT=❤️", "time": 1605670548.0}, {"subreddit": "democrats", "text": "[https://www.nytimes.com/interactive/2020/10/22/us/politics/trump-voters-demographics.html](https://www.nytimes.com/interactive/2020/10/22/us/politics/trump-voters-demographics.html)", "time": 1605151888.0}, {"subreddit": "democrats", "text": "Not surprised.  \nMajority of Trump's base=uneducated white voters", "time": 1605141603.0}, {"subreddit": "democrats", "text": "OK, that was creepy.", "time": 1605028362.0}, {"subreddit": "democrats", "text": "-12 total Comment Karma too!", "time": 1604981021.0}, {"subreddit": "democrats", "text": "Of course it is. Probably Russian too.", "time": 1604980968.0}, {"subreddit": "democrats", "text": "Sounds like something a republican troll would say.", "time": 1604980165.0}, {"subreddit": "democrats", "text": "There is no end to these ignorant conspiracies. Q-Anon caters to the uneducated voters (most of Trump's base) - that is why they are so rampant. Afterall, they do believe in \"alternative facts\" and are easily misled by Facebook misinformation campaigns. Yes, the pedophile baby-eating democrats stole the election from Donald Trump. Q-Anon supporters are the Olympians of mental gymnastics.", "time": 1604895394.0}, {"subreddit": "democrats", "text": "He never listened to his intelligence agencies and if he did, he never believed them. He was always \"smarter\" than any of them.", "time": 1604847058.0}, {"subreddit": "democrats", "text": "It’s going to take more than a can of spray paint to stop the Biden train.", "time": 1604550809.0}, {"subreddit": "democrats", "text": "You could try a media vacation, at least until the election. Turn off the TV, avoid online news and social media. Since you are quarantined - listen to music, play video games, take up a hobby, or rearrange your room. Just keep busy. This will all be over soon.", "time": 1603891136.0}, {"subreddit": "democrats", "text": "Unfortunately Biden won't take Iowa.", "time": 1603503067.0}, {"subreddit": "democrats", "text": "What morons!", "time": 1603420320.0}, {"subreddit": "democrats", "text": "Is that \"democrates\" pronounced like \"Socrates\" or like \"Demo Crates\". LOL!   \n\n\nUneducated voters - Trumps got 'em in spades!!", "time": 1603053208.0}, {"subreddit": "democrats", "text": "Taking the \"high road\" isn't working.", "time": 1602810100.0}, {"subreddit": "democrats", "text": "LOL! What losers!", "time": 1602281446.0}, {"subreddit": "democrats", "text": "I agree. Trump is a joke. But to say he looks like this guy post-covid is not cool. This guy could be a loyal democrat for all we know.", "time": 1602190677.0}, {"subreddit": "democrats", "text": "Whatever dude. Nobody was attacking you. I explained it in my post. Read it if you have time. \n\nIf you are against Trump and what he stands for, then we are on the same team. If not, then we are done here.", "time": 1601676358.0}, {"subreddit": "democrats", "text": "FYI - I'm not the OP!  \n\n\nYou accuse me of making assumptions about you and what you said - and then immediately turn around and make assumptions about me. Seems hypocritical to me. Where in my comment did I say that I \"WISH THAT SOMEBODY DIED\"? Then you call me dumb shit-brained vindictive - really? Civil discourse my friend.\n\nI was making a point about the \"toxicity\" that you mentioned in your original comment and that it might be a result of what we have been subjected to by this administration for 4 long years. You seem so shocked why we might feel this way.\n\nWe're not delusional just because we call bullshit on it.", "time": 1601671114.0}, {"subreddit": "democrats", "text": "Trump was the shitshow. Biden was composed and only spoke up to call out Trump's lies.", "time": 1601668442.0}, {"subreddit": "democrats", "text": ">Yes - let's have a little compassion for the man responsible for 208,000 deaths. A little sympathy for the man who dog whistles white supremacist groups. Just asking for a little empathy for a man who mocks the disabled. Perhaps a little understanding for a man who walks a mile in other people's shoes daily. A little respect for a man who calls our veterans, national heroes and POWs \"losers\" and \"suckers\". How about thoughts and prayers for the man who tear-gasses his own citizens for a photo-op at a church. How about a little love for the man who grabs women by the p\\*ssy. Let's give props to the man who brought back football during this pandemic. Afterall, he has done so much for the American people!  \n>  \n>Gosh, why so much hate???", "time": 1601664511.0}, {"subreddit": "democrats", "text": "Are they going to tape Trump’s mouth shut?", "time": 1601488674.0}, {"subreddit": "democrats", "text": "It is important for those people living under a rock to see what it looks like when a stark raving deranged lunatic (who happens to be president) becomes unhinged.", "time": 1601475937.0}], "republican_score": 0, "democrat_score": 29}