{"name": "Aurorinezori1", "posts": [{"subreddit": "democrats", "text": "Please vote. A friend from Europe.", "time": 1607101019.0}, {"subreddit": "politics", "text": "Or the Caïd in Daredevil", "time": 1606671132.0}, {"subreddit": "politics", "text": " Yes please listen to this guy", "time": 1606159492.0}, {"subreddit": "politics", "text": "Katie Porter is great too", "time": 1605955857.0}, {"subreddit": "politics", "text": "There’s Yang", "time": 1605039759.0}, {"subreddit": "politics", "text": "Someone knows their Netflix I see", "time": 1604659819.0}, {"subreddit": "politics", "text": "Yeah for Yang !", "time": 1603526670.0}, {"subreddit": "politics", "text": "Le Petit Prince", "time": 1596087927.0}, {"subreddit": "politics", "text": "Katie Porter is badass as well!", "time": 1595705297.0}, {"subreddit": "politics", "text": "Second that!", "time": 1595363153.0}, {"subreddit": "politics", "text": "Good", "time": 1595012707.0}, {"subreddit": "politics", "text": "She is such a boss", "time": 1593802765.0}, {"subreddit": "politics", "text": "Or on Sundays like in France", "time": 1592423615.0}, {"subreddit": "democrats", "text": "I love her", "time": 1592341809.0}, {"subreddit": "politics", "text": "I am from Europe, France actually where this would be totally impossible. I understand that these protesters are globally white : would this be possible with a black community showing their (légal) guns? I’ve never seen this on TV in France so was wondering if this was a thing in US or not? On the other hand, we’ve seen supremacists’ images.", "time": 1587745017.0}, {"subreddit": "politics", "text": "I would say yes, voting is always promoted and we regret the abstention rate that is high. That said, politics in France play dirty as well, but the process of voting is pretty clear, minus a few scandals that are not typical of the whole country. We definitely could do better but this is far far from the US status.", "time": 1586764295.0}, {"subreddit": "politics", "text": "We have a lot of voting shenanigans in France too, but you are playing in a major league compared to us", "time": 1586730679.0}, {"subreddit": "politics", "text": "Interresting historical point, I was wondering why voting was not pragmatic at all... Good for Virginia to live in the XXI century", "time": 1586730127.0}, {"subreddit": "politics", "text": "Well you deserve a holiday then... or vote on Sundays. Ideally, gouvernment should do the maximun to promote voting and enable it by all means. Guess that’s not the idea with Tuesdays...", "time": 1586729027.0}, {"subreddit": "politics", "text": "My question from France: is it not on Sundays in the US?", "time": 1586728500.0}, {"subreddit": "politics", "text": "I was interested because I am French but not following the news on a daily basis. What I understand is that there is a kind of information war between the supporters of Dr Raoult fron the South of France chloroquine) and his opponents (the Parisian elite) supported by Big Pharma. The résults of patients treated with chloroquine are greater than without it. The discussion here is that this chloroquine treatment costs only 2€ vs the new one that would be +200€... But take my opinion with a grain of salt because I don’t follow the news every day. What I understand about Trump is that he knows the treatment would work, wants to profit from it (imagine the numbers of infected poeple) and resume ASAP to business as usual to have a chance to be reelected.", "time": 1586675039.0}, {"subreddit": "politics", "text": "Sauce?", "time": 1586644591.0}, {"subreddit": "democrats", "text": "MVP", "time": 1586450074.0}, {"subreddit": "politics", "text": "Please take care, you are important too.", "time": 1585347878.0}], "republican_score": 0, "democrat_score": 3}