{"name": "EagleFly_5", "posts": [{"subreddit": "democrats", "text": "Sen. Bernie Sanders: People Are Suffering ‘In A Way We Have Not Seen Since The Great Depression’\n", "time": 1607201489.0}, {"subreddit": "politics", "text": "Governor Murphy Signs Executive Order Enrolling Residents Who Choose to Receive a COVID-19 Vaccine in the New Jersey Immunization Information System\n", "time": 1607182379.0}, {"subreddit": "politics", "text": "Governor Murphy Signs Legislation Expanding Eligibility for Extended Unemployment Insurance Benefits\n", "time": 1607123183.0}, {"subreddit": "politics", "text": "National Governors Association Leadership Calls on Congress to Deliver a COVID Relief Bill and Support States Before Recessing\n", "time": 1607116207.0}, {"subreddit": "democrats", "text": "Rep. Rose Delivers Farewell Address to Congress\n", "time": 1607016126.0}, {"subreddit": "politics", "text": "Mayor de Blasio Launches Employee Ownership NYC, Nation's Largest Municipal Initiative to Support Employee Ownership Conversion\n", "time": 1606929256.0}, {"subreddit": "politics", "text": "Governor Cuomo Issues Letter to Secretary of Health and Human Services Urging Support for Underserved Communities and Protection for Undocumented Immigrants in Vaccine Distribution Program\n", "time": 1606848242.0}, {"subreddit": "politics", "text": "Governor Murphy Announces Retirement of Department of Environmental Protection Commissioner Catherine McCabe\n", "time": 1606836726.0}, {"subreddit": "politics", "text": "Governor Murphy Signs Legislation to Bring Changes to the Use of Body Worn Cameras by New Jersey Law Enforcement\n", "time": 1606242768.0}, {"subreddit": "democrats", "text": "If I recall, Max gave small hints on how his opponent (Nicole Malliotakis, a NYS Assemblywoman also from the area) began to play dirty when it came to him marching in Black Lives Matter protest in Staten Island months ago, and tried to paint Max Rose as an anti-cop politician. Even though Max has tried to say he’s both for BLM *and* Blue Lives Matter (against police defunding), the message didn’t resonate well with his mostly Republican leaning constituents, given how there’s a notable percentage of police officers who live in the island/borough. So that was most likely the primary reason he lost. \n\nI do hope he can stick around in some fashion! Since he’s still in the Army National Guard, he’s still serving the country in one way or another, and there’s speculation his time in politics isn’t completely over given NYC’s mayoral elections are next year, and he’s floated to announce a run soon, according to rumors.", "time": 1607018404.0}], "republican_score": 0, "democrat_score": 3}