{"name": "MBlaizze", "posts": [{"subreddit": "democrats", "text": "Trump’s EPA OKs pesticide linked to lower IQs, memory issues in children\n", "time": 1607188038.0}, {"subreddit": "democrats", "text": "Study links regular use of Fox News, Twitter, and Facebook to reduced knowledge about COVID-19\n", "time": 1607099520.0}, {"subreddit": "democrats", "text": "McConnell shoots down bipartisan $900 billion coronavirus stimulus plan as stalemate drags on\n", "time": 1606854580.0}, {"subreddit": "democrats", "text": "Trump said the stock market would crash if Biden won. The Dow just had its best month since 1987.\n", "time": 1606800107.0}, {"subreddit": "democrats", "text": "‘Time For My Flag to Go Up’: How Anti-Trumpers Are Reclaiming the American Flag\n", "time": 1606701106.0}, {"subreddit": "democrats", "text": "‘Time For My Flag to Go Up’: How Anti-Trumpers Are Reclaiming the American Flag — POLITICO\n", "time": 1606701057.0}, {"subreddit": "democrats", "text": "Trump lawyer details far-fetched, unprecedented trick-shot strategy to reverse Pennsylvania win for Biden\n", "time": 1606333628.0}, {"subreddit": "democrats", "text": "YouTube suspends and demonetizes OANN (One America News Network) over video showing guaranteed cure to COVID-19\n", "time": 1606250117.0}, {"subreddit": "democrats", "text": "First on CNN: GSA tells Biden that transition can formally begin — CNN Politics\n", "time": 1606173860.0}, {"subreddit": "democrats", "text": "Michigan certifies Biden win, days after Trump leans on state's GOP lawmakers\n", "time": 1606169897.0}, {"subreddit": "democrats", "text": "Trump Campaign Loses Pennsylvania Suit to Halt Certification\n", "time": 1606002781.0}, {"subreddit": "democrats", "text": "Biden welcoming the 1st Indigenous Congresswomen in U.S. history; Deb Haaland NM & Sharice Davids KS\n", "time": 1605995723.0}, {"subreddit": "democrats", "text": "Washington Post: Trump spoke to GOP official who now wants to 'rescind' vote to certify Detroit's results\n", "time": 1605807444.0}, {"subreddit": "democrats", "text": "Trump campaign drops Arizona ballot challenge case, says Biden has too many votes to catch up\n", "time": 1605291832.0}, {"subreddit": "democrats", "text": "Government officials say election was \"the most secure in American history\" — USA TODAY\n", "time": 1605241643.0}, {"subreddit": "democrats", "text": "What if Trump never concedes? The Constitution will end his term, conservative lawyer John Yoo says\n", "time": 1605196632.0}, {"subreddit": "democrats", "text": "Pic taken during the Bush to Obama transition\n", "time": 1605188638.0}, {"subreddit": "democrats", "text": "Jon Voight Thinks Dems are Satan and He and Donald Trump Are in “Our Greatest Fight Since the Civil War” — Vanity Fair\n", "time": 1605135317.0}, {"subreddit": "democrats", "text": "Should r/Democrats go private like r/Republicans did? Because things are starting to get dangerous, and white suprematists could be keeping tabs on us\n", "time": 1605112399.0}, {"subreddit": "democrats", "text": "Steve Bannon Caught Running a Network of Misinformation Pages on Facebook\n", "time": 1605058308.0}, {"subreddit": "democrats", "text": "Coup alert: Pompeo Says There Will Be Smooth Transition To 'Second Trump Administration'\n", "time": 1605037140.0}, {"subreddit": "democrats", "text": "Supreme Court appears willing to leave Obamacare in place\n", "time": 1605030934.0}, {"subreddit": "democrats", "text": "DOJ's top election crimes prosecutor quits in protest after Barr tells federal attorneys to probe unsupported allegations of voting irregularities\n", "time": 1604981194.0}, {"subreddit": "democrats", "text": "Democrats flip suburban Georgia House seat\n", "time": 1604956889.0}, {"subreddit": "democrats", "text": "Trump fires Secretary of Defense Mark Esper. Is he attempting a coup??\n", "time": 1604951515.0}, {"subreddit": "democrats", "text": "Most world leaders are ignoring Trump's election claims—China is an exception — FORTUNE\n", "time": 1604929522.0}, {"subreddit": "democrats", "text": "Dow futures rise 350 points after Biden wins presidency as post-election rally continues\n", "time": 1604885820.0}, {"subreddit": "democrats", "text": "After Trump’s Defeat, His Supporters Held A Heavily Armed Show of Force\n", "time": 1604859165.0}, {"subreddit": "democrats", "text": "The Empire State Building in New York is displaying red white and blue lights tonight\n", "time": 1604809150.0}, {"subreddit": "democrats", "text": "CNN calls it! Biden Wins!!!\n", "time": 1604766678.0}, {"subreddit": "democrats", "text": "People are dancing on the streets in Philly over Biden win!\n", "time": 1604706806.0}, {"subreddit": "democrats", "text": "Trump calls for ballot counting scenario where votes legally cast by military would be thrown out\n", "time": 1604705182.0}, {"subreddit": "democrats", "text": "GOP asks Supreme Court to halt count of Pennsylvania ballots received after Election Day as Biden takes lead\n", "time": 1604693114.0}, {"subreddit": "democrats", "text": "Stop the count!!!\n", "time": 1604689105.0}, {"subreddit": "democrats", "text": "Mississippi governor vows to 'do everything in my power' to prevent expansion of mail-in, early voting. What if other Rightwing governors do this? What can we do to counter this?\n", "time": 1604672704.0}, {"subreddit": "democrats", "text": "Joe Biden is the apparent winner in Wisconsin, a state Trump won in 2016\n", "time": 1604518178.0}, {"subreddit": "democrats", "text": "CNN Projection: Biden wins Wisconsin\n", "time": 1604518068.0}, {"subreddit": "democrats", "text": "Biden launches legal fund and is taking donations\n", "time": 1604517777.0}, {"subreddit": "democrats", "text": "Trump sues to stop Michigan ballot count, demanding access to tally sites\n", "time": 1604517569.0}, {"subreddit": "democrats", "text": "Unpopular observation: democrats lost a ton of support due to their strict COVID lockdowns\n", "time": 1604475087.0}, {"subreddit": "democrats", "text": "Biden lead over Trump narrows in key swing states as campaign enters final hours. Vote!\n", "time": 1604359305.0}, {"subreddit": "politics", "text": "It's now too late to mail your 2020 ballot. Here's what to do instead\n", "time": 1604026953.0}, {"subreddit": "democrats", "text": "This is Epic! Someone edited the final battle scene of Avengers Endgame to mirror the protesters as the Avengers and the racists and police as Thanos\n", "time": 1592757717.0}, {"subreddit": "democrats", "text": "A million people sign a petition to declare the KKK a terrorist organization\n", "time": 1591978671.0}, {"subreddit": "democrats", "text": "The Stock Market is crashing HARD today..\n", "time": 1591900921.0}, {"subreddit": "democrats", "text": "Kindergarten school teacher gives National Guard soldiers a flower, gets arrested by police\n", "time": 1591574693.0}, {"subreddit": "democrats", "text": "Artificial Intelligence is being used to quietly upgrade institutional racism\n", "time": 1591537445.0}, {"subreddit": "democrats", "text": "Ukraine found no evidence against Hunter Biden\n", "time": 1591314694.0}, {"subreddit": "democrats", "text": "Minnesota officials link arrested looters to white supremacist groups\n", "time": 1591053167.0}, {"subreddit": "democrats", "text": "Many on the left are way too nonchalant about this. The far right are total lunatics, and they are armed to the teeth, have a majority of the military and most of the police. They may even get help from Russia if there was a civil war. The left wouldn’t stand a chance, and we would quickly find ourselves in gas chambers.", "time": 1607195610.0}, {"subreddit": "democrats", "text": "You can’t", "time": 1607193840.0}, {"subreddit": "democrats", "text": "Nice! You are an awesome artist! :)", "time": 1607104372.0}, {"subreddit": "democrats", "text": "At first I was hoping that Twitter would ban him as soon as he is out of office, but now I think that it might be smart to keep him Tweeting dumber and dumber nonsense so that we have a record for future generations to look back at and see how absurd the GOP was, in a nice, condensed, convenient Trump-Shit-Tweat list.", "time": 1606853029.0}, {"subreddit": "democrats", "text": "No, but I am 42. After a few heated arguments, I begged to just please stop talking about politics. I also only see my parents during special occasions.", "time": 1606514050.0}, {"subreddit": "democrats", "text": "I am in a similar situation with my parents. Proof probably wont matter.", "time": 1606511757.0}, {"subreddit": "democrats", "text": "Some bullshit scam", "time": 1606252142.0}, {"subreddit": "democrats", "text": "Exactly. We could see a Trump-approved candidate like Betsy Devos, who will talk nice, but govern like exactly like Trump, except much more efficient, and they will all get behind her in lockstep. Every election will be us voting like our lives depend on it.", "time": 1606250555.0}, {"subreddit": "democrats", "text": "Lol. I am an Agnostic, but for a minute there, it felt like something straight out of revelation, with the 4 horsemen being: Guilini bleeding black blood, Pence with the fly on his demonic looking hair, Mitch McConnell’s black hands, and Trump’s orange skin. Added to that, is the use of the word “Trumpets” in the book of revelation. After smoking some strong weed over these past few weeks, I would swear that the apocalypse was upon us! 😂", "time": 1606236099.0}, {"subreddit": "democrats", "text": "Lol my excessiveness is part of my own little campaign to divide the right, and unite the left", "time": 1606227280.0}, {"subreddit": "democrats", "text": "I know, we need to do this as well, because if we don’t, then the fascists will own the future, and we could find ourselves being put into the gas chambers by far rightwing soldiers endowed by a white supremacist president. Good for you, fellow dem!", "time": 1606223944.0}, {"subreddit": "democrats", "text": "Awesome post. And many of these required countless man hours of experts examining how to best apply them for maximum benefit to society, and the economy, and Trump just mindlessly slashed them and wasted all of that work. It was devastating in ways that we will be paying for for decades.", "time": 1606187665.0}, {"subreddit": "democrats", "text": "Yea, Trump opened up a whole slew of new presidental powers. I just hope it doesn’t lead down a slippery slope, and come back to sting democracy in the future.", "time": 1606187377.0}, {"subreddit": "democrats", "text": "I don’t think they will do that, because it would be a national security risk, and Republicans pride themselves on national security. Today you heard a bunch of national security experts come out and say what Trump is doing is bad for national security and he quickly started the transition process. National security is just something you don’t mess with.", "time": 1606187133.0}, {"subreddit": "democrats", "text": "It was going to create 25,000 jobs: https://www.cnbc.com/amp/2019/02/14/new-york-will-lose-the-bulk-of-the-25000-jobs-that-were-promised-by-amazon-hq2.html \n\nI lived in the surrounding suburbs at the time, and there were many people out there that were praying in desperation for it. Plus, it makes the surrounding area look like a high tech futuristic metropolis, and brings other development into the the whole region.\n\nIt was a bone headed move for the Democrats, and made us look like economy-hating morons to the centrists that we desperately need to win over if we don’t want fascism to reign.\n\nEdited", "time": 1606184995.0}, {"subreddit": "democrats", "text": "Yes, AOC needs to chill with that. Does she not realize that we are under attack from the right, the most important thing by far right now is to keep as many areas blue as possible?? I also think it was silly to shut down the new Amazon HQ in Long Island City, especially with how many people are out of work now.", "time": 1606182432.0}, {"subreddit": "democrats", "text": "YYYYEEEEEEEEAAAAAAAAAAAAAAAAAAAHHHHHHHH!!!!!!!!!!!!!!!!!!!!!!", "time": 1606174096.0}, {"subreddit": "democrats", "text": "Between him oozing black liquid from his head, the fly on Pence’s head, and Mitch McConnell’s black hands, it sounds like signs out of the book of Revelation about the antichrist", "time": 1605833931.0}, {"subreddit": "democrats", "text": "How the f**k can Democrats withstand this constant assault on democracy by the GOP? Can Trump actually pull this off? Is it time to look into leaving the country?", "time": 1605808492.0}, {"subreddit": "democrats", "text": "Massachusetts is the most educated state in the country \n\nhttps://boston.cbslocal.com/2019/01/22/most-educated-states-massachusetts-education/", "time": 1605717879.0}, {"subreddit": "democrats", "text": "Yea, we are not out of the woods yet", "time": 1605715400.0}, {"subreddit": "democrats", "text": "So now we have to worry about the other battleground states", "time": 1605709236.0}, {"subreddit": "democrats", "text": "Yes. We truly live in Bizarro wold", "time": 1605472229.0}, {"subreddit": "democrats", "text": "Good, let the right start to believe that voting doesn’t matter, while we keep voting our asses off.", "time": 1605410478.0}, {"subreddit": "democrats", "text": "Putin: “give us all of your nukes, and I’ll give you asylum in Russia”\n\nTrump: “Sounds fair; where do I sign?”", "time": 1605310743.0}, {"subreddit": "democrats", "text": "They banned me for posting one of Trump’s tweets from 2016 that contradicts what he is saying today lol", "time": 1605293548.0}, {"subreddit": "democrats", "text": "Yea, and the ‘shady stuff going on’ was done almost entirely by the republicans. I live near Boston, and some white supremacist set fire to a vote dropoff box in a hardcore liberal neighborhood over here. Democrats just don’t do stuff like that.", "time": 1605290155.0}, {"subreddit": "democrats", "text": "Guys, I would consider not dressing like a liberal for a little while. Perhaps don’t wear Tie Dye shirts, or shirts with certain bands on them. We need to protect ourselves from these maniacs. Stay safe, fellow REAL Americans", "time": 1605225816.0}], "republican_score": 0, "democrat_score": 76}