{"name": "kmurph72", "posts": [{"subreddit": "democrats", "text": "All the Trump flags that have flown for years and the yard signs that popped up in the fall are now gone. As I drive my son to school in the morning I saw these flags for years and more recently the many yard signs. Today I can report that all the flags and signs on this short ride are now gone.\n", "time": 1607103827.0}, {"subreddit": "politics", "text": "It's time for the left to ban polls from all left-leaning subreddits. until they prove themselves again I don't want to hear one single solitary poll result.\n", "time": 1605150686.0}, {"subreddit": "democrats", "text": "NBC news has called the race for Biden at 11:24 am. Saw it first on Drudgereport.\n", "time": 1604766782.0}, {"subreddit": "democrats", "text": "Well they got us again. All polls are nonsense now. Biden up 10 in Pennsylvania? How about -2. It's not entirely over. One thing is for sure. Polls are nonsense now. Maybe they always were. I'm done looking at polls for the rest of my life. And Democratic candidates should do the same.\n", "time": 1604492617.0}, {"subreddit": "democrats", "text": "Right now the electoral map is upside down. Trump will win Florida. Biden is on the path to win Ohio and NC Wich means Victory. Fingers cross. Texas is close.\n", "time": 1604455283.0}, {"subreddit": "democrats", "text": "Florida not looking good. North Carolina and Ohio looking very good. Texas will be close.\n", "time": 1604454513.0}, {"subreddit": "democrats", "text": "So now we have Republicans in so-called Trump trains. They find each other on Twitter hashtags. They meet up in parking lots. They all get on a highway somewhere and then just stop and put up their Trump flags. Traffic is now stopped for as long as they want.\n", "time": 1604338720.0}, {"subreddit": "democrats", "text": "Just so you know you can bring your child into the booth to vote in every state in the United States.\n", "time": 1603913068.0}, {"subreddit": "democrats", "text": "If you see cops patrolling voting sites it is because Trump and the GOP want them there to discourage and intimidate some voters.\n", "time": 1603838625.0}, {"subreddit": "democrats", "text": "After skimming through the conservative sub I have learned a few things. Many posters are confident of a Trump victory. They cherry pick polls showing Trump is ahead. It's quite an eye opener.\n", "time": 1603752719.0}, {"subreddit": "democrats", "text": "You can tell the country is tired of Trump. Nobody cared about the debate last night including those who watched it. The speeches and the one-liners get crazier everyday but nobody cares anymore. The few articles written about last night's debate are boring, even the writers are bored with it.\n", "time": 1603459336.0}, {"subreddit": "democrats", "text": "What Trump has said about the governor of Michigan since her kidnapping attempt has been known is one of the worst things a politician in the United States has ever done. We are all just so used to Trump acting like an idiot we don't feel anything anymore.\n", "time": 1603059013.0}, {"subreddit": "democrats", "text": "The main reason why Trump went to NBC to do the town hall was because many millions more people have access to that platform on TV. Trump wanted to brag about the ratings for the next two weeks in his rallies. But it didn't happen. Biden's ratings were higher.\n", "time": 1602867247.0}, {"subreddit": "democrats", "text": "I don't care if Biden has a stroke on Jan 22. I just want this fascist moron out of office and I want his ignorant racist fans jammed back in the closet.\n", "time": 1602469577.0}, {"subreddit": "democrats", "text": "What do you make of Lindsey Grahams refusal to take a virus test?\n", "time": 1602338787.0}, {"subreddit": "democrats", "text": "I was against the stimulus before I was for it.\n", "time": 1602214643.0}, {"subreddit": "democrats", "text": "Trump calls for stimulus negotiations to stop until after Election Day\n", "time": 1602017843.0}, {"subreddit": "democrats", "text": "Trump takes marine 1 back to the White House because there is an election to destroy. It's very difficult to undermine an election from a hospital room.\n", "time": 1601935911.0}, {"subreddit": "democrats", "text": "Schumer should make the Senate vote on the Corona virus relief package soon. I wasn't even aware that he could do this until he did it last week.\n", "time": 1601674635.0}, {"subreddit": "democrats", "text": "President and the first lady had tested positive full Corona virus.\n", "time": 1601615859.0}, {"subreddit": "democrats", "text": "Now the world knows that Biden is a decent man and that Trump is a fucking lunatic. Vote!\n", "time": 1601434467.0}, {"subreddit": "democrats", "text": "Trump's latest onslaught against the democratic voting process is an act of cover.\n", "time": 1601131962.0}, {"subreddit": "democrats", "text": "Remember this line. \"How come it's one set of rules for Democratic presidents and another set for Republicans?\" We are going to use this for 50 years.\n", "time": 1600554150.0}, {"subreddit": "democrats", "text": "If McConnell fills the Supreme Court vacancy, every independent, libertarian, green party or non offiliated voter should vow to never vote Republican again. There can be consequences.\n", "time": 1600533047.0}, {"subreddit": "democrats", "text": "It's comical but some Republicans actually think that if a vaccine comes out in October that it automatically means Trump would win the election. If the first vaccine is available tomorrow it won't change anybody's vote not one person.\n", "time": 1600217997.0}, {"subreddit": "democrats", "text": "I'm curious to know what people are thinking about the Joe Rogan situation. Rogan has been on the fence about Trump for a few years. Rogan has said several times that biden can barely put a sentence together. Someone suggested a fact checker for the debate.\n", "time": 1600137873.0}, {"subreddit": "democrats", "text": "As a veteran from a family of veterans I'm still angry about all of us being called suckers and losers.\n", "time": 1599929772.0}, {"subreddit": "democrats", "text": "Finding out that Trump knew that the virus was a big deal way back in February is mind boggling. You can go back to any of his stupid press conferences back in March and April with this new information and be stunned all over again. Who's the sucker now?\n", "time": 1599744970.0}, {"subreddit": "democrats", "text": "If we can get one or two of the people that were there when Trump made the military suckers comment to come forward...... Those people now know the stakes. It is up to them.\n", "time": 1599367042.0}, {"subreddit": "democrats", "text": "With Trump's new words he's showing that he doesn't care if his constituents break the laws and get arrested as long as he can remain in office to stay out of jail.\n", "time": 1599320543.0}, {"subreddit": "democrats", "text": "NBA announces new plan that includes turning arenas into voting centers\n", "time": 1598663196.0}, {"subreddit": "democrats", "text": "Lou holtz a longtime college football coach has made comments about Biden being Catholic in name only. It's comical because this comes from a place of fear. They are terrified that a religious Democrat could literally end the GOP.\n", "time": 1598640329.0}, {"subreddit": "democrats", "text": "Can we get a running list now of all the guests who were supposed to speak at the RNC but were canceled because they were either racist or crazy or into conspiracies.\n", "time": 1598499474.0}, {"subreddit": "democrats", "text": "In the early 1980s the RNC hired armed off-duty police officers in uniform to patrol polling stations in minority neighborhoods. They wore armbands reading \"National Ballot Security Task Force,\" an imaginary organization. The cops asked people in line if they had the right to vote. Sound familiar?\n", "time": 1598305561.0}, {"subreddit": "democrats", "text": "Trump says a vaccine is being delayed to hurt his election chances. Over 100 different companies worldwide are racing to get vaccines approved. Trump is insignificant to this process.\n", "time": 1598216805.0}, {"subreddit": "democrats", "text": "Is anyone going to ask Trump his opinion on the poisoning of Alexei Navalny? Someone should ask everyday until the election to remind people that Trump is afraid to criticize Putin.\n", "time": 1598113228.0}, {"subreddit": "democrats", "text": "It has been true that Republicans have owned the Christian vote for a long time. Now that they have centered around Trump they do not own Christianity anymore. Democrats believe in the separation of church and state. It's time people understand that many many Democrats are very religious people.\n", "time": 1597972825.0}, {"subreddit": "democrats", "text": "The Dow Jones industrial index only tracks 30 stocks. There are thousands of stocks that have no effect on the Dow Jones. The Dow Jones is not a measure of the actual stock market or the economy.\n", "time": 1597890464.0}, {"subreddit": "democrats", "text": "Trump is literally suing the state of New Jersey because they are trying to make it easier for people to vote during a pandemic by sending everyone a ballot. What is his argument? He doesn't want that many people voting?\n", "time": 1597865705.0}, {"subreddit": "democrats", "text": "Never again will you witness a Democratic national convention with that many Republicans speaking against their candidate.\n", "time": 1597722268.0}, {"subreddit": "democrats", "text": "We're a mask and pack a lunch. Take the whole day to vote in 2020.\n", "time": 1597720772.0}, {"subreddit": "democrats", "text": "Governor Coumo said, \"The government can tell the truth again\". A very Powerful statement for the current times. It's unfortunate that it needs to be said.\n", "time": 1597715650.0}, {"subreddit": "democrats", "text": "I have come to a conclusion about the real reason for Trump's effort to disrupt the post office. Most states have received official warnings from the USPS that they will not be able to process votes in time. Trump wants doubt about the post office, so people don't use it to vote. It's working.\n", "time": 1597540056.0}, {"subreddit": "democrats", "text": "It becoming more and more obvious that we are going to have to show up in person to vote in November. Someone should start a movement about using a sick day on election day. Taking extra safety precautions masks and face shields. Even go to work late. Make voting the number one priority for that day\n", "time": 1597431907.0}, {"subreddit": "democrats", "text": "It would have been nice for all of us to vote by mail this year however Trump knows he will lose if that happens. We can all see how he put his crony in charge of the post office. I for one am going to put on a mask and vote in person this year. I also may call in sick that day to make it happen.\n", "time": 1597328854.0}, {"subreddit": "democrats", "text": "It has been reported that Jared Kushner and Kanye West have daily discussions about him running in the election. I'm Pretty sure that breaks the law somehow. If it doesn't break a law we need to make sure that it does in the future.\n", "time": 1597287712.0}, {"subreddit": "democrats", "text": "This won't be popular but Pelosi blew it by giving Trump an opening to drop his executive orders. Even if the orders never happen it's still a win for Trump. Pelosi should have negotiated the best she could then cut whatever deal was possible with McConnell. She blew this one.\n", "time": 1597098549.0}, {"subreddit": "democrats", "text": "Can anybody name anything that Trump is doing to combat the Corona virus. In all seriousness is he doing anything. Can anybody name one thing?\n", "time": 1596606975.0}, {"subreddit": "democrats", "text": "Rush Limbaugh and other right wingers are pushing the theory that hydroxychloroquin is a cure for the virus and that Democrats are preventing it's use because we don't want to stop the virus until Trump is defeated. Their listeners believe this stuff. This idea is mainstream in Republican circles.\n", "time": 1596389613.0}, {"subreddit": "democrats", "text": "About the video with a doctor's talking about how a mask don't work and other nonsense about the virus. I work with several people who used to be normal Republicans that watch this video, believed it and were upset by the fact that it was banned. These were just regular people. What is happening?\n", "time": 1596083115.0}, {"subreddit": "democrats", "text": "The reason why certain people refuse to wear a mask is because they believe that Democrats intentionally overreacted fighting the virus causing the economy to tank in an effort to damage Trump's reelection chances. This is really what they believe. Normal regular people believe this.\n", "time": 1596057497.0}, {"subreddit": "democrats", "text": "If the Republicans lose both senate seats in Georgia the party will implode.", "time": 1607203331.0}, {"subreddit": "democrats", "text": "At some point everyone will have to say Trump is spewing nonsense. What he is doing is very bad for Democracy. Millions of people aren't intelligent enough to know that what Trump is saying isn't true.", "time": 1606857044.0}, {"subreddit": "democrats", "text": "Imagine how Sean hannity feels at this moment. He thought he was the president's right-hand man. Not anymore.", "time": 1606612529.0}, {"subreddit": "democrats", "text": "Somewhere in Trump's head, he thought that because the Supreme Court is majority Republican that they would make a crazy vote so he could stay president. I really believe that he thought this. If he was a Supreme Court Justice that is what he would do. I'm willing to bet he doesn't understand why they didn't give him the election being Republicans.", "time": 1606612419.0}, {"subreddit": "democrats", "text": "This is true however they didn't vote for down ballot Democrats.", "time": 1606612300.0}, {"subreddit": "democrats", "text": "They cry like a toddler until Jan 20th when they are evicted from the white house. Unfortunately for the rest of the country that persons supporters will eventually violently riot.", "time": 1605404151.0}, {"subreddit": "democrats", "text": "To be fair the protests over the spring and summer didn't help things and Pelosi could have voted on a lesser stimulus.", "time": 1605403964.0}, {"subreddit": "democrats", "text": "No talk this week about the fact that the head of the post office slowed down the mail during a pandemic to effect a presidential election?", "time": 1605393607.0}, {"subreddit": "democrats", "text": "Trump got killed in Florida because the Cubans were convinced the squad wanted to go to far left which is a system they came from and hated. It's a fact for Florida.", "time": 1605393529.0}, {"subreddit": "democrats", "text": "Zero, Obama is retired from govt.", "time": 1605393425.0}, {"subreddit": "democrats", "text": "So we aren't investigating the fact that the post office slowed down the mail to thwart the results of a presidential election?", "time": 1605393324.0}, {"subreddit": "democrats", "text": "Is it worse than the rape allegations or the dozen sexual assaults? His supporters don't care.", "time": 1605393196.0}, {"subreddit": "democrats", "text": "If we get a Hummer and a bunch of ballots and drive them to the counting center... We will need rifles and ammo.", "time": 1605145574.0}, {"subreddit": "politics", "text": "Voting is enough Don't be a jerk. I have a house, kids, a wife and a job. I don't have time for the other stuff.", "time": 1605132943.0}, {"subreddit": "democrats", "text": "I'm not going to fret over any of this. I did my job I voted. The rest is out of my control. If the election doesn't get certified before Christmas then I will take action again.", "time": 1605132825.0}, {"subreddit": "democrats", "text": "Number one don't pay any attention to any polls that come out of Georgia not a single one, they're all wrong. It's my opinion that all left leaning subreddits should ban polling information until we have a national election where they are within the margin of error.", "time": 1605132743.0}, {"subreddit": "democrats", "text": "Ultimately the guy is still president until January 20th. He's going to be a dick the whole time. And so are many of his supporters. The election won't be officially certified until sometime around December 23rd. There's nothing else we can do. We already voted. It's up to the election officials in each state for each state now. I'm not going to go crazy over this one. It's eventually going to be a done deal.", "time": 1605132672.0}, {"subreddit": "democrats", "text": "Mainly because the election is over. Biden is over 270 and Georgia is going to a hand going recount.", "time": 1605132517.0}, {"subreddit": "politics", "text": "How many people want the Senate majority leader to deny the president his Supreme Court pick. Kavanaugh is illegitimate. Either he resigns or we eventually add two more justices.", "time": 1605130819.0}, {"subreddit": "politics", "text": "Every state election has somewhere between 1 and maybe 200 mistakes every time. Usually it's by accident. It'll be the same for this election.", "time": 1605130725.0}, {"subreddit": "politics", "text": "Did he calculate what happens if you remove Florida or Texas?", "time": 1605130628.0}, {"subreddit": "politics", "text": "Ultimately the guy is still president until January 20th. He's going to be a dick the whole time and so are his supporters. It's over soon but it's not over yet. I already did what I could do, I voted. I'm not going to waste time reading about Trump kicking and screaming for the next 9 weeks.", "time": 1605130553.0}, {"subreddit": "politics", "text": "If my candidate doesn't win it's fraud. If my candidate does win it's not fraud.", "time": 1605130043.0}, {"subreddit": "politics", "text": "I was not happy when Hillary Clinton walked away from the 2016 election without putting up any fight at all. Now I understand why she did it. Because the election is bigger than her democracy is bigger than her.", "time": 1605041357.0}, {"subreddit": "democrats", "text": "That's insane. Don't touch the FDA right now. Let the process work.", "time": 1604880936.0}, {"subreddit": "democrats", "text": "You have learned nothing from this election. 70 million people voted for Trump because they don't want socialist policies. Wake up.", "time": 1604880805.0}, {"subreddit": "democrats", "text": "Bernie is the reason why Trump was elected in the first place and also part of the reason why Trump got 70 million votes. This is a Democratic Party sub. We are running away from socialism. If we don't we will loose power again.", "time": 1604880680.0}, {"subreddit": "democrats", "text": "If I count the pornstars then we have to count the pee pee hookers.", "time": 1604795718.0}, {"subreddit": "democrats", "text": "He won't. We need Georgia.", "time": 1604795653.0}, {"subreddit": "democrats", "text": "Is she the second trophy wife or the third trophy wife? I can't keep track.", "time": 1604795336.0}, {"subreddit": "politics", "text": "Some White House aides were aware earlier in the week that Meadows had become infected but were told to keep it quiet, several people said.", "time": 1604792414.0}, {"subreddit": "politics", "text": "I doubt he will make it that far.", "time": 1604784017.0}, {"subreddit": "democrats", "text": "I think we should stay away from guns and abortion for a long while and focus on renewable energy and global warming plus infrastructure/healthcare. Trump got 70 million votes. We need to stay centered or we will loose it again", "time": 1604783373.0}, {"subreddit": "politics", "text": "This is no fun. Let the front page flood with victory.", "time": 1604768171.0}], "republican_score": 0, "democrat_score": 74}