{"name": "weluckyfew", "posts": [{"subreddit": "democrats", "text": "Fact Check: Video From Georgia Does NOT Show Suitcases Filled With Ballots Suspiciously Pulled From Under A Table; Poll Watchers Were NOT Told To Leave | Lead Stories\n", "time": 1607112358.0}, {"subreddit": "democrats", "text": "The number of tests isn't the only metric that matters - yet another trump failure\n", "time": 1594917543.0}, {"subreddit": "democrats", "text": "Too little, but still too much.\n", "time": 1592755542.0}, {"subreddit": "democrats", "text": "Have never made a meme before - hope you don't mind if I share it here\n", "time": 1592614681.0}, {"subreddit": "democrats", "text": "I would love to see this commercial broadcast constantly\n", "time": 1591207103.0}, {"subreddit": "politics", "text": "Huge money in singing for Jesus!  Big audience - the Left Behind movies made a tidy profit", "time": 1607182612.0}, {"subreddit": "democrats", "text": "That's the problem, a single lie can outweigh 100 truths.  Even when you debunk with evidence it become \"Well, i don't know about all that, but there's definitely something fishy...\"\n\nYa, sometimes when there's a lot of smoke there's some fires - but sometimes it's one guy with a fog machine.", "time": 1607181162.0}, {"subreddit": "democrats", "text": "Sadly, in any other forum you'd have to add the /s", "time": 1607138528.0}, {"subreddit": "democrats", "text": "One person says she was told that, but is contradicted by the workers there.  \n\nThing is, there are already safeguards - you can't just add a bunch of ballots, the computer know how many votes were cast/how many absentee ballots were returned.  The books wouldn't balance.\n\nThat's one of my many annoyances with all this - if it were this easy to commit  fraud then both sides would be doing it every election.", "time": 1607130906.0}, {"subreddit": "democrats", "text": "\"Typical democ rats! Did you even watch the video!?!\"\n\nUm...it's showing people moving boxes.  Someone's accusatory narration over it doesn't prove anything.\n\n\"Oh, sure, you all say you want evidence and then you just ignore it!\"", "time": 1607127739.0}, {"subreddit": "democrats", "text": "I hate to be like that, but every time I chase down their allegations I find out they're total bullshit.  The only times they're not are when it's things that have already been widely reported (like our mayor here in Austin telling people to stay at home in a video he shot from Cabo)", "time": 1607125229.0}, {"subreddit": "democrats", "text": "I try to give them the benefit of the doubt and read some of their posts, but they're idiots.  Someone posts a random video snippet or eyewitness account of something that \"looked suspicious\" to them and they immediately jump to the most extreme conclusion-\n\n\n\"Oh, a 30 second video of people pulling boxes from under a table.  Clearly these are secret, hiden fake ballots and they ordered all the poll watchers out so they wouldn't get caught!\"", "time": 1607115325.0}, {"subreddit": "democrats", "text": "Every time I encounter a Trumper I think it's important to share all the debunking evidence from every one of these scandals.  I don't expect any of it to change their minds, but hopefully it will stop the lies from spreading as far.", "time": 1607112430.0}, {"subreddit": "politics", "text": "(moderately) old guy here:\n\nDidn't know Justin Bieber was still a thing. \n\nHaven't heard anything about Katy Perry in years. \n\nHave heard of Rihanna, but had no idea she was apparently that huge.  \n\nHad to Google Cristiano. (oh, I guess that's more about me not being a sports fan than me being old)", "time": 1607107835.0}, {"subreddit": "politics", "text": "Maybe new residents, but everyone I know here cringes at the whole \"Keep Austin Weird\" nonsense.  We just live our lives the way we do.", "time": 1607006756.0}, {"subreddit": "politics", "text": "true", "time": 1607005092.0}, {"subreddit": "politics", "text": "I hear you, but that's low on my long list as to why it's a crazy idea", "time": 1607004784.0}, {"subreddit": "politics", "text": "If you're trying to get rid of 'liberal' areas you also have to throw in every major city.", "time": 1607004722.0}, {"subreddit": "politics", "text": "True in theory, but not sure how egalitarian California is of late (although my impression is that's due in large part to the fact that everyone wants to live there)", "time": 1607004646.0}, {"subreddit": "politics", "text": "\"The inaugural committee wasted approximately $1 million of charitable funds in overpayment for the use of event space at the Trump Hotel in violation of District law, according to the lawsuit.\"", "time": 1606957193.0}, {"subreddit": "politics", "text": "That's how they do it - flood the zone with bullshit till it overwhelms.  Allegation after allegation.  His people think 'Well, if even half of this is true it's a lot!\"\n\nIt's not half, it's none.  Zero.  Sometimes where there's smoke there's fire, and sometimes it's just one guy running around with a fog machine.", "time": 1606956054.0}, {"subreddit": "politics", "text": "You haven't heard?  The crazies are calling for him to declare martial law, suspend the Constitution, and have a re-vote conducted and overseen by the military.  Cause that's totally what they trained for.", "time": 1606955375.0}, {"subreddit": "politics", "text": "The City of Austin officially petitions to be named a colony of the new Nation of Californiastan.\n\n...um...if it's all the same, we'd like to keep that Texas 'no state income tax' thing though...", "time": 1606955273.0}], "republican_score": 0, "democrat_score": 12}