{"name": "jukinbone", "posts": [{"subreddit": "democrats", "text": "You'll honestly have better luck convincing a brick that it's actually a giraffe.", "time": 1607193651.0}, {"subreddit": "democrats", "text": "I am a Progressive. I also own guns. I was brought up in an ethical hunting culture and was taught from early on how to respect and safely handle guns and pick my hunting companions. Back then, the NRA taught gun safety and how to pick your gun for the sport you want to engage in, whether hunting or maybe target or competition shooting. Guns stayed safely put away unless you were going shooting or hunting. \n\nNowadays, I can't go into a fucking Walmart without wondering who is carrying a glock in their purse or pocket ready to discharge with the wrong move or if some dipshit is going to go off for no reason, reach in their glove box for a pistol and let loose. The second amendment has become nothing more than a divisive, misinterpreted tool.  Nobody is going to take anyone's guns away. Most of us just want to return to some semblance of common sense.", "time": 1606945467.0}, {"subreddit": "democrats", "text": "You won't win. Just remind him that you still have the same moral values he raised you with but somewhere he lost them when he chose to worship trump.", "time": 1606526034.0}, {"subreddit": "democrats", "text": "Nope!! You do a really good job of looking bad without any outside help.", "time": 1604244980.0}, {"subreddit": "democrats", "text": "If you're going to go on there and state facts, just know you'll be banned so make it well worth the trip and sting them where it will hurt.", "time": 1604184145.0}, {"subreddit": "democrats", "text": "On behalf of the planet and its inhabitants, thank you!!!", "time": 1603917180.0}, {"subreddit": "democrats", "text": "This will become a republican issue on Nov. 4.", "time": 1602898011.0}, {"subreddit": "democrats", "text": "Hope your vote successfully gets over trump's wall.", "time": 1602897858.0}, {"subreddit": "democrats", "text": "I did not look at the other states but PA already had over 700,000 more registered democrats than republicans in June 2020. There were also 1.2 million \"other\", presumably mostly independent. The dems just need to vote.\n\nThe other states in the OP may or may not be similar. Maybe someone else can look them up. I'm going to mix a drink right now.", "time": 1602894361.0}, {"subreddit": "democrats", "text": "My father was republican and openly racist. I was brought up that way. Going to college changed all that for me. So, becoming educated made me a Democrat.", "time": 1602568737.0}, {"subreddit": "democrats", "text": "Sorry about your state. Your vote counts though.", "time": 1602563360.0}, {"subreddit": "democrats", "text": "Good for you! My bad..", "time": 1602560713.0}, {"subreddit": "democrats", "text": "Hope you aren't in a swing state. You just voted for trump. That was incredibly stupid.", "time": 1602560156.0}, {"subreddit": "politics", "text": "But the FC geese actually do migrate... from the west side of the highway to the east side of the highway.", "time": 1580418839.0}], "republican_score": 0, "democrat_score": 13}