{"name": "yepotabog", "posts": [{"subreddit": "democrats", "text": "Prodding involves basic persuasion. Cultivation involves instilling rhetoric for possible generations to come. That's why this is so dangerous.\n\n**What happens to the voting block?** They keep their beliefs and now move in silence. The ultimate takedown of our democracy as a whole is here before your very eyes. Call it what you will, but subsiding will not happen by it's lonesome. You'd need to censor all the right wing outlets from spreading divisive rhetoric.", "time": 1607137238.0}, {"subreddit": "democrats", "text": "Obstructing is nothing new for Republiturdz. Trump still being in office is a huge stalemate for him to continue his foolery of installing obscene amounts of paranoia and fear into his voters.\n\nIt's pretty damning. I wish we could halt him now and be done with this in general.", "time": 1607115017.0}, {"subreddit": "democrats", "text": "Nah. Get that out of your head. I live in a red state and these people are currently going nuts in every way imaginable.\n\nWhat they want is for Trump to be in office for another four years. That’s all they care about because that’s all they were cultivated to care about. They disregard anyone that leans left and deem them the issue when it comes to this country in general.", "time": 1607114573.0}, {"subreddit": "democrats", "text": "*Give our people the truth!* lol", "time": 1607114417.0}, {"subreddit": "democrats", "text": "Yes, yes I am. I’m also *super confused* at your response to my prior comment, because it is appalling in of itself. \n\nIt’s amazing how stupid people can get in general. Right wingers love to pin the label of censorship on innocents while they conveniently promote violence and bad behavior. You’ve revealed your bias. There’s no need for me to continue this sad attempt at dialogue from your end.", "time": 1607113117.0}, {"subreddit": "democrats", "text": "I’m super confused why we don’t go after ALL social medias? Why are people fueled by bias against Facebook? Go after Twitter too. \n\nCancel everything that poisons the right wingers at an early age. I’m seeing it everyday here in my red state. They are legit going *NUTS*", "time": 1607083091.0}, {"subreddit": "democrats", "text": "For sure.", "time": 1606894847.0}, {"subreddit": "democrats", "text": "Too funny. Trumps already made the right wingers mad. It doesn’t even matter what happens to him, the damage has been done to our country. I see it more everyday. It sucks to see this from our fellow Americans.", "time": 1606855707.0}, {"subreddit": "democrats", "text": "I hate this piece of *bleep* so much..", "time": 1606855416.0}, {"subreddit": "democrats", "text": "Crazy to read about even man. I can’t believe this stuff is allowed", "time": 1606790084.0}, {"subreddit": "democrats", "text": "He’s losing every lawsuit known to man. When will this fool stop this charade?", "time": 1606788536.0}, {"subreddit": "democrats", "text": "That’s insane. Such deplorable behavior, it’s sickening.", "time": 1606785416.0}, {"subreddit": "democrats", "text": "This deplorable *bleep* deserves to lose his account once he gets vacated.\n\nI wonder why Twitter isn’t hated like Facebook is. Perhaps people should up the ammo on all social medias so to speak. Boycott everything bad, not just Facebook?", "time": 1606761840.0}, {"subreddit": "democrats", "text": "The *appeal to all* mindset is rampant nowadays.\n\nIt seems innocent, but it is highly improbable to succeed.", "time": 1606627210.0}, {"subreddit": "democrats", "text": "He has these people so radicalized, I don't even know if he's capable of calling them off anymore. Most will listen to their cult leader, but all of em'?\n\nI dunno. He definitely exploited the *bleep* out of the antigovernmental/antiestablishment agendas", "time": 1606583545.0}, {"subreddit": "democrats", "text": "Yep. From my experiences with em', straight loons as well. \n\nI suppose this all falls under cultivated behavior. I simply don't see any appeal.", "time": 1606582864.0}, {"subreddit": "democrats", "text": "Yeah, that's hard to say about 73 mil. Your typical Republiturd is honestly braindead, volatile, and hostile in general.\n\nNot a good combo whatsoever. Alt-righters are something else. I live in a red state. I can't wait to be liberated from the divisiveness and harsh rhetoric here.", "time": 1606581228.0}, {"subreddit": "democrats", "text": "How did so many people get duped by a failed businessman with a conniving agenda?", "time": 1606580222.0}, {"subreddit": "democrats", "text": "Sucks we have to go through this dumb *bleep*\n\n*Bleep* this *bleep*. The country is utterly exhausted from Trump’s farce.", "time": 1606570125.0}], "republican_score": 0, "democrat_score": 19}