{"name": "accountofthrown", "posts": [{"subreddit": "democrats", "text": "When is Biden going to Georgia?\n", "time": 1607058192.0}, {"subreddit": "democrats", "text": "Joe Biden (81,264,673) surpasses a 7 million vote lead over the incumbent (74,210,838)\n", "time": 1607049878.0}, {"subreddit": "democrats", "text": "I agree it’s flawed but to pick and chose what political memes and cartoons are acceptable when they have always been, for more than 200 years, A JOKE is ridiculous. I’m not doing anything to make this flawed system worse. We have freedom of speech and I am using my 1st amendment right to express how I feel. Not sure why anyone would defer someone from using their 1st amendment right. The flaw in politics is the money not my damn meme.", "time": 1607114486.0}, {"subreddit": "democrats", "text": "What is so different about what I made and a political cartoon? They would have political cartoons of politicians shooting each other. It’s ok to laugh.", "time": 1607114270.0}, {"subreddit": "democrats", "text": ".... Have you never heard of political cartoons? They’ve been around in America since George Washington. Old white men made them depicting politicians far more violent and “childish” then I did. Are you opposed to the history of political cartoons and modern day memes? Nothing is new.", "time": 1607114108.0}, {"subreddit": "democrats", "text": "You’re a joke. You do support Trump. Explain why white supremacist support him so heavily? Explain why they sell confederate, nazi, and trump flags together. Explain why he would RETWEET A VIDEO OF A MAN SCREAMING WHITE POWER? I made the meme and it is just that; a meme. Take a damn joke and go back to r/donaldtrump you complicit idiot.", "time": 1607113824.0}, {"subreddit": "democrats", "text": "What the hell are you talking about? I have no sympathy for donald or his supporters. They have emboldened hate and violence to an extreme unknown in the last 50 years. He retweeted a video of someone saying white power. He didn’t condemn white supremacist. He knowingly lied to the American people about COVID and was caught on tape. Why would I care about how they feel? FDT", "time": 1607113590.0}, {"subreddit": "democrats", "text": "here here!", "time": 1607065938.0}, {"subreddit": "democrats", "text": "It was a GEORGIA State senate hearing. Even if Georgia miraculously changed to Trump (which it would never) Joe Biden still wins.", "time": 1607062444.0}, {"subreddit": "democrats", "text": "I watched it. What is the is the court going to do? What law is being broke? What is the request of the judges?", "time": 1607062322.0}, {"subreddit": "democrats", "text": "Fair question. I text. 💪🏾", "time": 1607059864.0}, {"subreddit": "democrats", "text": "You can help from your handy dandy phone or anything connected to the internet :) https://www.mobilize.us/codebluewashington/event/362902/ Give it a try! You have no idea how different of a country we could become", "time": 1607059644.0}, {"subreddit": "democrats", "text": "What fraud? Let me explain how court works. There are court hearings and court cases. If you lie in a court hearing it’s 100% ok and unpunishable. That’s where the donald stooges are; they are in hearings. In court cases if you lie under oath you are getting your license to practice removed. Why do you think they are just going to the hearings? It’s so pathetic in PA rudy guilliani said there was no evidence of voter fraud in court because he knows it and lying would get him in trouble. It’s all a joke to raise money.", "time": 1607059379.0}, {"subreddit": "democrats", "text": "What...? You do know that everything that you did would mean nothing if we don’t get the Senate...", "time": 1607059181.0}], "republican_score": 0, "democrat_score": 14}