{"name": "alsoDivergent", "posts": [{"subreddit": "democrats", "text": "If you ever run out of ipecac, Try this alternative to induce massive, uncontrolled projectile vomiting.\n", "time": 1607138960.0}, {"subreddit": "politics", "text": "Lol, I would but I was banned for posting a list of tweets where he lied, in response to someone who claimed that he never lies. Yep.", "time": 1607150255.0}, {"subreddit": "democrats", "text": "> The video shows them opening the ballot boxes, and continue counting after the observers were told they were done\n\nThere is so much deceit and disinformation these days. It's getting kind of surreal. How do so many of these people exist?? \n\n\n[The video showed regular ballot containers on wheels — not suitcases — and both a state investigator and an independent monitor observed counting until it was done for the night, finding no evidence of improper ballots, state and county officials said on Friday.](https://webcache.googleusercontent.com/search?q=cache:q00p9WmsVjcJ:https://www.washingtonpost.com/national/surveillance-tape-breeds-false-fraud-claims-in-georgia/2020/12/04/8e203752-3686-11eb-9699-00d311f13d2d_story.html+&cd=1&hl=en&ct=clnk&gl=ca)\n\n-----\n\n[No one told observers they had to leave, and both an independent monitor and an investigator oversaw the vote count, according to state and county officials. Confusion arose when election workers thought they were done for the night, but then were instructed to continue scanning ballots. But investigators who reviewed the entire surveillance tape confirmed it showed “normal ballot processing,” according to Gabriel Sterling, a top official in the secretary of state’s office.](https://toronto.citynews.ca/2020/12/04/surveillance-tape-breeds-false-fraud-claims-in-georgia/)\n\n-----\n\n[Further sources](https://www.politifact.com/factchecks/2020/dec/04/facebook-posts/no-georgia-election-workers-didnt-kick-out-observe/#sources)", "time": 1607146033.0}, {"subreddit": "democrats", "text": "> omeone's accusatory narration over it doesn't prove anything.\n\nAnd here, you can clearly see them moving the boxes full of baby meat into position for delivery to the pizza parlours. We've also had reports of democrat degenerates cutting the heads off of puppies and replacing them with those of the children of prominent republicans. We think they may be creating some sort of communist vanguard army of man-headed dogs fueled by baby meat pizza. I wish I were, but you just can't make this stuff up.", "time": 1607137678.0}, {"subreddit": "democrats", "text": "in direct view of at least 4 cctv cameras, no less.", "time": 1607116159.0}, {"subreddit": "politics", "text": "> The fear was that Obama would use FEMA to set up non disaster related camps and then place political dissenters into them\n\nI remember that shit well. Interesting to be older and realize all those doomy predictions were nothing but smoke, and continue to be nothing but smoke.", "time": 1606934638.0}, {"subreddit": "politics", "text": "[Trump's attacks against a biased liberal media obscure one fact: it doesn't exist](https://www.theguardian.com/commentisfree/2018/jan/02/trump-biased-liberal-media-television)\n\nIn the difficult financial reality faced by today’s media, many outlets and their reporters are more beholden than ever to billionaires and their large corporations. Both those things, Trump’s broadsides against Jeff Bezos notwithstanding, skew conservative. \n\n---------\n\n[Debunking the myth of the ‘liberal media’](https://www.newsobserver.com/opinion/op-ed/article170317567.html)\n\nThis argument has been around for decades, and the evidence for it has been built on misleading evidence and faulty logic. The idea of a “liberal media” is, in fact, a myth, one that has enabled the rise of a right-wing media infrastructure that helped to sow doubts and misinformation during the last election.\n\n---------\n\n[There is no liberal media bias in which news stories political journalists choose to cover](https://advances.sciencemag.org/content/6/14/eaay9344)\n\ncontrary to popular narratives and despite the fact that journalists skew to the left, there is little to no liberal bias in what reporters choose to cover. Our well-powered correspondence experiment allows us to confidently rule out even very slight biases against conservatives. \n\n---------\n\n[Claims of ideological bias among the media may be overblown](https://theconversation.com/claims-of-ideological-bias-among-the-media-may-be-overblown-135617)\n\nContrary to President Trump’s claims, we find little blatant news bias in what the media covers and how it covers it. While the nature of politics encourages politicians to undermine negative coverage through claims of bias, our research suggests that ideological bias in U.S. newspapers is largely nonexistent.\n\n---------\n\n[THERE’S NO LIBERAL BIAS IN WHAT THE MEDIA CHOOSES TO COVER](https://www.dataforprogress.org/blog/2020/4/7/no-liberal-bias-in-media)\n\nIn short, despite being overwhelmingly liberal on a personal level, journalists show a great deal of impartiality in the types of candidates that they choose to write about.\n\nOur findings are vitally important in the current political climate, where journalists face harsh criticism from the president and his allies as well as increased violence worldwide.\n\nOur work suggests that this hostility is unwarranted. Those accusing the media of bias in what they choose to cover are wrong. The media is not biased in the stories they choose to cover.\n\n---------\n\n[The Media Isn't Biased Against Trump. It's Biased For Him.](https://nymag.com/intelligencer/article/media-isnt-biased-against-trump-biden-liberal-news.html)\n\nWhen conservatives complain about Trump’s coverage, they are decrying not the standards being set but the outcomes. If their president is unable to clear even the lower bar set before him, it must be lowered further still, so that he can hop over it at least occasionally.\n\n---------\n\n[What Liberal Media? The Truth About Bias and the News](https://digitalcommons.sacredheart.edu/cgi/viewcontent.cgi?referer=https://www.google.com/&httpsredir=1&article=1064&context=shureview&source=post_page---------------------------)\n\nIt's a little imprecise to call it a lie. It's a myth. But it's a useful\nmyth. I know this is a school with a lot of very strong athletic programs.\nOne of the former heads of the Republican Nation Committee, a man\nby the name of Rich Bond, has admitted that he doesn't think the\nmedia are liberal, but he said it all the time when he was the chairman\nof the Republican Party\n\n---------\n\n[Not fake news: Major study finds no \"liberal bias\" in media — but there are other problems](https://www.salon.com/2020/01/05/not-fake-news-major-study-finds-no-liberal-bias-in-media-but-there-are-other-problems/)\n\nIn short, despite being dominantly liberals/Democrats, journalists do not seem to be exhibiting liberal media bias (or conservative media bias) in what they choose to cover. This null is vitally important — showing that overall, journalists do not display political gatekeeping bias in the stories they choose to cover.\n\n---------\n\n[Attacking the press for liberal bias is a staple of Republican campaigns -- and it all began in 1964](https://www.cnn.com/2020/02/29/opinions/lyndon-johnson-barry-goldwater-liberal-media-bias-hemmer/index.html)\n\nUnder Trump, the purpose of the media attack has become even more apparent: to delegitimize all news that isn't subservient to him, while encouraging supporters to trust only one source — Donald Trump.\nPolitical journalism isn't above criticism, far from it. But for the right, attacking the media is less about improving coverage or pointing out actual errors and biases, and more about eliminating alternative sources of information and rallying a base willing to ignore any news that comes from outside the movement.", "time": 1606896953.0}, {"subreddit": "politics", "text": "The stages of grief. You have a ways to go.\n\nDenial <-- you\n\nAnger\n\nBargaining\n\nDespair\n\nAcceptance", "time": 1606818971.0}, {"subreddit": "politics", "text": "lol, you'll have to take it up with DHS and the FBI, I'm sure they'll be relieved you caught their error.", "time": 1606817810.0}, {"subreddit": "politics", "text": "> Does that 0 over the last 10 years include the 2 in the CHAZ?\n\nMost of those are not the result of ideological motivations. The right seem to really enjoy lumping every local conflict that happened within 10 miles of a protest as 'leftist violence'. So, with a couple of nutcases who chose to associate themselves with Antifa and or cop haters, congratulations, you have provided nearly enough examples to count on one hand. \n\nAlso, it is not surprising, given their love of twisting information, that right wing apologists never like to acknowledge that most of the protest events [were in fact peaceful](https://www.usatoday.com/in-depth/news/nation/2020/10/24/trump-claims-blm-protests-violent-but-majority-peaceful/3640564001/), and that those which turned violent were those [that were crashed](https://www.kansascity.com/news/local/article243553662.html) by [right wing extremists](https://webcache.googleusercontent.com/search?q=cache:bGtLQhSsS8IJ:https://www.washingtonpost.com/politics/2020/06/22/who-caused-violence-protests-its-not-antifa/+&cd=4&hl=en&ct=clnk&gl=ca), and [local looters](https://www.nbclosangeles.com/investigations/locals-make-up-bulk-of-looting-arrests/2372437/). But hey, lump it all together and gleefully circle jerk about how [democrats are burning cities](https://www.lawfareblog.com/flood-online-misinformation-around-george-floyd-protests). \n\nSince we're keeping score, let's tally up. Oh look, here's what, [about 105](https://en.wikipedia.org/wiki/Right-wing_terrorism#Post-2001) deaths from right wing violence, since 2001 alone.\n\nhttps://en.wikipedia.org/wiki/2019_El_Paso_shooting\n\nhttps://en.wikipedia.org/wiki/Knoxville_Unitarian_Universalist_church_shooting\n\nhttps://en.wikipedia.org/wiki/Wisconsin_Sikh_temple_shooting\n\nhttps://en.wikipedia.org/wiki/Murder_of_Jo_Cox\n\nhttps://en.wikipedia.org/wiki/Charleston_church_shooting\n\nhttps://en.wikipedia.org/wiki/Murder_of_Timothy_Caughman\n\nhttps://en.wikipedia.org/wiki/2017_Portland_train_attack\n\nhttps://en.wikipedia.org/wiki/Charlottesville_car_attack\n\nhttps://en.wikipedia.org/wiki/Murder_of_Blaze_Bernstein\n\nhttps://en.wikipedia.org/wiki/Pittsburgh_synagogue_shooting\n\nhttps://en.wikipedia.org/wiki/Poway_synagogue_shooting\n\nhttps://en.wikipedia.org/wiki/2020_boogaloo_killings\n\n--------\n[White supremacists, Antifa: U of T experts on protesters in Charlottesville](https://www.utoronto.ca/news/white-supremacists-antifa-u-t-experts-protesters-charlottesville)\n\n\"The FBI has been warning about the threat of white nationalists and white supremacists for some time. They've said that white supremacists pose a threat to the nation, and they actually highlighted the fact that white supremacists have been quite effective in infiltrating American law enforcement. This is something that is not new. It is ongoing, and it's very dangerous.\"\n\nIn the U.S., far-right and nationalist organizations are heavily armed and are disproportionately the progenitors of violence. Antifa arise as a reaction to far-right movements and mostly seek to clash with them.\"\n\n---------\n\n[Suspected boogaloo trio planned violence like military operation]\n(https://www.reviewjournal.com/investigations/suspected-boogaloo-trio-planned-violence-like-military-operation-2053385/)\n\n\"Group members planned to set off devices at the beginning of the protest to cause panic and eventually a confrontation between police and the protesters, according to the report. But they ended up abandoning the plan in favor of efforts to firebomb an NV Energy substation and a federal ranger station at the Lake Mead National Recreation Area.\n\nThe agent was next placed with members of the group on May 30, the day the three men were arrested before the downtown Black Lives Matter protest, court documents show. The FBI had learned that the trio was prepared to toss Molotov cocktails at police.\"\n\n-------\n\n[Analysts Say Armed Groups At Protests Raise Specter Of A 'Street War'](https://www.npr.org/2020/07/30/896770081/analysts-say-armed-groups-at-protests-raise-specter-of-a-street-war)\n\n\"Analysts say far-right and anti-government agitators are either attacking protesters or trying to glom onto their cause to push their own agendas. Other extremists see a chance to trigger a violent revolution; still others, a race war.\"\n\n--------\n\n[Violence by far right is among US’s most dangerous terrorist threats, study finds]\n(https://www.theguardian.com/world/2020/jun/27/us-far-right-violence-terrorist-threat-analysis)\n\n\"Violence by far-right groups and individuals has emerged as one of the most dangerous terrorist threats faced by US law enforcement and triggered a wave of warnings and arrests of people associated with those extremist movements.\"\n\n-----------------------\n\n[Victims of the Oklahoma City bombing]\n(https://web.archive.org/web/20120215065450/http://www.usatoday.com/news/nation/2001-06-11-mcveigh-victims.htm)\n\n -------------------------------\n\n[Right-Wing Domestic Terrorism Has Increased By More Than 300% Since Trump Took Office: Report](https://lawandcrime.com/high-profile/right-wing-domestic-terrorism-has-increased-by-more-than-300-since-trump-took-office-report/)\n\n-------------------------\n\n[Far-right extremists have hatched far more terror plots than anyone else in recent years]\n(https://www.revealnews.org/article/home-is-where-the-hate-is/)\n\n------------------------------------------\n\n[Homegrown Terror: Explore 9 years of domestic terrorism plots and attacks]\n(https://apps.revealnews.org/homegrown-terror/)\n\n------------------------------------------\n\n[MAPPING PARAMILITARY AND FAR-RIGHT THREATS TO RACIAL JUSTICE]\n(https://www.irehr.org/2020/06/19/mapping-paramilitary-and-far-right-threats-to-racial-justice/)\n\n------------------------------------------\n\n[Demonstrations & Political Violence in America: New Data for Summer 2020]\n(https://acleddata.com/2020/09/03/demonstrations-political-violence-in-america-new-data-for-summer-2020/)\n\n------------------------\n\n[The Rise of Far-Right Extremism in the United States]\n(https://www.csis.org/analysis/rise-far-right-extremism-united-states)\n\n\"Right-wing extremism in the United States appears to be growing. The number of terrorist attacks by far-right perpetrators rose over the past decade, more than quadrupling between 2016 and 2017.\"\n\"Right-wing attacks caused all fatalities resulting from terrorist attacks in 1996, 1998, 1999, 2006, 2008, 2010, 2011, and 2012. They were responsible for more than 90 percent of fatalities in 1995, 2018, and 2019.\"\n\n--------\n\n[The Organizational Dynamics of Far‐Right Hate Groups in the United States]\n(https://www.dhs.gov/sites/default/files/publications/944_OPSR_TEVUS_Comparing-Violent-Nonviolent-Far-Right-Hate-Groups_Dec2011-508.pdf)\n\n\"There is empirical and anecdotal evidence that far-right hate groups pose a significant threat to public safety. Far-right extremists commit many violent attacks, and some scholars conclude that far-right extremists, especially groups motivated by religious ideology, are strong candidates to commit future acts using weapons of mass destruction (Gurr & Cole, 2002; Tucker, 2001).\n.\n.\n.\nSimilarly, a national survey of State law enforcement agencies concluded that there was significant concern about the activities of far-right extremist groups, and that more states reported the presence of far-right militia groups (92%), neo-Nazis (89%), and racist skinheads (89%) in their jurisdictions than Jihadi extremist groups (65%) (Freilich, Chermak & Simone, 2009)\"\n\n-----\n\n[The Escalating Terrorism Problem in the United States]\n(https://www.csis.org/analysis/escalating-terrorism-problem-united-states)\n\n\"This analysis makes several arguments. First, far-right terrorism has significantly outpaced terrorism from other types of perpetrators, including from far-left networks and individuals inspired by the Islamic State and al-Qaeda.\"\n\n------\n\n[Part IV. What is the Threat to the United States Today?]\n(https://www.newamerica.org/in-depth/terrorism-in-america/what-threat-united-states-today/)\n\n\"In the almost 19 years since 9/11, jihadists have killed 107 people inside the United States. This death toll is similar to that from far-right terrorism (consisting of anti-government, militia, white supremacist, and anti-abortion violence), which has killed 114 people. The United States has also seen attacks in recent years inspired by black separatist/nationalist ideology and ideological misogyny. Individuals motivated by these ideologies have killed twelve and nine people respectively and those with Far-Left views have killed one person.\"\n\n----------", "time": 1606817095.0}, {"subreddit": "politics", "text": "> I honestly believe there was cheating in this election. It just feels strange to me. The past 3 election felt very normal.\n\nThankfully the courts still choose to look at evidence, not beliefs and feelings.", "time": 1606160036.0}, {"subreddit": "politics", "text": "Except, there was no [family separation policy under Obama.](https://www.statesman.com/news/20190625/fact-check-did-obama-have-family-separation-policy-before-trump)\n\nPeople who continue to push this disinformation are fucking disgusting. The family separation policy is squarely on the Trump administrations shoulders. The cages were built by the Obama administration, but *not* for this purpose. \n\n[‘Kids in cages’: It’s true that Obama built the cages at the border. But Trump’s ‘zero tolerance’ immigration policy had no precedent.](https://webcache.googleusercontent.com/search?q=cache:YLY96Hqt_o4J:https://www.washingtonpost.com/immigration/kids-in-cages-debate-trump-obama/2020/10/23/8ff96f3c-1532-11eb-82af-864652063d61_story.html+&cd=1&hl=en&ct=clnk&gl=ca)\n\n\"By May 2014, thousands of Central Americans were streaming into Texas, overwhelming U.S. agents and leaving Border Patrol detention cells jampacked. More than 4,000 adults and children were arriving a day at the peak of the crisis.\n\nBorder Patrol stations were so overcrowded that agents began using the “sally port” areas outside the stations — little more than outdoor garages — as holding pens. Mothers with babies and young children were left for hours in 90-plus-degree heat, sprawled out on concrete floors with little more than bologna sandwiches and Kool-Aid.\"\n\n[Here Are the Facts About President Trump's Family Separation Policy](https://time.com/5314769/family-separation-policy-donald-trump/)\n\n\"In May, Sessions announced that the U.S. would take a stricter stance on illegal crossings at the Mexican border which would result in parents and children being separated, rather than keeping them together in detention centers.\n\n“If you are smuggling a child then we will prosecute you, and that child will be separated from you as required by law,” Sessions said at a law enforcement event in Scottsdale, Ariz. “If you don’t like that, then don’t smuggle children over our border.”\n\nFrom April 19 to May 31, some 1,995 children were separated from roughly as many adults at the U.S. border, officials announced on Friday.\"\n\n--------------------------------\n\n[Jeff Sessions: Parents and Children Illegally Crossing the Border Will Be Separated](https://time.com/5268572/jeff-sessions-illegal-border-separated/)\n\n--------------------------\n\n[Q&A: Trump Administration’s \"Zero-Tolerance\" Immigration Policy](https://www.hrw.org/news/2018/08/16/qa-trump-administrations-zero-tolerance-immigration-policy)\n\n\"On April 6, 2018, US Attorney General Jeff Sessions announced a new “zero-tolerance” policy intended to ramp-up criminal prosecution of people caught entering the United States illegally. Soon afterward, news outlets began to report that unauthorized immigrant parents traveling with their children were being criminally prosecuted and separated from their children\"\n\n------------------------\n\n[The parents of 545 children separated at the border still haven’t been found](https://www.texastribune.org/2020/10/21/donald-trump-immigration-parents-children-separated/)\n\n\"Under Trump’s official zero-tolerance policy, more than 2,800 families were separated in 2018. When public uproar forced the Trump administration to reverse the policy, many of those families — about 5 in 6 — were still in the United States, including in detention.\"\n\n--------------------------\n\n[How The Trump Administration's 'Zero Tolerance' Policy Changed The Immigration Debate](https://www.npr.org/2019/06/20/734496862/how-the-trump-administrations-zero-tolerance-policy-changed-the-immigration-deba)\n\n\"It's been one year since President Trump signed an executive order that ended the policy of separating immigrant parents and children at the border; that order came after six weeks of international outcry. While the policy was in effect, more than 2,500 minors were taken from their parents or caregivers. Family separation remains one of the most deeply unpopular actions this president has taken since he's been in office.\"\n\n-----------------------\n\n[Trump's family separations at border played out 'exactly how it was designed to': journalist Jacob Soboroff](https://www.cbc.ca/radio/thecurrent/the-current-for-sept-18-2020-1.5729242/trump-s-family-separations-at-border-played-out-exactly-how-it-was-designed-to-journalist-jacob-soboroff-1.5692142)\n\n\"The Trump administration knew its \"zero-tolerance\" policy would separate thousands of children from their parents, yet it \"ignored the warnings from multiple agencies on multiple fronts\" to keep track of them to reunite them, says journalist Jacob Soboroff, who was among the first to report on family separations at the border.\"\n\n--------------\n\n[US border: Who decided to separate families?](https://www.bbc.com/news/world-us-canada-44303556)\n\n\"The claim: US President Donald Trump has repeated his assertion that he inherited - and ended - a policy from President Obama that separates children from parents who cross the US-Mexico border illegally.\n\nVerdict: The policy was introduced under the Trump administration. He subsequently ended that policy, but some family separations have continued to take place.\"\n\n---------------\n\nhttps://en.wikipedia.org/wiki/Trump_administration_family_separation_policy\n\n\"The Trump administration family separation policy is an aspect of US President Donald Trump's immigration policy. The policy was presented to the public as a \"zero tolerance\" approach intended to deter illegal immigration and to encourage tougher legislation.[1][2][3][4] It was officially adopted across the entire US–Mexico border from April 2018 until June 2018.[5][6][7] Later investigations found that the practice of family separations had begun a year prior to the public announcement.[8] Under the policy, federal authorities separated children from parents or guardians with whom they had entered the US.[6][9][10] The adults were prosecuted and held in federal jails or deported, and the children placed under the supervision of the US Department of Health and Human Services.[6] In January 2020 the SPLC reported that the official government number of children separated from their parents or guardians was 4,368.[11] In January 2020, the American Civil Liberties Union reported that more than 1,100 families have been separated since June 2018, the date that the administration said they would no longer separate children from their parents.[12]\"", "time": 1605501069.0}, {"subreddit": "politics", "text": "> Burning the business to the ground in protest is not good. It wasn't conservatives burning businesses for the past months\n\nStop spreading misinformation. The world is not so dick and jane. Unequivocal statements like this aren't good. It's no secret there was way more involvement in the violence by the right than they will ever admit. \n\n\n[Far-Right Infiltrators and Agitators in George Floyd Protests:\nIndicators of White Supremacists](https://docs.house.gov/meetings/JU/JU00/20200610/110775/HHRG-116-JU00-20200610-SD019.pdf)\n\"shared stories on social media that the May 27 looting and arson at\nAutoZone by an unidentified man in a gas mask carrying an open umbrella, dubbed\numbrellaman, was not necessarily a protester but could be an agent provocateur or\nmember of the police. In video posted to YouTube, while this man smashed windows with a hammer, protesters at the scene accused him of being an outsider and began to film him.\"\n\n[Officials Say White Supremacists Infiltrated Black Lives Matter Protest in Richmond to Instigate Riots](https://www.complex.com/life/2020/07/white-supremacists-infiltrated-black-lives-matter-protest-in-richmond-instigate-riots)\n\"The Boogaloo boys, who were photographed attending the Richmond protests, are a group of anti-government right-wing extremists who have taken advantage of social justice activism to cause chaos. A member of the group, which promotes cop-killing rhetoric, is currently facing murder charges for the death of two law enforcement officers in June during Black Lives Matter rallies in California.\"\n\n[Who caused the violence at protests? It wasn’t antifa.](https://webcache.googleusercontent.com/search?q=cache:bGtLQhSsS8IJ:https://www.washingtonpost.com/politics/2020/06/22/who-caused-violence-protests-its-not-antifa/+&cd=9&hl=en&ct=clnk&gl=ca)\n\n[Analysts Say Armed Groups At Protests Raise Specter Of A 'Street War'](https://www.npr.org/2020/07/30/896770081/analysts-say-armed-groups-at-protests-raise-specter-of-a-street-war)\n\n\"Analysts say far-right and anti-government agitators are either attacking protesters or trying to glom onto their cause to push their own agendas. Other extremists see a chance to trigger a violent revolution; still others, a race war.\"\n\n[Between 24 May and 22 August, ACLED records more than 10,600 demonstration events across the country. Over 10,100 of these — or nearly 95% — involve peaceful protesters. Fewer than 570 — or approximately 5% — involve demonstrators engaging in violence. Despite the media focus on looting and vandalism, however, there is little evidence to suggest that demonstrators have engaged in widespread violence. In some cases where demonstrations did turn violent, there are reports of agents provocateurs — or infiltrators — instigating the violence. ](https://acleddata.com/2020/09/03/demonstrations-political-violence-in-america-new-data-for-summer-2020/)\n\n[Revealed: pro-Trump activists plotted violence ahead of Portland rallies](\nhttps://www.theguardian.com/world/2020/sep/23/oregon-portland-pro-trump-protests-violence-texts)\n\n\n[Texas member of Boogaloo Bois charged with opening fire on Minneapolis police precinct during protests over George Floyd\nFeds say Texas adherent of far-right group fired on precinct building, conspired with cop killer to ignite civil war. ](https://www.startribune.com/charges-boogaloo-bois-fired-on-mpls-precinct-shouted-justice-for-floyd/572843802/)\n\n[Read More: Fact Check: Did Antifa Incite Violence & Riots In Michigan?](https://wbckfm.com/fact-check-did-antifa-incite-violence-riots-in-michigan/)\n\n[Why some counterprotests to Black Lives Matter are turning violent Counterprotester clashes are detracting from one of the largest social justice movements in history.](https://www.vox.com/2020/9/14/21432330/counterprotests-black-lives-matter-violent)\n\n[As Trump warns of leftist violence, a dangerous threat emerges from the right-wing boogaloo movement](https://webcache.googleusercontent.com/search?q=cache:i5lUc52Vl1YJ:https://www.washingtonpost.com/technology/2020/06/17/trump-warns-leftist-violence-dangerous-threat-emerges-right-wing-boogaloo-movement/+&cd=2&hl=en&ct=clnk&gl=ca)\n\n[White nationalist group posing as antifa called for violence on Twitter\nOther misinformation and misleading claims spread across Twitter on Sunday night and into Monday related to the protests.](https://www.nbcnews.com/tech/security/twitter-takes-down-washington-protest-disinformation-bot-behavior-n1221456)\n\n\n[Far-right extremists keep showing up at BLM protests. Are they behind the violence? ]\n(https://www.kansascity.com/news/local/article243553662.html)\n\n[Violent counter-protesters mobbed a small-town BLM demonstration in Ohio amid false rumors of antifa](https://www.insider.com/violent-counter-protesters-bethel-ohio-black-lives-matter-protest-antifa-2020-6)\n\n\"During the clash, counter-protesters livestreamed false claims that antifa was involved, echoing similar misinformation seen when targeting other small-town protests.\"\n\n[The Flood of Online Misinformation Around the George Floyd Protests](https://www.lawfareblog.com/flood-online-misinformation-around-george-floyd-protests)\n\"One of the fake accounts (@Antifa_US) called for violence in support of the Black Lives Matter movement—a message that was amplified when Donald Trump Jr. shared a screenshot of @Antifa_US’s with his 2.8 million Twitter followers as evidence that antifa was violent and dangerous. While Trump Jr. likely acted without realizing that the account was fake, his tweet radically increased the influence of Identity Evropa’s disinformation campaign. In another instance, a number of known white supremacists, members of the Proud Boys, were photographed at protests in Portland wearing the all-black clothing typically associated with antifa groups.\"", "time": 1605179696.0}, {"subreddit": "politics", "text": "[Little evidence of antifa links in U.S. prosecutions of those charged in protest violence](https://nationalpost.com/pmn/entertainment-pmn/little-evidence-of-antifa-links-in-u-s-prosecutions-of-those-charged-in-protest-violence)\n\n\"Looting and violence broke out at some of the hundreds of largely peaceful demonstrations over the past week sparked by the May 25 death of George Floyd, an African American, after a white Minneapolis police officer pinned him with a knee to the neck for almost nine minutes.\"\n.\n\n\"Only one group was called out by name in a federal complaint: the so-called boogaloo movement, whose followers, according to prosecutors, believe in an impending civil war.\"\n\n------\n\n[Locals Make Up Bulk of Looting Arrests\nArrest data reviewed by the NBC4 I-Team shows most of those nabbed by police during unrest Friday and Saturday nights live in Southern California.] \n(https://www.nbclosangeles.com/investigations/locals-make-up-bulk-of-looting-arrests/2372437/)\n\n------\n\n[Who caused the violence at protests? It wasn’t antifa.](https://webcache.googleusercontent.com/search?q=cache:bGtLQhSsS8IJ:https://www.washingtonpost.com/politics/2020/06/22/who-caused-violence-protests-its-not-antifa/+&cd=4&hl=en&ct=clnk&gl=ca)\n\n--------\n\n[Part IV. What is the Threat to the United States Today?]\n(https://www.newamerica.org/in-depth/terrorism-in-america/what-threat-united-states-today/)\n\n\"In the almost 19 years since 9/11, jihadists have killed 107 people inside the United States. This death toll is similar to that from far-right terrorism (consisting of anti-government, militia, white supremacist, and anti-abortion violence), which has killed 114 people. The United States has also seen attacks in recent years inspired by black separatist/nationalist ideology and ideological misogyny. Individuals motivated by these ideologies have killed twelve and nine people respectively and those with Far-Left views have killed one person.\"\n\n----------\n\n[Rightwing Extremism: Current Economic and Political Climate Fueling Resurgence in Radicalization and Recruitment]\n(https://fas.org/irp/eprint/rightwing.pdf)\n\n\"A recent example of the potential violence associated with a rise in rightwing extremism may be found in the shooting deaths of three police officers in Pittsburgh, Pennsylvania, on 4 April 2009.  The alleged gunman’s reaction reportedly was influenced by his racist ideology and belief in antigovernment conspiracy theories related to gun confiscations, citizen detention camps, and a Jewish-controlled “one world government.\"\n\n------\n\n[White nationalist group posing as antifa called for violence on Twitter\nOther misinformation and misleading claims spread across Twitter on Sunday night and into Monday related to the protests.](https://www.nbcnews.com/tech/security/twitter-takes-down-washington-protest-disinformation-bot-behavior-n1221456)\n\n------\n\n[Far-right extremists keep showing up at BLM protests. Are they behind the violence? ]\n(https://www.kansascity.com/news/local/article243553662.html)\n\n------\n\n[Violent counter-protesters mobbed a small-town BLM demonstration in Ohio amid false rumors of antifa](https://www.insider.com/violent-counter-protesters-bethel-ohio-black-lives-matter-protest-antifa-2020-6)\n\n\"During the clash, counter-protesters livestreamed false claims that antifa was involved, echoing similar misinformation seen when targeting other small-town protests.\"\n\n------\n\n[Rightwing vigilantes on armed patrol after fake rumours of antifa threat](https://www.theguardian.com/us-news/2020/jun/06/rightwing-vigilante-armed-antifa-protests)\n\n------\n\n[Suspected boogaloo trio planned violence like military operation](https://www.reviewjournal.com/investigations/suspected-boogaloo-trio-planned-violence-like-military-operation-2053385/)\n\n------\n\n[Far-right smear campaign against Antifa exposed by Bellingca](https://www.bbc.com/news/blogs-trending-41036631)\n\n--------\n\n[The Flood of Online Misinformation Around the George Floyd Protests](https://www.lawfareblog.com/flood-online-misinformation-around-george-floyd-protests)\n\"One of the fake accounts (@Antifa_US) called for violence in support of the Black Lives Matter movement—a message that was amplified when Donald Trump Jr. shared a screenshot of @Antifa_US’s with his 2.8 million Twitter followers as evidence that antifa was violent and dangerous. While Trump Jr. likely acted without realizing that the account was fake, his tweet radically increased the influence of Identity Evropa’s disinformation campaign. In another instance, a number of known white supremacists, members of the Proud Boys, were photographed at protests in Portland wearing the all-black clothing typically associated with antifa groups.\"\n\n------\n\n[Revealed: pro-Trump activists plotted violence ahead of Portland rallies]\n(https://www.theguardian.com/world/2020/sep/23/oregon-portland-pro-trump-protests-violence-texts)\n\n------\n\n[LEAKED DOCUMENTS SHOW POLICE KNEW FAR-RIGHT EXTREMISTS WERE THE REAL THREAT AT PROTESTS, NOT “ANTIFA”]\n(https://theintercept.com/2020/07/15/george-floyd-protests-police-far-right-antifa/)\n\n------\n\n[That viral photo of an antifa protester assaulting a police officer is fake](https://www.fastcompany.com/40455091/that-viral-photo-of-an-antifa-protester-assaulting-a-police-officer-is-fake)\n\n------\n\n[MAPPING PARAMILITARY AND FAR-RIGHT THREATS TO RACIAL JUSTICE]\n(https://www.irehr.org/2020/06/19/mapping-paramilitary-and-far-right-threats-to-racial-justice/)\n\n------\n\n[Demonstrations & Political Violence in America: New Data for Summer 2020]\n(https://acleddata.com/2020/09/03/demonstrations-political-violence-in-america-new-data-for-summer-2020/)\n\n------\n\n[Victims of the Oklahoma City bombing]\n(https://web.archive.org/web/20120215065450/http://www.usatoday.com/news/nation/2001-06-11-mcveigh-victims.htm)\n\n--------\n\nhttps://en.wikipedia.org/wiki/2019_El_Paso_shooting\n\nhttps://en.wikipedia.org/wiki/Knoxville_Unitarian_Universalist_church_shooting\n\nhttps://en.wikipedia.org/wiki/Wisconsin_Sikh_temple_shooting\n\nhttps://en.wikipedia.org/wiki/Murder_of_Jo_Cox\n\nhttps://en.wikipedia.org/wiki/Charleston_church_shooting\n\nhttps://en.wikipedia.org/wiki/Murder_of_Timothy_Caughman\n\nhttps://en.wikipedia.org/wiki/2017_Portland_train_attack\n\nhttps://en.wikipedia.org/wiki/Charlottesville_car_attack\n\nhttps://en.wikipedia.org/wiki/Murder_of_Blaze_Bernstein\n\nhttps://en.wikipedia.org/wiki/Pittsburgh_synagogue_shooting\n\nhttps://en.wikipedia.org/wiki/Poway_synagogue_shooting\n\nhttps://en.wikipedia.org/wiki/2020_boogaloo_killings\n\n\n\n--------------\n\n[All the Times Trump Has Called for Violence at His Rallies]\n(https://www.youtube.com/watch?v=WIs2L2nUL-0&feature=youtu.be)\n\n[RWW News: Gavin McInnes' History of Violent Rhetoric (Supercut)]\n(https://www.youtube.com/watch?v=6SJGSrYLWxQ)\n\n[Trump Supporters Violently Attack Black Lives Matter Supporters]\n(https://www.youtube.com/watch?v=WQ7ZPmpTDz4)\n\n[Gavin McInnes & his GANG of Proud Boy thugs instigate violence against protestors]\n(https://www.youtube.com/watch?v=clhJT9HgjOE)\n\n[Pastor ‘heart-broken’ seeing residents ‘subjected to violence’ during Proud Boys rally]\n(https://www.youtube.com/watch?v=YwioMlIhoyo)\n\n[Inside the ‘Boogaloos’: Extremist movement makes its presence known at demonstrations](https://www.youtube.com/watch?v=jHyYhUMLPaI)\n\n[Army veteran hurt in violent clash with Proud Boys in Kalamazoo]\n(https://www.youtube.com/watch?v=ZxptRNv2HmI)\n\n['Proud Boys' have a history of violence in DC region]\n(https://www.youtube.com/watch?v=dERH_yZEcQw)\n\n[Richmond Officials Say White Supremacists Caused Violence at Protests]\n(https://www.youtube.com/watch?v=yU314klq1O0)\n\n[Men Tied To 'boogaloo' Movement Conspired To Spark Protest Violence ...](https://www.youtube.com/watch?v=F7uBVOzwFaQ)\n\n[Fight breaks out as Proud Boys wave flags (woman assaulted by mob of bitch ass pussies)]\n(https://www.youtube.com/watch?v=mKGr3s_Oi48)\n\n[Boogaloo Boys' infiltrate peaceful protests at Alamo](https://www.youtube.com/watch?v=RcjBnH7yL9Y)\n\n[Proud Boys Leaving Republican Club After Gavin McInnes Event and Brutal Assault 10/12/18]\n(https://www.youtube.com/watch?v=-7-K4-ryBSE)\n\n[Watch what happened when CNN reporter went to Proud Boys rally]\n(https://www.youtube.com/watch?v=pV4ItwBSwLI)\n\n[Proud boys attack CHAZ/ CHOP]\n(https://www.youtube.com/watch?v=SfmjN-TqzLU)\n\n[Proud Boys Attack in Portland, Antifascists Fight Back]\n(https://www.youtube.com/watch?v=MtBOKQyLXck)\n\n[Right-Wing 'Proud Boys' Caught On Video Assaulting Protestors]\n(https://www.youtube.com/watch?v=3HBPWI7Qfus)", "time": 1605178724.0}, {"subreddit": "politics", "text": "> Another Democrat justify left wing terrorism. Antifa and Isis are just alike.\n> \n> Another Democrat denying the Democrats own history of racism, and anti Semitic beliefs.\n> \n> You should quit watching CNN.\n\nAnother hypocrite that thinks left wing violence doesn't pale in comparison to that of the right. Another weasel that denies the extensive involvement of right wing actors in the protest violence so commonly blamed on protesters. You should broaden your own news media consumption. What a fucked up irony that you compare ISIS to Antifa. Right wingers are responsible for hundreds of American deaths from last 25 years. More than fucking jihadists. \n\n[Right-wing terrorism](https://en.wikipedia.org/wiki/Terrorism_in_the_United_States#2020%E2%80%93present)\n\n---------\n\n[The Rise of Far-Right Extremism in the United States]\n(https://www.csis.org/analysis/rise-far-right-extremism-united-states)\n\n\"Right-wing extremism in the United States appears to be growing. The number of terrorist attacks by far-right perpetrators rose over the past decade, more than quadrupling between 2016 and 2017.\"\n\"Right-wing attacks caused all fatalities resulting from terrorist attacks in 1996, 1998, 1999, 2006, 2008, 2010, 2011, and 2012. They were responsible for more than 90 percent of fatalities in 1995, 2018, and 2019.\"\n\n--------\n\n[The Organizational Dynamics of Far‐Right Hate Groups in the United States]\n(https://www.dhs.gov/sites/default/files/publications/944_OPSR_TEVUS_Comparing-Violent-Nonviolent-Far-Right-Hate-Groups_Dec2011-508.pdf)\n\n\"There is empirical and anecdotal evidence that far-right hate groups pose a significant threat to public safety. Far-right extremists commit many violent attacks, and some scholars conclude that far-right extremists, especially groups motivated by religious ideology, are strong candidates to commit future acts using weapons of mass destruction (Gurr & Cole, 2002; Tucker, 2001).\n.\n.\n.\nSimilarly, a national survey of State law enforcement agencies concluded that there was significant concern about the activities of far-right extremist groups, and that more states reported the presence of far-right militia groups (92%), neo-Nazis (89%), and racist skinheads (89%) in their jurisdictions than Jihadi extremist groups (65%) (Freilich, Chermak & Simone, 2009)\"\n\n--------------------\n\n[Right-Wing Domestic Terrorism Has Increased By More Than 300% Since Trump Took Office: Report](https://lawandcrime.com/high-profile/right-wing-domestic-terrorism-has-increased-by-more-than-300-since-trump-took-office-report/)\n\n------------\n\n[Far-right extremists have hatched far more terror plots than anyone else in recent years]\n(https://www.revealnews.org/article/home-is-where-the-hate-is/)\n\n-------------------\n\n[White supremacists, Antifa: U of T experts on protesters in Charlottesville](https://www.utoronto.ca/news/white-supremacists-antifa-u-t-experts-protesters-charlottesville)\n\n\"The FBI has been warning about the threat of white nationalists and white supremacists for some time. They've said that white supremacists pose a threat to the nation, and they actually highlighted the fact that white supremacists have been quite effective in infiltrating American law enforcement.\"\n\nIn the U.S., far-right and nationalist organizations are heavily armed and are disproportionately the progenitors of violence. Antifa arise as a reaction to far-right movements and mostly seek to clash with them.\"\n\n-------\n\n[Analysts Say Armed Groups At Protests Raise Specter Of A 'Street War'](https://www.npr.org/2020/07/30/896770081/analysts-say-armed-groups-at-protests-raise-specter-of-a-street-war)\n\n\"Analysts say far-right and anti-government agitators are either attacking protesters or trying to glom onto their cause to push their own agendas. Other extremists see a chance to trigger a violent revolution; still others, a race war.\"\n\n---------------\n\n[Testament to Murder: The ViolentFar-Right’s Increasing Use of Terrorist Manifestos](https://icct.nl/app/uploads/2020/03/Jaocb-Ware-Terrorist-Manifestos2.pdf)\n\n------\n\n[The Escalating Terrorism Problem in the United States]\n(https://www.csis.org/analysis/escalating-terrorism-problem-united-states)\n\n\"This analysis makes several arguments. First, far-right terrorism has significantly outpaced terrorism from other types of perpetrators, including from far-left networks and individuals inspired by the Islamic State and al-Qaeda.\"\n\n------\n\n[Between 24 May and 22 August, ACLED records more than 10,600 demonstration events across the country. Over 10,100 of these — or nearly 95% — involve peaceful protesters. Fewer than 570 — or approximately 5% — involve demonstrators engaging in violence. Despite the media focus on looting and vandalism, however, there is little evidence to suggest that demonstrators have engaged in widespread violence. In some cases where demonstrations did turn violent, there are reports of agents provocateurs — or infiltrators — instigating the violence. ](https://acleddata.com/2020/09/03/demonstrations-political-violence-in-america-new-data-for-summer-2020/)\n\n-------------------\n\n[Homegrown Terror: Explore 9 years of domestic terrorism plots and attacks]\n(https://apps.revealnews.org/homegrown-terror/)\n\n---------------------\n\n[Revealed: pro-Trump activists plotted violence ahead of Portland rallies](\nhttps://www.theguardian.com/world/2020/sep/23/oregon-portland-pro-trump-protests-violence-texts)\n\n------\n\n[Texas member of Boogaloo Bois charged with opening fire on Minneapolis police precinct during protests over George Floyd\nFeds say Texas adherent of far-right group fired on precinct building, conspired with cop killer to ignite civil war. ](https://www.startribune.com/charges-boogaloo-bois-fired-on-mpls-precinct-shouted-justice-for-floyd/572843802/)\n\n------\n\n[Why some counterprotests to Black Lives Matter are turning violent Counterprotester clashes are detracting from one of the largest social justice movements in history.](https://www.vox.com/2020/9/14/21432330/counterprotests-black-lives-matter-violent)\n\n------\n\n[Read More: Fact Check: Did Antifa Incite Violence & Riots In Michigan?](https://wbckfm.com/fact-check-did-antifa-incite-violence-riots-in-michigan/)\n\n------\n\n[Violence is incited by counter-protesters.](https://acleddata.com/2020/09/03/demonstrations-political-violence-in-america-new-data-for-summer-2020/)\n\n------\n\n[Contrary to Trump, protest records show little evidence of antifa involvement](https://globalnews.ca/news/7035331/little-evidence-antifa-protests/)\n\n------\n\n[As Trump warns of leftist violence, a dangerous threat emerges from the right-wing boogaloo movement](https://webcache.googleusercontent.com/search?q=cache:i5lUc52Vl1YJ:https://www.washingtonpost.com/technology/2020/06/17/trump-warns-leftist-violence-dangerous-threat-emerges-right-wing-boogaloo-movement/+&cd=2&hl=en&ct=clnk&gl=ca)\n\n------\n\n[Joint Terrorism Task Force Charges Three Men Who Allegedly Sought To Exploit Protests In Las Vegas And Incite Violence]\n(https://www.justice.gov/usao-nv/pr/joint-terrorism-task-force-charges-three-men-who-allegedly-sought-exploit-protests-las)\n\n-----\n\n[Brooks Brothers riot](https://en.wikipedia.org/wiki/Brooks_Brothers_riot)\n\n\"Brooks Brothers riot was a demonstration at a meeting of election canvassers in Miami-Dade County, Florida, on November 22, 2000, during a recount of votes made during the 2000 United States presidential election, with the goal of shutting down the recount.[1] After demonstrations and acts of violence, local officials shut down the recount early. Many of the demonstrators were paid Republican operatives.\"\n\n--------\n\n[Ballot Security Task Force](https://en.wikipedia.org/wiki/Ballot_Security_Task_Force)\n\n\"The National Ballot Security Task Force (BSTF) was a controversial group founded in 1981 in New Jersey by the Republican National Committee (RNC) as a means of intimidating voters and discouraging voter turnout among likely Democratic voters in the gubernatorial election. \"", "time": 1605178683.0}, {"subreddit": "politics", "text": "> That list could be debunked so many times and you guys would still post it.\n\nIf you weren't completely full of shit, it should be no problem for you to come up with a list of those that have died at the hands of the supposedly blood soaked left. Except it would look a bit silly comparing a handful to fucking HUNDREDS after yammering on about amassing firearms against unnamed hordes of psychopaths, wouldn't it?\n\nHilariously, I didn't even post a list. If you'd bothered to look at the link, instead of acting like a chastised dog too afraid to face reality. Go play with your rifles, GI Joe. Don't let Cobra Commander get you.", "time": 1605041235.0}], "republican_score": 0, "democrat_score": 4}