{"name": "Skorpyos", "posts": [{"subreddit": "democrats", "text": "AOC and Ilhan streaming on Twitch right now gives me life. 430k watchers.\n", "time": 1603243678.0}, {"subreddit": "politics", "text": "Exclusive: Giuliani associate willing to tell Congress Nunes met with ex-Ukrainian official to get dirt on Biden\n", "time": 1574477690.0}, {"subreddit": "democrats", "text": "Where’s Bloomberg and his money when we need him.", "time": 1607135915.0}, {"subreddit": "politics", "text": "Did the journo deserve it?", "time": 1606807580.0}, {"subreddit": "politics", "text": "The gays are reclaiming the word that has in the past been used to denigrate and devalue homosexual people. Good.", "time": 1606692135.0}, {"subreddit": "politics", "text": "Lol", "time": 1606601454.0}, {"subreddit": "politics", "text": "In related news, old man yells at clouds.", "time": 1606595524.0}, {"subreddit": "politics", "text": "Maybe they mean “critique”, but I guess the point makes sense.", "time": 1606521127.0}, {"subreddit": "politics", "text": "No one cares what they believe or don’t believe. \n\nOn a separate note, be careful using questionable right-wing propaganda websites as news sources.", "time": 1606359314.0}, {"subreddit": "politics", "text": "I sure as hell hope Biden doesn’t rely on polls to do what’s right for Americans.", "time": 1606325221.0}, {"subreddit": "politics", "text": "Pick the gay guy to be in charge of the social events. Lol wow", "time": 1606325072.0}, {"subreddit": "politics", "text": "This rift is exactly what Dems needs to improve their shot at winning those GA senate seats.  Here’s hoping the rift gets worse :).", "time": 1606320694.0}, {"subreddit": "politics", "text": "762k ballots is good. But there’s still lots of work to be done.  Close to 5M votes were cast in the last run.", "time": 1606261050.0}, {"subreddit": "politics", "text": "...which is why Warnock and Ossoff are using grassroots organizing and depending on local leaders to mobilize the vote. Schumer is not their strategist lol", "time": 1606260446.0}, {"subreddit": "politics", "text": "Republicans are such traitors", "time": 1606260308.0}, {"subreddit": "politics", "text": "As soon as he steps down he will no longer matter. The base will abandon him as fast as they abandoned the Bushes.", "time": 1606259431.0}, {"subreddit": "politics", "text": "This guy is useless.", "time": 1606259285.0}, {"subreddit": "politics", "text": "Narcissists that look after the interests of the average American? That doesn’t compute. You need to shake your head from the lies and vulture capitalists that hate AOC and really pay attention to why she does what she does.", "time": 1606253986.0}, {"subreddit": "politics", "text": "If the haters here would just stop to research the reason behind the opposition *maybe* they’ll understand why it’s happening. AOC and Ilhan’s actions are based on what affects the average American person. This is not opposition just for the sake of it.", "time": 1606250758.0}, {"subreddit": "democrats", "text": "Bye bitch.", "time": 1606198699.0}, {"subreddit": "democrats", "text": "Ha ha ha you actually think they care about anything other than their pockets and power?", "time": 1606198560.0}, {"subreddit": "democrats", "text": "Explain", "time": 1606195900.0}, {"subreddit": "politics", "text": "Of course. And she might develop a very rare symptom of Covid infection: sudden death with bullet-like orifices in the back of the head.", "time": 1606184394.0}, {"subreddit": "politics", "text": "When I think climate change leader, Kerry is not in the top 15 people that come to mind. That’s all.", "time": 1606154248.0}, {"subreddit": "politics", "text": "Yawn.", "time": 1606153798.0}, {"subreddit": "politics", "text": "How un-exciting.", "time": 1606153723.0}, {"subreddit": "politics", "text": "Even before Covid that dude was never doing “pretty well”. Lol.", "time": 1605989252.0}, {"subreddit": "politics", "text": "Cool. :)", "time": 1605982255.0}, {"subreddit": "politics", "text": "Lmaoooo", "time": 1605929603.0}], "republican_score": 0, "democrat_score": 5}