{"name": "Slaware", "posts": [{"subreddit": "democrats", "text": "2020 in a nutshell\n", "time": 1600471309.0}, {"subreddit": "politics", "text": "You don’t need to be black to be outraged. You need to be American and be outraged.\n", "time": 1598807995.0}, {"subreddit": "politics", "text": "The Chicks nailing it\n", "time": 1593375118.0}, {"subreddit": "politics", "text": "Let it go for Christ's sake, never happened and has been disproven", "time": 1607218713.0}, {"subreddit": "politics", "text": "I wonder how much its going to sound like Michelle's", "time": 1607208624.0}, {"subreddit": "politics", "text": "Take a quick trip over to Parker, and I definitely advise quick.  This is literally all they're talking about. The rinos. Its delicious.", "time": 1607208078.0}, {"subreddit": "politics", "text": "We're going to win so bid its going to hurt.", "time": 1607188429.0}, {"subreddit": "democrats", "text": "To a tee", "time": 1607135602.0}, {"subreddit": "democrats", "text": "More of this please!", "time": 1607127552.0}, {"subreddit": "politics", "text": "Hey, me too!", "time": 1607125372.0}, {"subreddit": "politics", "text": "The biggest loser award", "time": 1607110059.0}, {"subreddit": "democrats", "text": "I still have to look at one every single day. Its starting to upset my turrets and I'm afraid of whats going to happen when I finally lose it and rip it down. Its not going to be pretty.", "time": 1607106427.0}, {"subreddit": "politics", "text": "Unhinged is available", "time": 1607018522.0}, {"subreddit": "politics", "text": "He just can't fucking help himself. Today on Facebook,  now this. If I were the Republicans down there, I'd run.", "time": 1606959760.0}, {"subreddit": "politics", "text": "Hes missing his rallies so fucking much, he just can't help himself.", "time": 1606958707.0}, {"subreddit": "politics", "text": "You cannot summon the lord with prayer!", "time": 1606935727.0}, {"subreddit": "politics", "text": "Meats back on the table boys", "time": 1606923612.0}, {"subreddit": "politics", "text": "My favorite response is one I saw from a millennial. \"Facebook has done to our parents and grandparents, what they said video games were going to do to us\"", "time": 1606867582.0}, {"subreddit": "politics", "text": "I went over and made 2 comments and have been banned. RECORD TIME", "time": 1606701655.0}, {"subreddit": "democrats", "text": "Love this", "time": 1606695683.0}, {"subreddit": "democrats", "text": "I love a man thats so fucking wrapped in fear he has to wear his sidearm to walmart but too stupid to wear a mask in a worldwide epidemic.", "time": 1606693502.0}, {"subreddit": "politics", "text": "A sharknado", "time": 1606659380.0}, {"subreddit": "politics", "text": "Look up some of the things he said at the impeachment, he has also done a lot for equal rights. Look it up yourself.", "time": 1606571662.0}, {"subreddit": "politics", "text": "Yes, hes real good and we are lucky to have him.", "time": 1606528692.0}, {"subreddit": "politics", "text": "All they have to do is play a clip from him pushing absentee ballots at his rallies. Case over. You don't get to have it both ways.  Pick one!", "time": 1606518038.0}, {"subreddit": "politics", "text": "I see you have my form of turrets", "time": 1606267567.0}, {"subreddit": "politics", "text": "They're talking about Merrick Garland, wouldn't that be glorious.", "time": 1606267226.0}, {"subreddit": "politics", "text": "Oh for fucks sake let this go and never post it again", "time": 1606259299.0}, {"subreddit": "politics", "text": "They'z gonna be so pissed when they can't write him in.", "time": 1606246011.0}, {"subreddit": "politics", "text": "It only hurts for a little while", "time": 1606244437.0}, {"subreddit": "politics", "text": "I also got the idea that they think randy quaid is Q im loving life today.", "time": 1606244198.0}, {"subreddit": "politics", "text": "I just popped over to parlor and they think if they write trump in he will become the next senator of Georgia and he can keep his power. Can't make this shit up.", "time": 1606243648.0}, {"subreddit": "politics", "text": "If he golf's every day until the inauguration he will actually have golfed 1 full year out of a 4 year term. 365 days of golfing in 4 years. I can't wait to never hear about him again.", "time": 1606188435.0}, {"subreddit": "politics", "text": "Fucking stop already.", "time": 1606187825.0}, {"subreddit": "politics", "text": "NEVER WAS MY PRESIDENT", "time": 1606186610.0}, {"subreddit": "democrats", "text": "PREACH, YOU'RE AWESOME", "time": 1606185597.0}, {"subreddit": "politics", "text": "Thats ok, I NEVER  considered trump legitimate for the past 4 years. They can sit and feel like shit for the next 4 years like I did for the past 4.", "time": 1606179003.0}, {"subreddit": "politics", "text": "This is wrong,  they sent a formal letter saying the trump administration is ready to transition. So don't listen to this. ITS FUCKING OVER!", "time": 1606173461.0}, {"subreddit": "politics", "text": "Me too, this is the first time that f'ing clench has left my stomach", "time": 1606173275.0}, {"subreddit": "politics", "text": "Yes, we're bigger and better than him", "time": 1606097359.0}, {"subreddit": "politics", "text": "Does he know about elevensies?", "time": 1606057235.0}, {"subreddit": "politics", "text": "I literally just spoke to a trump supporter the other day and he told me it is going to be nice to be able to speak to his neighbors again and not be so angry all the time.  I told him if you fucking idiots,after 4 years of getting along and not getting triggered every morning by a tweet want to go back to this shit, then have at it. And he said, nobody wants that.", "time": 1605998491.0}, {"subreddit": "politics", "text": "They probably shouldn't have attacked his wife in the grocery store. That sent him out in full force.", "time": 1605974336.0}, {"subreddit": "politics", "text": "It wasn't Cuomo who bungled it. He was the only voice of reason in the first wave.  Him and Fauci", "time": 1605966913.0}, {"subreddit": "politics", "text": "He should go through hard times he murdered 2 people", "time": 1605927253.0}, {"subreddit": "politics", "text": "He should go through hard times he murdered 2 people!", "time": 1605927188.0}, {"subreddit": "politics", "text": "American terrorist you mean. Fixed it for you.", "time": 1605927113.0}, {"subreddit": "politics", "text": "3 2 1 trump fucking implodes", "time": 1605916759.0}, {"subreddit": "democrats", "text": "Awe sweet sweet little snowflake. It turns out he did lose the election and you fucking idiots were the ones burning buildings. You can go back to your couch and bitch on Facebook.", "time": 1605916166.0}, {"subreddit": "politics", "text": "He NEVRR governed, he profited.", "time": 1605878746.0}, {"subreddit": "politics", "text": "Let me guess, you're a fucking ice agent and trying to make your case. Like I said, go the fuck away.", "time": 1605832694.0}, {"subreddit": "politics", "text": "I'm living it now watching these fucking pretzels trying to explain that it was just a paycheck. There are ABSOLUTELY NO WORDS FOR YOU TO EXCUSE ANY OF THIS. So  go away. Same shit happening right now. Bullshit propaganda. Rigged election. Nationwide voter fraud. Same shit.", "time": 1605831244.0}, {"subreddit": "politics", "text": "Wasn't a valid excuse back at the Nuremberg trials, not a valid excuse now. You walk the fuck away when you see this shit. Same as the fucking ice guys with the kids in cages.", "time": 1605830341.0}, {"subreddit": "politics", "text": "I was just following orders", "time": 1605829929.0}, {"subreddit": "politics", "text": "I really don't care, do you", "time": 1605822077.0}, {"subreddit": "politics", "text": "I know,  its just nice not seeing all the flags and signs", "time": 1605721954.0}, {"subreddit": "politics", "text": "No, not all of them, but enough of them that Biden won the election.", "time": 1605713781.0}, {"subreddit": "politics", "text": "You know what they aren't putting out there is the fact that all the republican senators and governor's kept their seats, but the same people voted against trump. That should be said louder and louder.", "time": 1605713598.0}, {"subreddit": "politics", "text": "Listened to a group of about 10 avid trump supporters bitching yesterday that he really needs to start working with Biden because its going to mess with the distribution of the vaccine. There are only a couple of trump flags left. They're starting to turn on him.", "time": 1605712311.0}, {"subreddit": "politics", "text": "They're about to nullify ALL of the votes in ARIZONA. Going to wait until after the deadline to file. These fucking people suck.", "time": 1605662617.0}, {"subreddit": "politics", "text": "I actually texted a couple of trump supporters to say, remember when you're taxes go up in January its not Bidens fault it your dear leader fucking you on the way out the door. No response back.", "time": 1605536895.0}, {"subreddit": "politics", "text": "Right now Pfizer needs to be 94 below zero. I will still wait. I don't trust anything until Biden administration rolls something out.", "time": 1605533740.0}, {"subreddit": "politics", "text": "Isn't it going to be nice to NOT to have an asshole in the white house for 4 years. After quiet and calm for 4 years, let's let these asshats have another go at it and see how that works out!", "time": 1605533463.0}, {"subreddit": "politics", "text": "Isn't Moderna part of watp speed? I'll wait for Pfizer", "time": 1605532606.0}, {"subreddit": "politics", "text": "Random acts of kindness, still having to listen to these idiots is over.", "time": 1605451937.0}, {"subreddit": "politics", "text": "I'm back to fuck your feelings. Had to listen to these idiots for 4 years.  Don't fucking care to understand their gripes.", "time": 1605451142.0}, {"subreddit": "politics", "text": "Only if the media keeps covering him", "time": 1605448708.0}, {"subreddit": "politics", "text": "Hopefully for Thanksgiving", "time": 1605392321.0}, {"subreddit": "politics", "text": "I don't, my husband was reading them to me from Google news", "time": 1605356683.0}, {"subreddit": "politics", "text": "Look them up", "time": 1605356637.0}, {"subreddit": "politics", "text": "Nope, he can remove her just like trump got rid of everyone. Appointed not elected.", "time": 1605326165.0}, {"subreddit": "politics", "text": "You should really check into some of the bills Bernie Sanders is putting together, they are mitch mcconnell proof and ingenious.", "time": 1605326107.0}, {"subreddit": "politics", "text": "Shes appointed not elected, Biden can remove her.", "time": 1605325344.0}, {"subreddit": "politics", "text": "THIS IS THE BEST NEWS,  we came so fucking close to this monster changing our entire early educational system into a fucking hitler youth program.", "time": 1605309967.0}, {"subreddit": "politics", "text": "Thats not what he said. CUOMO told him to go fuck himself and that he doesn't trust anything this asshat does. Good for Coumo. And he couldn't help himself to take shots at CUOMO because Cuomo called his bullshit before this sham of an announcement", "time": 1605304468.0}, {"subreddit": "politics", "text": "Here's his fucking red states for you.", "time": 1605302751.0}, {"subreddit": "politics", "text": "Oh for fucks sake", "time": 1605302324.0}, {"subreddit": "politics", "text": "I'm hoping he does this on Thanksgiving", "time": 1605301431.0}, {"subreddit": "politics", "text": "Like they showed up at the white house, the polls and every place else hes called them. Sit back on your couch and shut the fuck up.", "time": 1605295224.0}, {"subreddit": "politics", "text": "I like it when an impeached loser ex president shuts the fuck up.", "time": 1605293414.0}, {"subreddit": "politics", "text": "If there's 400,000 dead by January and anyone votes for these fucking republican idiots. I have no words.", "time": 1605278962.0}, {"subreddit": "politics", "text": "Yes,yes she should be .", "time": 1604951791.0}, {"subreddit": "politics", "text": "I asked a trump supporters whats with the rallies? I told him if Obama tried to have rallies we would have told him we love you, we voted for you,  now do your job. We never would have attended rallies all through his presidency. He tod me to go fuck myself.  S0o there it is.", "time": 1604939524.0}, {"subreddit": "politics", "text": "Dont hate Republicans, just trump", "time": 1604929075.0}, {"subreddit": "politics", "text": "Just maid me sick. And how appropriate that this fucking idiot after being PRESIDENT would act6do a reality show again", "time": 1604929018.0}, {"subreddit": "politics", "text": "Fucking pretzels you people are over 4 million votes and 290 electoral votes IS NOT SQUEAKING BY.", "time": 1604896347.0}, {"subreddit": "politics", "text": "If hecruns he loses his voice", "time": 1604881904.0}, {"subreddit": "politics", "text": "Not true, Jimmy Carter refused secret service after he left, saying why would anyone want to hurt me.", "time": 1604881183.0}, {"subreddit": "politics", "text": "Our best scenario is he flees the country. It takes out his base. We get to watch everything and everyone that has attached themselves to him go down in flames and then we NEVER have to listen to him again.", "time": 1604881025.0}, {"subreddit": "politics", "text": "Its considered a courtesy. And we all know this piece of shit in the white house right now is the least courteous person that ever lived.", "time": 1604878406.0}, {"subreddit": "politics", "text": "Remember she just reupped her pre-nup. Her aide said she didn't come to the white house in the beginning until he signed her amended pre-nup.", "time": 1604878203.0}, {"subreddit": "politics", "text": "I have a Christian neighbor and he said well here comes socialism. So I asked, aren't you a Christian? He said of course.  So I said as a Christian I would much rather have my taxes help people in need and not porn stars, golfing and rallies.  He hasn't spoken to me since.😁", "time": 1604878086.0}, {"subreddit": "politics", "text": "In another post, I had a guy say, republican here saying we need unity. So I asked him how the fuck your feelings went away so fast. And he told me to go fuck myself. So, yeah no olive branches.", "time": 1604862875.0}, {"subreddit": "politics", "text": "Besides the election, this is the worst year ever.", "time": 1604860811.0}, {"subreddit": "democrats", "text": "And I also want you to know, we know how you're feeling and none of us wish that feeling on anyone. So I am sorry for how you're feeling.", "time": 1604856071.0}, {"subreddit": "democrats", "text": "I want to say thank you on one hand and on the other hand I get to say, nobody gets to insult us because Biden won. That shit is OVER. Trump got rid of the UNITED  part of the United States of America. No more insults from anyone anymore. Either side. We come together totally or just waiting for the other side to fuck up brings us right back to the vitriol of trump.", "time": 1604855944.0}, {"subreddit": "democrats", "text": "Don't get me wrong, we're more than happy to welcome you. We just can't imagine that your feelings changed so quickly. I understand not everyone who voted for trump felt this way, but you absolutely don't get to get offended if we're a little fucking skeptical.", "time": 1604852365.0}, {"subreddit": "democrats", "text": "What happened to fuck your feelings\", now thats all over?", "time": 1604844822.0}, {"subreddit": "politics", "text": "Fly in on airforce one and out on his trump plane. Im sure there's measures that won't let him flee on airforce one", "time": 1604802674.0}, {"subreddit": "democrats", "text": "I can't like this enough 😁", "time": 1604789778.0}], "republican_score": 0, "democrat_score": 13}