{"name": "kmanfever", "posts": [{"subreddit": "democrats", "text": "Omg I love this!!!!", "time": 1607219483.0}, {"subreddit": "politics", "text": "In Peru as well.", "time": 1607043679.0}, {"subreddit": "democrats", "text": "Sad", "time": 1605213425.0}, {"subreddit": "democrats", "text": "Frog...fraud....frog. ok, yes", "time": 1605200863.0}, {"subreddit": "politics", "text": "Defending Trump automatically puts you at risk. May we never experience another nutcase like this in US politics again. 🤞", "time": 1605126868.0}, {"subreddit": "politics", "text": "Yeah, I mean Bush v Gore was different in that it was a few hundred in Miami-Dade. In this year's situation, 600 ain't gonna matter.", "time": 1605126667.0}, {"subreddit": "politics", "text": "Love it!!!", "time": 1605126566.0}, {"subreddit": "politics", "text": "Omg the sh** show continues. Now, we'll never be free of this Trump nightmare because he's for ever a part of American history and an influence on the Republican party for the rest of his life. Also free to keep tweeting. It's just.....horrible.", "time": 1605126477.0}, {"subreddit": "democrats", "text": "Yeah, that soumds so tough. Talking politics at my republican sister's house ( her, her husband and in-laws) was like a full on assault. I was treated like the dumbest person on the planet and a nut job for wanting to protect and improve the ACA. I can't imagine dealing with parents like you are 24/7. Keep your head up! 👍", "time": 1605112346.0}, {"subreddit": "democrats", "text": "No, it was someone else who mentioned it to me in a recent conversation and of course, I hadn't thought of that election in many years and could not remember whether it was true or not during our conversation. Thanks for the stats and yes, Bush definitely rode Reagan's coattails on that.", "time": 1604873185.0}, {"subreddit": "democrats", "text": "Someone tried to tell me HW Bush also lost the popular vote. Guess that's not true. \n\nI am just worried about the ripple effect of him winning the office. The future could be dark but I'll hope for the best.", "time": 1604868393.0}, {"subreddit": "democrats", "text": "No. I'm not saying they don't, they are saying they don't. Nice try though.", "time": 1604868207.0}, {"subreddit": "democrats", "text": "Nice!!", "time": 1604868140.0}, {"subreddit": "democrats", "text": "No what webhead said, not op", "time": 1604784643.0}, {"subreddit": "democrats", "text": "Tell it!! There are super smart people in those areas but different belief system.", "time": 1604778646.0}, {"subreddit": "democrats", "text": "Everything he says is a lie. I literally stopped listening to him by the first year in office. He cannot tell the truth.", "time": 1604778517.0}, {"subreddit": "democrats", "text": "You wanna live in those states? Cuz I don't. But I get what you're saying.", "time": 1604774233.0}, {"subreddit": "democrats", "text": "That is horrible to say. You're just calling these states so dumb they don't understand what they're doing.", "time": 1604774125.0}, {"subreddit": "democrats", "text": "They have been. They lost which is pretty delegitimizing. Lol", "time": 1604774040.0}, {"subreddit": "democrats", "text": "Yes, I'm sure the counts are observed. I mean actually that's my assumption.", "time": 1604773983.0}, {"subreddit": "democrats", "text": "I doubt it.", "time": 1604424508.0}, {"subreddit": "democrats", "text": "These are state laws so yeah. It should be fine.", "time": 1604424462.0}, {"subreddit": "democrats", "text": "They'll get counted. Don't worry too much. It is sad to have a sitting president crap on free and fair elections in his own country.", "time": 1604421712.0}, {"subreddit": "democrats", "text": "Here's hoping but remember, there are tons of absentee and mail in ballots to be counted this year as well so don't expect the result tonight to be complete.", "time": 1604421472.0}, {"subreddit": "democrats", "text": "Our rep race is practically tied and I'm hyperventilating since I want the Republican replaced by the democratic challenger. I've been trying to vote him out for 6 years and this is our chance yet. Btw, he was one of the lawyers who defended Trump in the impeachment hearing and a constant Trump kiss**s.", "time": 1604353945.0}], "republican_score": 0, "democrat_score": 20}