{"name": "BigDaddyBat", "posts": [{"subreddit": "democrats", "text": "“Don’t cry Jared....” 😂", "time": 1607112901.0}, {"subreddit": "politics", "text": "I hope he dies from COVID-19, not gonna lie. What he’s done to fully support genocide in Yemen is mind boggling.", "time": 1607060159.0}, {"subreddit": "politics", "text": "If his diehards don’t trust the system and never vote again it will indeed make America great.", "time": 1606795140.0}, {"subreddit": "politics", "text": "George HW Bush don’t help murder JFK, MLK, and RFK.", "time": 1606794972.0}, {"subreddit": "democrats", "text": "They about to fade away a bit", "time": 1606199094.0}, {"subreddit": "democrats", "text": "Absolutely! she has a pure heart", "time": 1606198964.0}, {"subreddit": "democrats", "text": "The People’s Champion!", "time": 1606198922.0}, {"subreddit": "politics", "text": "Karma is a bitch", "time": 1605915279.0}, {"subreddit": "politics", "text": "Time to rage donate to the Georgia Senate campaign! 💙", "time": 1605059470.0}, {"subreddit": "politics", "text": "Tens of millions of people are ok with a billionaire person who is accused of raping a 13 year old pay 💰 only  $750 in taxes per year", "time": 1604482811.0}, {"subreddit": "politics", "text": "She should do YouTube instead", "time": 1603157179.0}, {"subreddit": "politics", "text": "They are tires on federal land. He is the one doing poor forest management", "time": 1602849816.0}, {"subreddit": "politics", "text": "The comments I see here are way too over confident. Assume the poll is wrong and you have to convince your neighbors and donate money. This is the most important election of our lives (so far).", "time": 1602153179.0}, {"subreddit": "politics", "text": "So not Iran?", "time": 1602117152.0}, {"subreddit": "politics", "text": "They’re still Russia, one of the most miserable countries on the planet.", "time": 1596178282.0}, {"subreddit": "politics", "text": "No way he will win Texas or corrupt Florida.", "time": 1596178141.0}, {"subreddit": "politics", "text": "Thank you", "time": 1593452142.0}, {"subreddit": "politics", "text": "Thanks for that insight, can you please provide a link to a source on that claim, it’s the first I heard of that.", "time": 1593443170.0}, {"subreddit": "politics", "text": "Top Republican donor is Israeli/American national whose kids served in the Israeli military. It’s not that he immigrated as an older adult, he sent his kids there as he preferred them to serve there instead of USA. -Sheldon Adelson", "time": 1593023341.0}, {"subreddit": "politics", "text": "“Conservatives” Real ones have been sidelined or manipulated into betraying their own interests in fear of made-up “liberal agendas”", "time": 1592629999.0}, {"subreddit": "politics", "text": "There’s no proof those people got it at work. Did they die? Did thousands of people get to work and earn money again?", "time": 1591856707.0}, {"subreddit": "politics", "text": "I am always fascinated that almost none of these senators actually attended a university in their state. Both Cotton and T Cruz attended “Ivy League” schools instead of University of Arkansas or Texas A&M, etc.  \n\nSwamp Senators", "time": 1591116977.0}, {"subreddit": "politics", "text": "Yeah but there’s more testing. As long as fatalities and hospital indemnities don’t rise it’s not the end of the world. I am personally pro-opening up with following the “do the five” regimen the cdc recommends because I have seen it work at my company of 6,000 which never shut down.", "time": 1589769751.0}, {"subreddit": "politics", "text": "Star Trek: The Next Generation is a great therapy", "time": 1586995767.0}, {"subreddit": "politics", "text": "That sonofabitch still alive?", "time": 1584678923.0}, {"subreddit": "politics", "text": "Yeah he gay", "time": 1582951176.0}, {"subreddit": "politics", "text": "I don’t understand why it isn’t clear to everyone that Lindsay Graham has been living a lie of a life as a “confirmed bachelor” southern baptist.  Why would conservatives vote for a liar like that. He’s clearly a closeted homosexual.", "time": 1582951004.0}], "republican_score": 0, "democrat_score": 4}