{"name": "Galphanore", "posts": [{"subreddit": "politics", "text": "2024 nothing. After this, fully expected, narcissistic ranting they're gonna have to find a way to distance themselves from him by *January* or a noticeable chunk of the Georgia GOP base isn't going to vote and the Dems could win the senate.", "time": 1607223173.0}, {"subreddit": "politics", "text": "Depends on how close to Atl you are. Near Atl, Coca Cola Bottle. OTP? Giant rotating peach.", "time": 1607186820.0}, {"subreddit": "politics", "text": "Valid. I'm hoping for two more in January. Already donated and convinced someone who, somehow, didn't vote in the presidential to vote in the runoff.\n\nIncidentally, have you gone to http://www.gasenate.com to donate to the correct side in the upcoming election?", "time": 1607140483.0}, {"subreddit": "politics", "text": "Honestly? Kinda, yeah.", "time": 1607140036.0}, {"subreddit": "democrats", "text": "I, for one, am shocked.", "time": 1607129059.0}, {"subreddit": "democrats", "text": "Ostrich with it's head in the sand, but that'd work too :D", "time": 1607107362.0}, {"subreddit": "democrats", "text": "Found the perfect animal for the republicans: https://imgur.com/1G1GYG4", "time": 1607104925.0}, {"subreddit": "democrats", "text": "Yeah...why do we have a donkey?", "time": 1607102905.0}, {"subreddit": "democrats", "text": "I would say that should be the new republican mascot, but they don't deserve an animal as awesome as a leopard.", "time": 1607097573.0}, {"subreddit": "politics", "text": "Romney is McConnel's beard. He puts a face of concern on some aspect of conservatives so that the rest can be assholes and still have someone to point to and pretend to have the moral high ground, all while not actually *doing* anything wortwhile.", "time": 1607097313.0}, {"subreddit": "politics", "text": "It was always held up by horns. The dude is a dick, he just wasn't quite stupid enough to blatantly break the law when he knew that even if he did so it wouldn't change the results enough to make Trump the winner.", "time": 1607055891.0}, {"subreddit": "democrats", "text": "It's almost like the only thing a grifter does when given the reins of government is grift.", "time": 1607055547.0}, {"subreddit": "politics", "text": "Turns out when you kill a bunch of your followers and leave others sitting in the freezing cold or sweltering heat for hours, sending several to the hospital, after you abandon them, some of them turn on you and others just die.", "time": 1606946231.0}, {"subreddit": "politics", "text": "The ability to fail upwards is not limited to the civilian world.", "time": 1606920763.0}, {"subreddit": "politics", "text": "Well that's the last straw. In definitely not voting for him again.", "time": 1606882651.0}, {"subreddit": "politics", "text": "I think they're down to 2, Steve moved to Texas.", "time": 1606882234.0}, {"subreddit": "politics", "text": "Are. Despite his protestations, he's still dumping a bunch of money into the Georgia senate races. He's still a gigantic evil dick.", "time": 1606369526.0}, {"subreddit": "politics", "text": "It's actually kinda hilarious how many catch 22's Trumplethinskin has put himself in.", "time": 1606343033.0}, {"subreddit": "politics", "text": "I dunno, my main complaint about Republican$ is that they're, by and large, a bunch of greedy plutocrats who speak in platitudes while gobbling up as much money and power as they can, not giving a single fuck about the people they're supposed to represent. Then again, the Dems have a bunch of those too. Just not quite as large a percent of the total.", "time": 1606336084.0}, {"subreddit": "politics", "text": "So you're saying they're too stupid to understand the treaty and assumed that Russia was not complying with it as a result?", "time": 1606334432.0}, {"subreddit": "politics", "text": "And back to the sad.", "time": 1606332745.0}, {"subreddit": "politics", "text": "It's sad that the republicans have actively courted anti-intellectualism for so long.", "time": 1606330885.0}, {"subreddit": "politics", "text": "The confederate statues were put up by racists to remind blacks of their place. Most of them fairly recently, long after the civil war. They're monuments to racism and don't deserve to stand. It's like the statues of Sadam that got torn down when we invaded Iraq. Those statues represented something vile, and tearing them down is an act of hope.", "time": 1606330532.0}, {"subreddit": "politics", "text": "Trump's excuse was that they claim Russia isn't complying with the treaty, so why should we? Of course, the sane solution to that is to call Russia out for non-compliance and use diplomatic pressure to get them to comply. But that doesn't work when you have an incompetent chief executive who has spent his whole time in office destroying American soft power.\n\nNote: I'm not a Trump supporter, I just remember what his excuse was.", "time": 1606329474.0}, {"subreddit": "politics", "text": "I think you're right, but we can both agree that they're both morons.", "time": 1606328953.0}, {"subreddit": "politics", "text": "It's a hard thing, judging whether Trump or Bush are dumber.", "time": 1606327036.0}, {"subreddit": "politics", "text": "That would be perfect. Understated, not seeking glory. Just...there, acknowledged and recognized.", "time": 1606326741.0}, {"subreddit": "politics", "text": "Damn straight it does. That would be perfect for her, I'm sure we can find another location for Fauci. She has a small bronze one in Brooklyn, New York (her hometown) but she should have one in DC too.", "time": 1606325029.0}, {"subreddit": "politics", "text": "Absolutely, replace the Albert Pike Statue that was in Judiciary Square in DC with Fauci.", "time": 1606324808.0}, {"subreddit": "politics", "text": "We've got plenty of Confederate statues left to replace.", "time": 1606324522.0}, {"subreddit": "politics", "text": "That's fine too.", "time": 1606324250.0}, {"subreddit": "politics", "text": "Ironically, that means that the best thing Trump could do to *help* Biden's stated goal to move on is to pardon himself and his cronies. Then Biden could say, \"*I can't overturn Pardons, it's up to the states*\". That would piss people off, but not nearly as much as Biden just flat out choosing not to prosecute.", "time": 1606323867.0}, {"subreddit": "politics", "text": "That'd make sense, he does have shit for brains.", "time": 1606323745.0}, {"subreddit": "politics", "text": "I will dance in the streets if we win those two senate seats. Fuck Perdue and Loeffler.", "time": 1606323117.0}, {"subreddit": "politics", "text": "It's almost like we shouldn't be letting rich assholes run the country.", "time": 1606323051.0}, {"subreddit": "politics", "text": "Is that the black shit that was leaking out of Ghouliani's brain? Liquid COVID concentrate?", "time": 1606322783.0}, {"subreddit": "politics", "text": "They could pull a Nixon and give him \"a full and unconditional pardon for any crimes that he might have committed against the United States as president\".", "time": 1606321610.0}, {"subreddit": "politics", "text": "Yeah...it's not bloodlust, and pardoning everyone wouldn't \"quench\" it. It would just piss everyone off even more.", "time": 1606321510.0}, {"subreddit": "politics", "text": "How fucking hilarious would it be if he spent his legal fund trying to beat Obama on book sales?", "time": 1606315440.0}, {"subreddit": "politics", "text": "And now that we're basically entering another Gilded Age, we have an uncomfortably large group of people praying for a race war.", "time": 1606315286.0}, {"subreddit": "politics", "text": "What's the point of arguing about which progressive is better when there are hundreds of right-wing assholes in politics to take down?", "time": 1606313865.0}, {"subreddit": "politics", "text": "He's lashing out in narcissistic rage. Logic isn't involved.", "time": 1606274112.0}, {"subreddit": "politics", "text": "A memo got him out of being charged by Mueller so fuck it, we'll take this one too.", "time": 1606263032.0}, {"subreddit": "politics", "text": "New rule: Anyone who fires a whistleblower as obvious retaliation gets fired and can never work in government again.", "time": 1606261860.0}, {"subreddit": "politics", "text": "Well, the issue is that the GoP has been playing election games for decades in Georgia. A confluence of events this time around made it harder for them to actually achieve much with it, and there was a large enough turnout to overcome what they did. However, they'd convinced themselves because of the *results* of their fuckery that we are a deep red state instead of the reality, that we're purple. So, they're certain the Dems must have done what the GoP has long done because otherwise how could Georgia not be deep red?", "time": 1606257541.0}, {"subreddit": "politics", "text": "It's hilarious that despite the many ways Kemp is a corrupt piece of shit, the Trump supporters have to attack him on a conspiracy theory that most likely *isn't* true.", "time": 1606255814.0}, {"subreddit": "politics", "text": "Everyone should read \"The Cult of Trump\" by Steven Hassan. It's equally enlightening and horrifying but explains sooo much about what has gone on.", "time": 1606254929.0}, {"subreddit": "politics", "text": "To be clear, Bush *was* that bad. His shittiness was just more focused externally than internally. Trump is worse domestically, but Bush is still a fucking war criminal.", "time": 1606243805.0}, {"subreddit": "politics", "text": "The OLC's job is pretty much to find legal justification for whatever the executive decides to do. Of course they don't want the executive charged. Why anyone *else* gave a fuck about what they think is beyond me.", "time": 1606240870.0}, {"subreddit": "politics", "text": "Fucking hell dude.", "time": 1606239992.0}, {"subreddit": "politics", "text": "Yep, I know. I was adding to the comments not countering them.", "time": 1606175631.0}, {"subreddit": "politics", "text": "Online and on Parlor, at least, a bunch of those are people from /r/ParlerTrick. I did see that one video of some Trumpsters gathered around a dude with a bullhorn saying it, though, so who knows. I'm going to assume they're all coming out to vote and will push everyone else to come to vote Warnock/Ossoff to counter it.", "time": 1606175360.0}, {"subreddit": "politics", "text": "I will be shocked and thrilled if we win big on Jan 5th.", "time": 1606174786.0}, {"subreddit": "politics", "text": "Thanks, but I'm not worried about him doing something legal to steal the election. I'm worried about him doing something illegal to steal it and having there be enough support from Republicans in Congress and the courts to ignore that its illegal.", "time": 1606169936.0}, {"subreddit": "politics", "text": "Yep, and unless a law gets passed to bluntly say that a president can be indicted if they're committing crimes it's going to continue being a game of pass the republican buck unless McConnel buries it.", "time": 1606168229.0}, {"subreddit": "politics", "text": "> The Mueller team \"found\" that you can't indict a sitting president.\n\nWhich is *also* bullshit. It's not a law, it's just a memo written by the lawyers whose job is to justify government action! Why did *anyone* ever treat that memo with any force of law?", "time": 1606167777.0}, {"subreddit": "democrats", "text": "The right wing echo chamber has seriously fucked these people over.", "time": 1606165553.0}, {"subreddit": "democrats", "text": "He couldn't even keep a straight face when lying through his fucking teeth.", "time": 1606154156.0}, {"subreddit": "politics", "text": "They're actively looking for *any* excuse to take away people's right to vote.", "time": 1606153465.0}, {"subreddit": "politics", "text": "You're honestly going to pretend that the 10,809,870 *more* people who voted for Trump this time did so because somehow they thought Biden was a worse candidate than Clinton? Do to realize how absurd that is?", "time": 1606143805.0}], "republican_score": 0, "democrat_score": 8}