{"name": "TrumpizzaTraitor", "posts": [{"subreddit": "politics", "text": "Max Brooks on Twitter\n", "time": 1603300265.0}, {"subreddit": "democrats", "text": "This moron reflects his constituents, I’m thinking. \n\nWe get the government we deserve.", "time": 1607183393.0}, {"subreddit": "democrats", "text": "Go Fund Me for buying Congress?", "time": 1607183321.0}, {"subreddit": "politics", "text": "California certified its presidential election Friday and appointed 55 electors pledged to vote for President-elect Biden, officially handing him the Electoral College majority needed to win the White House.\n\nSecretary of State Alex Padilla's formal approval of Mr. Biden's win in the state brought his tally of pledged electors to 279, according to a tally from The Associated Press. That's just over the 270 threshold for victory. \n\nThese steps in the election are often ignored formalities. But the hidden mechanics of electing a U.S. president have drawn new scrutiny this year as President Trump continues to deny Mr. Biden's victory and pursues increasingly specious legal strategies aimed at overturning the results before they are finalized.\n\nAlthough it's been apparent for weeks that Mr. Biden won the presidential election, his accrual of more than 270 electors is a key step toward the White House, said Edward B. Foley, a law professor at Ohio State University. \n\n\"It is a legal milestone and the first milestone that has that status,\" Foley said. \"Everything prior to that was premised on what we call projections.\"\n\nThe electors named Friday will meet December 14, along with counterparts in each state, to formally vote for the next president. Most states have laws binding their electors to the winner of the popular vote in their state, measures that were upheld by a Supreme Court decision this year. There have been no suggestions that any of Mr. Biden's pledged electors would contemplate not voting for him. \n\nResults of the Electoral College vote are due to be received, and typically approved, by Congress on January 6. Although lawmakers can object to accepting the electors' votes, it would be almost impossible for Mr. Biden to be blocked at that point. \n\nThe Democratic-controlled House and Republican-controlled Senate would both vote separately to resolve any disputes. One already has arisen from Pennsylvania, where 75 Republican lawmakers signed a statement on Friday urging Congress to block the state's electoral votes from being cast for Mr. Biden. But the state's Republican U.S. senator, Pat Toomey, said soon after that he would not be objecting to Pennsylvania's slate of electors, underscoring the difficulty in trying to change the election results through Congress.\n\n\"As a practical matter, we know that Joe Biden is going to be inaugurated on January 20,\" Foley said.\n\nThat was clear in the days after the election, when the count of mail ballots gradually showed that Mr. Biden had won victories in enough states to win the Electoral College. It became even more apparent in late November, when every swing state won by Mr. Biden certified him as the winner of its elections and appointed his electors to the Electoral College. Mr. Trump has fruitlessly tried to stop those states from certifying Mr. Biden as the winner and appointing electors for the former vice president. \n\nHe made no such effort in deeply Democratic California, the most populous state in the nation. Three more states won by Mr. Biden — Colorado, Hawaii and New Jersey — have not yet certified their results. When they do, Mr. Biden will have 306 Electoral College votes to Trump's 232. \n\nMr. Trump and his allies have brought at least 50 legal cases trying to overturn the results in the swing states Mr. Biden won — mainly Arizona, Georgia, Michigan, Pennsylvania and Wisconsin. More than 30 have been rejected or dropped, according to an AP tally.\n\nMr. Trump and his allies have also raised the far-fetched notion that Republican state legislatures in those states could appoint a rival set of electors pledged to Mr. Trump.\n\nBut state Republican leaders have rejected that approach, and it would likely be futile in any case. According to federal law, both chambers of Congress would need to vote to accept a competing slate of electors. If they don't, the electors appointed by the states' governors — all pledged to Mr. Biden in these cases — must be used. \n\nThe last remaining move to block the election would be the quixotic effort to vote down the electors in Congress. \n\nThis tactic has been tried — a handful of congressional Democrats in 2000, 2004 and 2016 objected to officially making both George W. Bush and Mr. Trump president. But the numbers were not enough to block the two men from taking office.", "time": 1607175571.0}, {"subreddit": "politics", "text": "Hayes Brown is a writer and editor for MSNBC Daily, where he helps frame the news of the day for readers. He was previously at BuzzFeed News and holds a degree in international relations from Michigan State University.\nDec. 4, 2020, 6:04 AM CST\nMelania Trump should have had 2020 off. The coronavirus was supposed to be her excuse to kick back, relax and use the pandemic as a reason to not worry about hosting holiday events at the White House. But there will be as many as 20 Christmas events this year, despite Covid-19. What I want to know is: Who bullied Melania into doing all this Christmas stuff?\n\nOne of the few joys we’ve had during the Trump administration has been learning how warped Melania’s tastes are when it comes to jolly Christmastime fun.\n\nWe know how much she resents this particular part of her duty as first lady. And yet one of the few joys we've had during the Trump administration has been learning how warped Melania's tastes are when it comes to jolly Christmastime fun. Besides being extremely extra in her aesthetic, her White House Christmas decorations have trended Victorian — but less in the \"A Christmas Carol\" sense, with the waistcoats and bonnets and the carol singing, and more in the \"this mansion is possessed by the ghost of a vengeful spinster abandoned at the altar at Yuletide\" sense.\n\nSangeeta Singh-Kurtz of New York Magazine's The Cut perfectly illustrated this trend Monday when she gave readers a look back at Melania's holiday décor \"ranked from most to least haunted.\" The top slot went to 2018, when the East Wing was ceremoniously lined with blood-red trees, invoking a visceral horror scene.\n\n\nWhile this year's fare is much tamer, it's still worth wondering why she had to go through the trouble at all. This fall, America learned that Melania does not enjoy Christmas, at least not at the White House. We know this thanks to her former friend and staffer Stephanie Winston Wolkoff, whose tell-all book came out in September. In October, she was still making the rounds to promote it. And this time, she came with audio, a conversation with Melania that she'd secretly recorded in July 2018.\n\nIn a clip that aired on CNN, the first lady was heard sounding a lot like her husband as she railed about how the media covers her. She also lamented that she was forced to take charge of the White House Christmas decorations.\n\n\"I'm working like — my ass off — on Christmas stuff, you know?\" Melania could be heard saying. \"Who gives a f--- about Christmas stuff and decorations? But I need to do it, right?\n\n\"Then I do it,\" she continued. \"And I say that I'm working on Christmas planning for the Christmas. And they said, 'Oh, what about the children that they were separated?' Give me a f---ing break. Where they were saying anything when Obama did that?\"\n\nWe got precious little time to savor the audio before the 2020 news cyclone swept it away. Within hours of her diatribe's having become public, President Donald Trump announced that he and Melania had tested positive for Covid-19. But we had just enough time to gift us with this banger of a remix from YouTubers The Gregory Brothers.\n\nThankfully, Melania recovered fully, leaving her able-bodied enough to take up the Christmas decoration reins once again. But the question remains: Who's making Melania do all of this in the middle of a pandemic? Is this her just going along with her duty, or was it deemed a political matter and thus outside her ability to turn down?\n\nThose in the West Wing seem to be using the multiple Christmas parties as a final act of defiance, snubbing their noses at the nattering nabobs of negativity who think it's a bad idea to host large events in the middle of a pandemic.\n\nWho’s making Melania do all of this in the middle of a pandemic?\n\n\"If you can loot businesses, burn down buildings, engage in protests, you can also go to a Christmas party. You can celebrate the holiday of Christmas, and you can do it responsibly,\" White House press secretary Kayleigh McEnany told reporters Wednesday.\n\nMelania's chief of staff, former White House deputy press secretary Stephanie Grisham, was a bit more circumspect when asked about safety precautions. \"Guests will enjoy food individually plated by chefs at plexiglass-protected food stations,\" she said in a statement.\n\n\"All passed beverages will be covered. All service staff will wear masks and gloves to comply with food safety guidelines. Attending the parties will be a very personal choice,\" she said. \"It is a longstanding tradition for people to visit and enjoy the cheer and iconic décor of the annual White House Christmas celebrations.\"\n\n\nAnd it isn't just the White House. Secretary of State Mike Pompeo risked being boiled with his own pudding and buried with a stake of holly through his heart by his staffers this year. After warning his subordinates at various State Department missions not to hold holiday events, Pompeo is going full Mr. Fezziwig this year; The Washington Post reported that at least 900 invitations have gone out for Pompeo's entirely indoor parties.\n\nAll in all, it's par for the course for this administration. For the last nine months, Trump and his top lieutenants have refused to set any kind of example for Americans looking for some guidance about how to cope with the pandemic. Instead, the administration and the campaign hosted what appear to have been multiple super-spreader events and utterly ignored guidelines for mask-wearing and social distancing. As medical professionals warn against gathering for Christmas, the White House's fetes continue.\n\nSo, who did it? Who bullied the Trump administration's chief anti-bullying advocate into hosting one more year's worth of Christmas stuff? If I had to guess — and this is, in fact, a total guess — I'd put my money on White House chief of staff Mark Meadows as being the Ghost of Christmas Present. Meadows, while not running the tightest ship, is big on the schmoozing that Christmas parties in Washington invite. And he's been right there along with Trump in terms of skepticism about preventing the spread of Covid-19, despite having tested positive himself in November.\n\nAh well, this is the last year that Melania will have to worry about being drafted to fight in the War on Christmas — at least for a while. This time next year, it will be Jill Biden's turn to throw the soirees, but 'til then we'll have to muddle through somehow.", "time": 1607175533.0}, {"subreddit": "politics", "text": "This holiday season is different in countless ways. A global pandemic, a fractured presidential transition and baseless claims of voter fraud underscore how chaotic this year has been.\n\nBut one thing rings familiar: The Federal Communication Commission is continuing its tradition of handouts to broadcasters by giving Fox Corporation — the television conglomerate owned by the Murdochs — a parting gift before the agency’s GOP leadership heads for the exit. Trump may have soured on Fox since he lost the election, but it seems his FCC chairman, Ajit Pai, has not.\n\nIn early October, Fox filed a request with the FCC for a waiver of the longstanding newspaper-broadcast cross-ownership (NBCO) rule that prohibits one company from owning too many newspapers and TV stations in a single market. The Murdochs need the waiver to continue to own WWOR-TV in New Jersey along with the New York Post. Fox also owns WNYW in New York City, the same metro market as WWOR.\n\nFox has already received multiple temporary waivers of the rule. Now, it’s arguing that a so-called “cloud of regulatory uncertainty” necessitates a permanent waiver. This is laughable, considering how long the Fox situation in New York and New Jersey has gone on — and how long WWOR has failed to provide local coverage to its New Jersey viewers.\n\nThe NBCO rule dates to 1975, when the FCC determined that having one company own local print and broadcast outlets in the same market would harm localism, diversity, and competition. Broadcast lobbyists like to claim that the rule is outdated because we have the internet now. But the fact remains that local broadcasters and newspapers still generate the vast majority of local-news coverage.\n\nThe fight over these rules will be argued before the Supreme Court next month. Fox has been fighting to get around these diversity protections since it bought WWOR in 2001. And recent events reveal just how far the outgoing Trump FCC might go to sneak in one last favor for Fox.\n\nSCROLL TO CONTINUE WITH CONTENT\n\nNever Miss a Beat.\n\nGet our best delivered to your inbox.\n\nThe agency has signaled that it has little interest in examining the actual merits (or lack thereof) of Fox’s October request. Instead, it’s tipping the procedural scales heavily against public participation, signaling that it will grant Fox’s request without allowing adequate time for people from New York and New Jersey to have much of a say in the matter. This move would further erode the media-ownership rules before the Biden administration steps in. And only Fox stands to benefit from all of this.\n\nIn response to Fox’s waiver request, Sens. Bob Menendez and Cory Booker sent a letter to the FCC outlining WWOR’s failures to serve New Jersey while the temporary waivers have been in place.\n\nThough Fox claims that permanently owning both WWOR and the Post would not harm competition or viewpoint diversity in New Jersey, there is a well-documented and decades-long history of WWOR failing to serve New Jerseyans. \n\nPublic-interest advocates have been sounding the alarm about WWOR and have opposed Fox’s series of waivers for years. In 2013, WWOR closed its news department and instead began airing a TMZ-style “news” program called Chasing New Jersey. Then in September 2018, Fox sold its Secaucus TV station and moved its studio to New York — an act that Menendez described as “the final nail in the coffin on any legitimate claim to calling themselves a New Jersey broadcast station.” The letter from Menendez and Booker is just the latest iteration in a long series of requests urging the FCC to examine whether WWOR is meeting its legal obligations to New Jersey.\n\nOn Nov. 10, two powerful House reps —  Energy and Commerce Committee Chairman Frank Pallone (D–New Jersey) and Communications and Technology Subcommittee Chairman Mike Doyle (D–Pennsylvania) — wrote a letter to Chairman Pai demanding that the Commission leave controversial items for the Biden administration to address in adherence with “the norms set by past transfers of power.”\n\nRather than slow down, the Pai FCC put its pedal down. It placed the Fox waiver proceeding on a sped-up schedule. In the notice, the FCC set a two-week deadline, with opposition to the request initially due the day after Thanksgiving. In response to public pressure from Free Press and others, the agency added half a week to the comment period — which now wraps up on Dec. 8.\n\nIt couldn’t be clearer that Chairman Pai is just trying to ram this waiver through before he cedes power to the incoming administration. This attempt to rush a gift to Fox is the perfectly corrupt exclamation point to this particular FCC’s tenure. We’ve filed our opposition, and your voice matters too: Tell the Trump FCC that it’s not OK to sneak this last favor to Fox.", "time": 1607175479.0}, {"subreddit": "politics", "text": "Past-tense one\n\nEdit only good one...izza", "time": 1607126549.0}, {"subreddit": "politics", "text": "ATLANTA (WGXA) — Secretary of State Brad Raffensperger is investigating a Florida lawyer caught on tape for tampering with the upcoming Senate election runoff.\n\nAccording to the Secretary of State's Office, the lawyer was caught on tape planning to encourage two million people to move to Georgia before the January 5 Senate runoff elections. Then he allegedly planned to use these people to register and cast a ballot in the runoff.\n\nOnly true Georgia residents can register to vote and cast a ballot in elections in Georgia according to Georgia law.\n\n“Make no mistake, individuals who attempt to undermine the integrity of Georgia’s elections will be investigated and prosecuted to the fullest extent of the law,” said Secretary Raffensperger. “Those who move to Georgia just to vote in the Senate runoffs with no intention of staying are committing a felony that is punishable with jail time and hefty fines. They will be found, they will be investigated, and they will be punished.”\n\nDuring a November 7 speech to the Bay County Florida Republican Party, Florida Attorney Bill Price said he was moving to Georgia and moving in with his brother in order to register to vote and cast a ballot in the January 5 Senate runoff elections.\n\nHe exhorted those in attendance to be “his roommate in Georgia” and also register to vote fraudulently in the state.\n\nThe Secretary of State’s office has launched an investigation of Price’s actions. He attempted to register to vote fraudulently, but his registration is still in pending status according to the office.\n\nSecretary Raffensperger has issued warnings repeatedly against individuals looking to move to Georgia solely to cast ballots in the Senate runoffs.\n\nRaffensperger recently announced investigations into third-party organizations soliciting registrations from dead or out-of-state voters. He has also warned that groups that are looking to help others move to Georgia to vote fraudulently could possibly be prosecuted as well.\n\nCGA 21-2-21(a)(4) requires that registrants be “a resident of this state and of the county or municipality in which he or she seeks to vote.” O.C.G.A. 21-2-217(a)(1) adds that “the residence of any person shall be held to be in that place in which such person's habitation is fixed, without any present intention of removing therefrom;” this would include individuals who move to Georgia solely for the sake of casting a ballot in an election with no intention of remaining in the state.\n\nFalse registration, i.e. someone who registers to vote knowing that they do not possess the qualifications required by law, is a felony and can be punished by between one and ten years in prison, and/or up to a $100,000 fine (O.C.G.A 21-2-561).\n\nAny individual or group who organizes or finances efforts to bring individuals to Georgia to register falsely as electors may also potentially be charged with felony racketeering under O.C.G.A. 16-14-3(5)(A)(xxii), which can be punishable by between 5 and 20 years in prison and a fine of up to $25,000 PER COUNT (O.C.G.A. 16-14-5).", "time": 1607126497.0}, {"subreddit": "democrats", "text": "For my own sanity, I’ve written off any and all Republicans.  They’re all a lost cause. Every last one. I will forever be anti-Republican.", "time": 1607126103.0}, {"subreddit": "democrats", "text": "In other words, ignore ANYTHING republicunts say. It’s that easy.", "time": 1607117708.0}, {"subreddit": "politics", "text": "Pardons don’t cover impeachment. The Constitution says it specifically. I’m curious what mental gymnastics would be needed for SCOTUS to rule against the goddamn Constitution.", "time": 1607117427.0}, {"subreddit": "politics", "text": "Even though it doesn’t mean much, I’ll blaze to this small victory.", "time": 1607116158.0}, {"subreddit": "politics", "text": "LONDON (Reuters) - Heatwaves caused a record 2,556 excess deaths in Britain this summer as the country was struggling to contain the coronavirus pandemic, according to a government estimate published on Thursday.\n\nIncreasingly frequent and severe heatwaves are among the deadliest impacts of climate change, mostly hitting elderly people and other vulnerable groups the hardest, scientists say.\n\n“Unless the government takes urgent action to address the climate emergency, the number of excess deaths due to heatwaves is likely to increase year on year,” said Sandy Robertson of the UK Health Alliance on Climate Change, an advocacy group of health professionals.\n\nBritain suffered a series of heatwaves here in June, July and August in which many weather stations around the country broke or matched their maximum temperature records.\n\nThe estimate of 2,556 excess deaths was the highest since the government launched a plan to manage the health effects of hot temperatures after an estimated 2,234 people died in England during a pan-European heatwave in 2003.\n\nResearchers said high temperatures alone could not explain all the deaths, raising questions over whether the pandemic may have served to amplify the impact of the heat.\n\nSome experts have questioned whether people might have hesitated to seek help for heat-related complaints for fear of catching COVID-19 in hospitals. The authors of the study said further research was needed.\n\nAlthough scientists have yet to establish the role that climate change may have played in this year's heatwaves, a previous study found that it had made a heatwave that hit Western Europe in 2019 at least 10 times more likely here.\n\n“Heat waves are the extreme weather events for which climate change is a real game-changer in most parts of the world, but particularly in Europe,” said Friederike Otto, a climate scientist at the University of Oxford.\n\nReporting by Matthew Green;Editing by Elaine Hardcastle", "time": 1607116116.0}, {"subreddit": "politics", "text": "I bet tRump is so happy that an Africa American female is about to put her foot up his ass.", "time": 1607110015.0}, {"subreddit": "politics", "text": "Love the plural", "time": 1607109942.0}, {"subreddit": "politics", "text": "The best of losers?", "time": 1607109789.0}, {"subreddit": "politics", "text": "Tesla CEO Elon Musk put his California houses on the market this year while he was sparring with state lawmakers over Covid-19 restrictions. He's simultaneously been expanding operations in Texas and cozying up to Republican Gov. Greg Abbott.\n\nNow, several of his close friends and associates say that Musk has told them he's planning to move to the Lone Star State. The people with knowledge of his plans asked not to be named because their conversations were private.\n\nMusk, the world's second-wealthiest person behind Amazon's Jeff Bezos, is in Texas frequently already. He spends most of his time between Austin, where Tesla and his tunnel start-up Boring Company have operations, and a coastal village called Boca Chica, home to a SpaceX facility. SpaceX started operating in Texas in 2003.\n\nYou need only follow Musk on Twitter to see his presence in the state, as he often posts photos and videos from SpaceX's test and launch site known as the Starship Production Complex.\n\nCalifornia, often condemned by the super rich for its high tax rates and stiff regulations, has seen an exodus of notable tech names during the pandemic as companies look to cut costs and prepare for a future of distributed work. Musk has been among the loudest critics this year, comparing the state to a championship sports team that's become complacent and developed a \"winning-for-too-long problem.\"\n\nIn May, as businesses across California were forced to remain closed because of the pandemic, Musk tweeted that he was moving Tesla's headquarters and future development from California to Texas and Nevada.\n\nGetting out of California, with the highest income tax in the country, and into Texas, which has no state income tax, could save Musk billions of dollars based on his compensation package awarded in 2018. Musk was granted 101.3 million options (adjusted after a 5-for-1 stock split this year) that vest over time as the company hits certain milestones, including market cap numbers.\n\nTesla's stock has surged 782% in the past year. As of October, Musk had earned awards currently worth about $20 billion before taxes, based on Thursday's close, a portion of the potential total.\n\nImagine no possessions\n\nNailing down where Musk lives at any given time is a challenge because he claims to be selling all \"physical possessions\" and tweeted in May that he \"will own no house.\" Shortly after that, he put several of his California homes up for sale. CNBC was unable to find any public records that suggest he's officially changed his residence, and the White Pages online database still lists his primary address as Los Angeles.\n\nEven the people who know him well and are aware of his general plans to move to Texas say they don't know where exactly he stays when he's there and that he tries to keep those details private.\n\nThe state's top lawmaker, Gov. Abbott, certainly seems to think Musk is making the move.\n\nIn July, Abbott said on CNBC's \"Squawk Box\" that Musk told him he'd gotten a Texas driver's license and is a \"bona fide Texan now.\" Abbott also said Musk was building his next Tesla factory in the state because it would give him the freedom to \"expand the way he wanted to expand.\" When contacted for this story, a spokesperson for Abbott declined further comment on Musk's plans.\n\nTo help lure Tesla's new factory, Austin officials granted the company tens of millions of dollars in property tax breaks. Musk confirmed on the company's second-quarter earnings call in July that the plant would occupy about 2,000 acres 15 minutes from downtown, and would be used to build the Cybertruck, its Semi, Model 3 and Model Y. Musk said the factory will start delivering cars next year.\n\nIn addition to SpaceX and Tesla, Musk's Boring Company has an office in Texas. Seven of the nascent company's 17 job openings on its website are for positions in Austin, and Musk has hinted at building a tunnel there. Boring Company investor Joe Lonsdale, a co-founder of Palantir and friend of Musk's, recently relocated to the Austin area from Silicon Valley.\n\nFor now, Tesla's headquarters is still in Palo Alto, California, and the company continues to build cars in nearby Fremont. SpaceX's main address is in Los Angeles County at 1 Rocket Road in Hawthorne.\n\nBut Musk's personal financial reasons for leaving California are significant. Under his 10-year compensation package approved in 2018, Musk could earn well over $50 billion in stock and awards in 12 tranches — he's already reached the fourth. He would have to pay income taxes on the profits when he exercises the options. The top state income tax rate in California is 13.3%. In Texas, it's zero.\n\nMusk's awards started kicking in after the company reached $100 billion in market cap along with specific metrics for revenue or adjusted earnings. Each $50 billion increase in market cap, up to $650 billion in total market value, leads to another payout if met with a revenue or profitability target. The company is already worth over $550 billion, after starting the year well below $100 billion.\n\nDuring the third quarter, the second and third tranches vested, and the fourth was achieved in October, the company said in its latest quarterly report. That equals roughly 33.8 million of the 101.3 million shares. For the package to stay intact, Musk must remain either CEO or executive chairman and chief product officer.\n\nMusk and spokespeople for Tesla and SpaceX did not immediately respond to requests for comment.", "time": 1607109635.0}, {"subreddit": "politics", "text": "Even industrial accidents are bigger. Below is just one example of the consequences from little to no oversight/regulations. \n\n[West Fertilizer Company](https://en.m.wikipedia.org/wiki/West_Fertilizer_Company_explosion)", "time": 1607109442.0}, {"subreddit": "politics", "text": "Needs to be a federal tax that can’t be avoided.", "time": 1607109339.0}, {"subreddit": "politics", "text": "Susan Cornwell\nWASHINGTON (Reuters) - The U.S. House of Representatives voted on Friday to decriminalize marijuana at the federal level, but the legislation is not expected to advance further as long as the Senate remains in Republican hands.\n\nFILE PHOTO: Marijuana enthusiasts gather after midnight to celebrate the legalization of recreational use of marijuana in Portland, Oregon July 1, 2015. REUTERS/Steve Dipaola\nIt was the first time either chamber of Congress has voted to end the federal ban on marijuana since the drug was listed as a “controlled substance” in 1970.\n\nFifteen U.S. states and the District of Columbia have legalized recreational use of marijuana, and over 30 states allow some form of the drug for medicinal purposes. U.S. cannabis sales hit record levels over the Thanksgiving weekend.\n\nBut the federal ban on the drug persists, which creates conflicts with state laws and limits cannabis companies’ access to banking services and funding.\n\nThe Democratic-majority House voted 228-164, largely along party lines, to lift the federal prohibition. But Senate Majority Leader Mitch McConnell, a Republican, is an opponent of the change, meaning a decriminalization proposal is unlikely to see Senate action unless Democrats manage to win both Georgia Senate seats and with them Senate control in a Jan. 5 runoff election.\n\nThe bill the House passed would allow states to regulate marijuana, Representative Earl Blumenauer, a Democrat and co-chairman of the Congressional Cannabis Caucus, said in debate.\n\n“This legislation does not legalize cannabis across the country. It stops the federal government from interfering with what states have decided to do,” he said.\n\nRepublican Representative Debbie Lesko said she found it incredible that Democrats were talking about “legalizing marijuana” instead of focusing on passing more relief from the coronavirus pandemic. “Sometimes I think that the world is turned upside down,” she said.\n\nIn fact, the House in May passed a mammoth coronavirus aid bill, but it did not advance in the Republican-run Senate. Negotiations are underway on a smaller compromise bill.\n\nThe cannabis bill would expunge federal marijuana convictions and impose a 5% tax on cannabis products. The revenue raised would help reinvest in communities most adversely impacted by enforcement of the law, Blumenauer said.\n\nReporting by Susan Cornwell; Editing by Bill Berkrot", "time": 1607109264.0}, {"subreddit": "politics", "text": "You are, indeed.", "time": 1607058261.0}, {"subreddit": "politics", "text": "US President Donald Trump has lost another legal challenge to overturn the 2020 election results in Wisconsin.\n\nMeanwhile, Georgia has finished a second recount where president-elect Joe Biden won a majority once more.\n\nSeveral states have already certified their results.\n\nHere's the latest on the recounts and lawsuits taking place regarding the November 3 presidential election results.\n\nLIVE UPDATES: Read our blog for the latest news on the US election and the aftermath.\nWisconsin\n\nMr Trump filed a lawsuit in Wisconsin on Tuesday (local time) seeking to disqualify more than 221,000 ballots in the state's two most Democratic counties.\n\nThe Wisconsin Supreme Court later declined to take up a case by Mr Trump's campaign challenging the election results in the state, the latest in a string of losses the campaign has suffered.\n\nMr Biden won the majority of votes in Wisconsin, edging Mr Trump out by about 20,000 votes, according to the Wisconsin Elections Commission.\n\nThe state certified Mr Biden as the winner on Monday.\n\nMr Trump's petition alleged Wisconsin election officials were directed to fill in missing information on ballot envelopes, issued absentee ballots without receiving applications and allowed people to improperly claim a \"confined\" absentee voting status.\n\nUS election: what's happening now\n\nCatch up on the major news from December 3 in our blog\nThe latest on recounts and court challenges\nThe petition also alleged that events held by election officials in the city of Madison, where officials collected and checked ballots in city parks, not polling stations, were against state law.\n\nWisconsin's top court, in denying the petition, said the parties could pursue a case in a lower court.\n\nMr Trump's lawyer Jim Troupis said he would immediately file the case in circuit court.\n\n\"It was clear from their writings that the court recognises the seriousness of these issues, and we look forward to taking the next step,\" he said in a statement.\n\nUS election 2020\n\nFollow the twists and turns as Donald Trump and Joe Biden face off in the race for the White House.\n\nRead more\nTwo other lawsuits filed by conservatives are still pending with the Wisconsin Supreme Court seeking to invalidate ballots.\n\nIn asking the Wisconsin Supreme Court to take the case directly, Mr Trump had argued that there wasn't enough time to wage the legal battle by starting with a lower court, given the looming December 14 date when presidential electors cast their votes.\n\nSwing Justice Brian Hagedorn joined three liberal justices in denying the petition without weighing in on Mr Trump's allegations.\n\nMr Hagedorn said the law was clear that Mr Trump must start his lawsuit in lower courts where factual disputes can be worked out.\n\nMr Trump filed a similar lawsuit in a federal court on Wednesday.\n\nIn addition to Mr Trump's federal lawsuit, there is another one in federal court with similar claims from Sidney Powell, a conservative attorney who was removed from Mr Trump's legal team.\n\nGeorgia\n\nGeorgia has completed its second recount — that's three counts in total since the original number of votes were released.\n\nMr Biden is headed toward victory in Georgia, Secretary of State Brad Raffensperger said on Wednesday, rejecting false claims of fraud in the race.\n\nMr Biden had beat Mr Trump by just over 12,500 votes in Georgia, with Mr Biden receiving nearly twice as many of the record number of absentee ballots as the Republican president, according to the secretary of state's office.\n\nAfter weathering criticism for certifying Mr Trump's narrow election loss to Mr Biden, Republican officials in Georgia are proposing additional requirements for the state's vote-by-mail process, despite no evidence of systemic fraud or irregularities.\n\nGeorgia Secretary of State Brad Raffensperger looks up towards the ceiling as he speaks during a news conference\nMr Raffensperger has repeatedly said there was no evidence of widespread voter fraud in the November election.(AP: Brynn Anderson)\nPennsylvania\n\nFresh off another rejection in Pennsylvania's courts, Republicans again asked the US Supreme Court to block Mr Biden's victory in the battleground state.\n\nMeanwhile, the state's lawyers say fatal flaws in the original case mean justices are highly unlikely to grant it.\n\nRepublican US congressman Mike Kelly, of north-western Pennsylvania, and the other plaintiffs are asking the high court to prevent the state from certifying any contests from the November 3 election, and undo any certifications already made, such as Mr Biden's victory, while its lawsuit is considered.\n\nThey maintain that Pennsylvania's expansive vote-by-mail law is unconstitutional because it required a constitutional amendment to authorise its provisions.\n\nMr Biden beat Mr Trump by more than 80,000 votes in Pennsylvania, a state Mr Trump had won in 2016.\n\nMost mail-in ballots were submitted by Democrats.\n\nThe state's justices refused Thursday, and Mr Kelly's lawyers promptly refiled the case in the US Supreme Court.\n\nIn the underlying lawsuit, Mr Kelly and the other Republican plaintiffs had sought to either throw out the 2.5 million mail-in ballots submitted under the law or to wipe out the election results and direct the state's Republican-controlled legislature to pick Pennsylvania's presidential electors.\n\nWhat happens next?\n\nThe states have until December 8 to resolve election disputes.\n\nAfter that, each state's electors have a further six days to vote by paper ballot before Congress meets to count the electoral votes on January 6.\n\nGot a question about the 2020 US election?\n\nSend us your questions, thoughts, and stories about the 2020 US election. Your question will help guide our coverage.\n\nRead more\nOnce a candidate has received 270 or more electoral votes, the President of the Senate will officially announce the results on December 14.\n\nThe winning candidate will then be officially sworn in as president on inauguration day — January 20.\n\nMr Trump said last week he would leave the White House if, as expected, the electoral college confirms Mr Biden has won the 2020 election.\n\nIt is the nearest Mr Trump has come to a concession.\n\nSome US states are still yet to certify results but are expected to do so in coming days.", "time": 1607052382.0}, {"subreddit": "politics", "text": "New York Attorney General Letitia James has vowed to continue her office’s investigation into President Donald Trump’s businesses that are based in the state.\n\nJames issued a statement following a speech made by Trump at the White House yesterday in which he quoted James without providing a source for the quotes attributed to her and blasted investigations into his business affairs.\n\nTrump letitia james\nJames\nBecause some of Trump’s businesses are in New York they fall under James’ jurisdiction. Manhattan Distrct Attorney Cyrus Vance Jr. also has been conducting an investigation into Trump’s business affairs. \n\nThe accredited White House press corps was banned from attending Trump’s speech, which the White House sent out via Facebook. The major television networks declined to carry the speech, which lasted 46 minutes and had been posted on teleprompters for Trump to read.\n\nMost of the speech consisted of repeats of numerous lies previously told by him about the conduct of the election, including claims that he won, and included new allegations of election misconduct for which he provided no evidence.\n\nIn the portion dealing with the New York investigations, Trump stated: “I hear that these same people that failed to get me in Washington have sent every piece of information to New York, so that they can try to get me there. It’s all been gone over, over and over again. For $48 million you go through tax returns, you go through everything.\n\n“The New York attorney general, who recently ran for office campaigned without knowing me stating, ‘We will join with law enforcement and other attorneys general across this nation in removing this president from office.’ I never met her. It’s important that everybody understand she’s better. ‘It’s important that everybody understands,’ she said, ‘that the days of Donald Trump are coming to an end.’ And all it’s been, is a big investigation in Washington and New York and any place else that can investigate because that’s what they want to do.”\n\nIn her statement issued shorty before 8 last night, James said: “As the independently elected attorney general of New York, I have a sworn duty to protect and uphold state law. Last year, after Michael Cohen’s testimony, our office opened an investigation into the financial dealings of the Trump Organization. That investigation continues today. Unlike the president and the unfounded accusations he hurled today, we are guided by the facts and the law, and the politics stop at the door. Period.”\n\nCohen had served for a decade as Trump’s attorney and close business associate. He alleged in Congressional testimony, numerous interviews and the book “Disloyal” that Trump’s businesses engaged in numerous improprieties.\n\nAs part of James’ investigation, Trump’s son Eric was ordered to testify in a deposition during which he was questioned by investigators from James’ office. The deposition was carried out via video conferencing. Neither Eric Trump, his attorneys, nor James’ office  provided details as to the content of the deposition.\n\nIt was learned that another Trump child, Ivanka, sat for a deposition by investigators from the Washington, D.C., attorney general’s office on Dec. 1. That was in connection with a lawsuit filed by the attorney general’s office against the Trump Organization and the Presidential Inaugural Committee alleging the misuse of inaugural committee funds. Documents have been subpoenaed from Ivanka Trump, first lady Melania Trump and others in connection with that investigation.\n\nThe New York Times reported Dec. 1 that President Trump has had discussions with advisors about issuing presidential pardons to his children, son-in-law Jared Kushner and former New York City Mayor Rudolph Giuliani who has been serving as Trump’s personal attorney. A presidential pardon applies to violations of federal law and does not shield its recipient from prosecution for violating state laws.", "time": 1607052341.0}, {"subreddit": "politics", "text": "President-elect Joe Biden has joined other top Democrats to back the $908 billion bipartisan COVID-19 relief effort announced this week.\n\nThe plan introduced by “The Problem Solvers Caucus,” a group of 25 Democrats and 25 Republicans in both the U.S. Senate and House, splits the more than $900 billion to 15 different areas.\n\nA majority goes to three areas:\n\n$288 billion for small businesses, including more fund for the Paycheck Protection Program\n$180 billion for additional Unemployment Insurance\n$160 billion for state, local and tribal governments\nSmall businesses\n\nThe Paycheck Protection Program will get another round of funding. The forgivable loans to keep workers on payroll closed applications in August.\n\n“I am particularly pleased that this package includes funding for another round of Paycheck Protection Program forgivable loans, which has helped keep our small businesses afloat.  In Maine alone, the PPP has helped sustain the jobs of 250,000 workers,” said Sen. Susan Collins (R-Maine).\n\nThe $288 billion also will help fund the Economic Injury Disaster Loan program, a low interest loan from the Small Business Administration ” designed to provide economic relief to businesses that are currently experiencing a temporary loss of revenue due to coronavirus.”\n\nThe money will also go to restaurants, stages, and deductibility.\n\nIn addition, Republicans pushed for “short term Federal protection from Coronavirus related lawsuits.”\n\n“Included in this measure is a liability provision that provides a temporary suspension of any liability-related lawsuits at the state or federal level associated with COVID-19, giving states enough time to put in place their own protections,” said Sen. Mitt Romney (R-Utah).\n\nState, local and tribal governments\n\nDemocrats, meanwhile, got a win with funding for state, local and tribal governments. State governments have been dealing with many key aspects of the COVID-19 response.\n\n“If enacted into law, today’s bipartisan package would increase unemployment benefits to help families make ends meet, give essential assistance to small businesses on the verge of closing, provide funds to the state and local governments who’ve led the response to this crisis, and much more – including support for schools, hospitals, and vaccine distribution,” said Sen. Angus King (I-Maine), an independent who caucuses with the Democrats.\n\nUnemployment insurance\n\nExtended federal unemployment benefits expired in September. Previously, the program added a $600 federal benefit.\n\nThis plan would provide a $300 weekly addition for four months.\n\nStimulus checks?\n\nNo, the plan doesn’t include the second round of economic impact payments. Earlier in the year, the IRS issued 160 million checks of $1,200 per eligible taxpayer, plus $500 per child.\n\nWhat else is included:\n\nThe rest of the funds will go to support:\n\n$82 billion for education\n$45 billion for transportation, including airlines, airports, buses, transit and Amtrak\n$35 billion for the Healthcare Provider Relief Fund from the Department of Health and Human Services\n$26 billion for nutrition and agriculture\n$25 billion for housing assistance, related to rentals\n$16 billion for vaccine development and distribution, testing and contact tracing\n$12 billion for Community Development Financial Institutions and Minority Depository Institutions\n$10 billion each for the U.S. Postal Service, child care and broadband\n$5 billion for opioid treatment\n$4 billion for student loans\n“This is a win for the American people, for common sense, and for problem-solving. With cases spiking, winter around the corner, and countless small businesses closing every day, and far too many families hurting, we simply cannot leave anyone out in the cold. This is an essential down payment on what our families, small businesses, and local communities need,” said Rep. Josh Gottheimer (D-NJ-5).\n\nSenate Majority Leader Mitch McConnell dismissed the bipartisan offer on Tuesday, instead aiming to rally Republicans around the $550 billion GOP proposal.", "time": 1607052240.0}, {"subreddit": "democrats", "text": "I’m sure he’s friends with some catholic clergy", "time": 1607047544.0}, {"subreddit": "politics", "text": "This is America \n\nWhere greed is king", "time": 1607004073.0}, {"subreddit": "politics", "text": "Ivanka Trump was deposed on Tuesday as a part of an ongoing lawsuit from the Washington D.C. attorney general, which alleges the misuse of funds from President Donald Trump's inauguration in 2017, new court documents show.\n\nD.C. Attorney General Karl Racine sued Mr. Trump's inaugural committee and the businesses overseeing Trump International Hotel in Washington back in January, claiming the nonprofit inaugural committee coordinated with Trump family members to overpay for event space in a way that enriched the Trumps. Racine claims the inaugural committee knew it was paying above-market prices and failed to consider cheaper alternatives. The lawsuit, filed in D.C. Superior Court, alleges more than $1 million was wasted on improper payments to the Trump Hotel for event space during the 2017 inauguration.\n\nCNN first reported Ivanka Trump's deposition.\n\nThe elder Trump daughter, as a senior adviser to the president, has been intimately involved in the inner-workings of the White House and assisted her father with the 2016 and 2020 presidential campaigns.", "time": 1607003493.0}, {"subreddit": "politics", "text": "This always seemed like the the most likely outcome, but Trump had complicated things with his temper tantrum demands and his threat to veto the National Defense Authorization Act (NDAA) if it didn't include a clause wiping out Section 230. However, Congress has come to its senses and leaders of both parties have said they'll ignore his impotent veto threat and move forward with the bill as is.\n\nThe final version of the National Defense Authorization Act that will soon be considered by the House and Senate won’t include Trump’s long-sought repeal of the legal immunity for online companies, known as Section 230, according to lawmakers and aides.\n\nKey to this was Senate Armed Services Chair Jim Inhofe pointing out the obvious:\n\n\"First of all 230 has nothing to do with the military.\"\n\nThat's both first of all and last of all. The whole attempt to use the NDAA to attack CDA 230 was just bizarre.\n\nInhofe did say he still thinks that 230 should go, but not as a part of the NDAA. A few other Republicans are finally speaking up as well.\n\nStill, Republicans on Wednesday showed some signs of exasperation with the president’s latest effort. As one GOP lawmaker put it: “Republicans are sick of this shit.”\n\nSen. Mike Rounds (R-S.D.), who sits on the Senate Armed Services Committee, put it more delicately. While he said he understood the president’s frustrations with Section 230, it was not worth imperiling the broader defense bill.\n\n“The NDAA is so important to the men and women that wear the uniform that this should not be an item to veto the act over,” he said. “So I would hope he would reconsider his position on it.”\n\nAnd Senate Majority Whip John Thune (R-S.D.) said his “preference” would be to pass the NDAA and then address Section 230 separately.\n\nDemocratic critics of Section 230 were equally as annoyed. Remember, Senator Richard Blumenthal has been one of the most vocal critics of Section 230 going back to the time before he was a Senator and when he was stymied in trying to sue Craigslist by Section 230 (he was upset that sex workers use Craigslist, and wanted to blame Craigslist for the fact that sex workers exist).\n\nSen. Richard Blumenthal (D-Conn.), a co-sponsor of the only bipartisan bill targeting Section 230 to advance out of committee this Congress, called the veto threat \"deeply dangerous and just plain stupid.”\n\nHe added, “Reforming Section 230 deserves its own debate — one that I’ve helped lead in Congress, and which I look forward to continuing with a more serious, thoughtful administration in January.”\n\nIn another article, Rep. Frank Pallone stated the obvious:\n\nHouse Energy and Commerce Committee Chairman Frank Pallone said in a statement that Trump is \"holding a critical defense bill hostage in a petulant attempt to punish Twitter for fact-checking him. Our military and national security should not suffer just because Trump's ego was bruised.\"\n\nThere is still plenty of appetite to attack Section 230. And there will be lots of dumb fights about it, but it's not going down this way.\n\nHide this\nThank you for reading this Techdirt post. With so many things competing for everyone’s attention these days, we really appreciate you giving us your time. We work hard every day to put quality content out there for our community.\n\nTechdirt is one of the few remaining truly independent media outlets. We do not have a giant corporation behind us, and we rely heavily on our community to support us, in an age when advertisers are increasingly uninterested in sponsoring small, independent sites — especially a site like ours that is unwilling to pull punches in its reporting and analysis.\n\nWhile other websites have resorted to paywalls, registration requirements, and increasingly annoying/intrusive advertising, we have always kept Techdirt open and available to anyone. But in order to continue doing so, we need your support. We offer a variety of ways for our readers to support us, from direct donations to special subscriptions and cool merchandise — and every little bit helps. Thank you.\n\n–The Techdirt Team", "time": 1607003425.0}, {"subreddit": "politics", "text": "Gaslight\nObstruct\nProject", "time": 1606955855.0}, {"subreddit": "politics", "text": "And the ones that don’t are mentally retarded.", "time": 1606945763.0}, {"subreddit": "politics", "text": "I don’t know a single person that gives a single iota of a shit about her.", "time": 1606945506.0}, {"subreddit": "politics", "text": "Fuck off you asshole", "time": 1606760261.0}, {"subreddit": "politics", "text": "The words of LBJ ring so true atm\n\n\n\n“If you can convince the lowest white man he's better than the best colored man, he won't notice you're picking his pocket. Hell, give him somebody to look down on, and he'll empty his pockets for you.\"", "time": 1606752004.0}, {"subreddit": "democrats", "text": "Yes, little donnie. The American people took a big ole shit on you.", "time": 1606693420.0}, {"subreddit": "democrats", "text": "They have to be afraid of something. It’s always something. It will always be something. Ridiculous!", "time": 1606693118.0}, {"subreddit": "politics", "text": "Especially when it’s the potus", "time": 1606685563.0}, {"subreddit": "politics", "text": "Former State Sen. Eugene Fraise, 88, died on Friday afternoon in West Burlington due to COVID-19 complications.\n\nThe West Point native married Faye Pumphrey in 1949. They had four children, 14 grandchildren, 32 great-grandchildren, and five great-great-grandchildren. According to his obituary, he dedicated his life to \"his family and friends, farming and serving the people of Iowa.\"\n\nAdvertisement\n\nHe first was a Lee County supervisor for seven years before serving as senator for Iowa's 42nd District. He retired after 27 years.\n\n\"He was particularly proud of being instrumental in the building of the 61 Bypass, the Bridgeport Bridge project and serving as the only non-lawyer judiciary committee head in the history of the state of Iowa,\" his obituary stated. He saw \"his family as being his greatest achievement. To them, he walked on water.\"\n\nThe obituary states that complications due to COVID-19 resulted in his death.", "time": 1606675513.0}, {"subreddit": "politics", "text": "He won at losing", "time": 1606662484.0}, {"subreddit": "politics", "text": "They can’t think for themselves. Simply as that.", "time": 1606573369.0}], "republican_score": 0, "democrat_score": 7}