{"name": "drm604", "posts": [{"subreddit": "politics", "text": "I've been the victim of \"it's just business\" more than once. I had a job that I was good at and was well liked by my coworkers. Practically everyone but me knew for months that they were restructuring and that my position would be gone. No one said anything because I was needed up until that point. People I liked said hey, it was nothing personal, just business!\n\nRight after Thanksgiving I was given notice that my lease was not being renewed and that I have to be out by Dec. 31. This is during a pandemic and over Christmas. I've lived here for decades and always paid my rent on time, and I'm currently on disability, but the landlord wants to remodel. But hey, it's just business!\nIn this country,  \"just business\" is like a mantra used to justify amoral behavior, and everyone just accepts it.", "time": 1607216755.0}, {"subreddit": "politics", "text": "Your post intrigued me enough that I had to click on the link. I didn't know who Harry Styles was, and I'm still not sure, but they do seem to be obsessed with him. But now thanks to you I've visited that subreddit and now I need some brain bleach.", "time": 1607215720.0}, {"subreddit": "democrats", "text": "Are they saying that a coup had occurred, or are they advocating one?", "time": 1607110640.0}, {"subreddit": "politics", "text": "But Rudy, I thought you didn't do anything. Whatever would you need a pardon for?\n/s", "time": 1606855008.0}, {"subreddit": "politics", "text": "Maybe they can tie it up in the courts until Biden is in office.", "time": 1606440685.0}, {"subreddit": "politics", "text": "I saw those billboards as a child on a family trip to Disney World. I don't know if it's changed but at the time the billboards featured a racist stereotype of a \"bandito\" named Pedro. They'd say things like \"Pedro  says visit South of the Border!\" They went on for miles.\n\nhttps://en.m.wikipedia.org/wiki/South_of_the_Border_(attraction)", "time": 1606351576.0}, {"subreddit": "politics", "text": "Reading that NPR article, it sounds like she made the decision herself but Trump tried to take credit afterwards by tweeting that he told her to do it.", "time": 1606187551.0}, {"subreddit": "politics", "text": "This is a big deal because transitions take time, and waiting till the last minute could cause all kinds of problems, including national security issues.", "time": 1606187117.0}, {"subreddit": "democrats", "text": "Sigh. That's my state. We have a Democratic governor because of Philly and Pittsburgh, but a Republican dominated legislature because of the rest of the state.", "time": 1605975336.0}, {"subreddit": "politics", "text": "Wasn't he convicted by the state? Trump can't pardon state crimes.", "time": 1605866969.0}, {"subreddit": "politics", "text": "A limited ceremony may be a good idea for more than one reason. I fear that some crazy trumpists may try to attack the crowd.", "time": 1605845035.0}, {"subreddit": "democrats", "text": "Oh yeah, it's probably a pipe dream, but it's something to think about.", "time": 1605738930.0}, {"subreddit": "democrats", "text": "You literally create more states. Admit DC, Puerto Rico, Guam, American Samoa; and maybe others I'm not thinking of.\n\nOf course we need Democratic control to do that.", "time": 1605725622.0}, {"subreddit": "politics", "text": "I find that article confusing. It seems to be saying that there are ways for a Senate majority to limit the VP's power in this regard, but I may be misunderstanding it. Surely Biden would have stepped in and limited McConnell's obstructionism if it had been possible for him to do so, at least for Garland's nomination if nothing else.", "time": 1605661605.0}, {"subreddit": "politics", "text": "Call him Dr. Mengele.", "time": 1605651311.0}, {"subreddit": "politics", "text": "It would likely not be peaceful, but this is monstrous either way.", "time": 1605651186.0}, {"subreddit": "politics", "text": "Is it crazy for me to wonder if people like Atlas want to use this as an opportunity to reduce the number of Social Security and Medicare recipients? They seem to be encouraging behavior that will spread infection.", "time": 1605649314.0}, {"subreddit": "politics", "text": "He's smart and progressive but has that superficial blue collar macho appearance and personality that appeals to uneducated blue collar workers, the kind who voted for trump.", "time": 1605362381.0}, {"subreddit": "politics", "text": "Proud to say he's my Lt. Governor. I think he has a real future.", "time": 1605361670.0}, {"subreddit": "politics", "text": "The state capital is Harrisburg, not Philly.", "time": 1604849273.0}, {"subreddit": "politics", "text": "How does this even happen? Do landscapers normally book parking lot events?", "time": 1604847634.0}], "republican_score": 0, "democrat_score": 4}