{"name": "Steelplate7", "posts": [{"subreddit": "democrats", "text": "I just saw the newest Trump campaign Advertisement...he says that he will creat 10 million jobs in 10 months...let’s take a quick look, shall we?\n", "time": 1601934834.0}, {"subreddit": "democrats", "text": "Trump had the culmination of the RNC Convention on the White House lawn.\n", "time": 1598616396.0}, {"subreddit": "politics", "text": "Linda Tripp passed today\n", "time": 1586384618.0}, {"subreddit": "democrats", "text": "Isn’t it kind of cool how Barack Obama is taking a back seat?\n", "time": 1583280125.0}, {"subreddit": "democrats", "text": "My wife and I just returned from a trip to Harpers Ferry...\n", "time": 1582332923.0}, {"subreddit": "democrats", "text": "Does anyone think that too many of my “Freedom Loving” Brethren care too much about people’s gender/sexual preferences?\n", "time": 1581121113.0}, {"subreddit": "democrats", "text": "I got to admit...I am very concerned about the future of our country.\n", "time": 1575390308.0}, {"subreddit": "democrats", "text": "Just an observation...how can us Democrats capture the solidarity and energy of the right, without sacrificing decency and honor?\n", "time": 1572654106.0}, {"subreddit": "democrats", "text": "Are there any patriotic Republicans left?\n", "time": 1566557691.0}, {"subreddit": "democrats", "text": "Please....give Biden the tools he needs.", "time": 1607220145.0}, {"subreddit": "politics", "text": "I honestly believe this is a really good idea. The only thing is? It should be seamless to go on to a Bachelor’s degree.\n\nWhether that requires universities to accept Community College credits or Community Colleges to standardize their curriculum? I don’t know.\n\nI think it would be a great chance to give our youths a little bit of a leg up.", "time": 1607218228.0}, {"subreddit": "politics", "text": "What poison pills? The 5% federal tax proposed?", "time": 1607180442.0}, {"subreddit": "democrats", "text": "Where we go one... we go all....Fuck Trump!\n\nThere is more evidence against this over privileged asshole than there has been anyone else in the public sphere who has not been exposed already.\n\nAnd yet they worship him like a God. At least we fucking get rid of these people(Weiner, for example...or Gary Hart, or John Edwards...or even Al Frankin...who didn’t deserve it).\n\nC’mon you Qanon cocksuckers.... stand up for what you “allegedly” believe in. You have more real proof against Trump than anyone else. Why aren’t you slinking away from him like rats on a sinking ship?\n\nDon’t worry....I know exactly why. Because you really don’t care about pedophiles beyond social media. You care more about a percentage point or two savings on your taxes.\n\nStop pretending you care. You care about nothing.", "time": 1607049874.0}, {"subreddit": "politics", "text": "Not at all...\n\nThe truth is... it doesn’t matter what I say...it doesn’t matter what links I dig up, no amount of real life evidence will ever dissuade you from your moronic political stance...\n\nYou are JUST like a Trumper...and I don’t entertain those assholes either.", "time": 1607036609.0}, {"subreddit": "politics", "text": "Their tepid rule? Whatever commie.", "time": 1607035989.0}, {"subreddit": "politics", "text": "Nope...if you look at the personnel and include illnesses(Ted Kennedy for one) and whatnot. It figured to be around 9 months.\n\nAnother thing? The Democratic Party isn’t a monolith like the GOP. There are Dems in red areas that would get destroyed if they voted “too liberal”. \n\nHaving a representative or senator who votes with the party 70% of the time is better than having a Republican who will never vote with the party.\n\nBut I know, it takes a lot less effort to just blame one person than it does to try to understand the situation.", "time": 1607029140.0}, {"subreddit": "politics", "text": "Yeah...effectively for a whole 9 months or so.", "time": 1607025683.0}, {"subreddit": "politics", "text": "Well that explains a lot. No policy other than absolute collectivism will do for you.", "time": 1607025622.0}, {"subreddit": "politics", "text": "In case you hadn’t noticed, the GOP had majorities in both houses of Congress for the first two years and McConnell wouldn’t even allow house legation to get heard on the Senate floor for the last two years.", "time": 1607013469.0}, {"subreddit": "politics", "text": "I get tired of hearing the “both sides are the same” BS.\n\nThat’s an easy way out for people who really don’t pay attention to what’s going on, what the platforms are and don’t really care to make an honest comparison of the two parties.\n\nEven those so called “rich Democrats” care about the regular people of this country.", "time": 1607010939.0}, {"subreddit": "politics", "text": "6 years. Senate seats are 6 year terms", "time": 1607010729.0}], "republican_score": 0, "democrat_score": 10}