{"name": "Bekindtoall2020", "posts": [{"subreddit": "democrats", "text": "Local lawyer attempts to register to vote in Georgia.... welcome to Pay County.\n", "time": 1607031097.0}, {"subreddit": "democrats", "text": "You can help.... why do we have a half naked white woman on any flag?\n", "time": 1602261641.0}, {"subreddit": "democrats", "text": "Bay County Florida. This is history right. here. Btw the FDP nor the Biden campaign paid. Local Dems did. Give locally to make these happen.\n", "time": 1600949073.0}, {"subreddit": "democrats", "text": "Schools superintendent said “God” told him being gay is a “choice.” Now he claims he was “set up.”\n", "time": 1594927006.0}, {"subreddit": "democrats", "text": "Florida public school superintendent says kids choose to be gay. How does he know? “God.” | Someone whose understanding of LGBTQ people is so wrapped up in Christian lies should never be in a position to oversee public school students\n", "time": 1594871341.0}, {"subreddit": "politics", "text": "Florida Superintendent Says Kids Choose to Be Gay. How Does He Know? “God.”\n", "time": 1594829986.0}, {"subreddit": "politics", "text": "We have allowed the hate, fear and greed for too long.  \n\nIt’s time we stand up and demand better.", "time": 1607210339.0}, {"subreddit": "politics", "text": "But yet his Rally in PCB was under $15,000  and he paid the bill.   Did I mention the mayor gave him free fire and police. \n\nThe same mayor who said not to hire anyone who can become pregnant.  The town is PCB and has the most sexist flag in the USA. \n\n\nhttps://www.change.org/p/panama-city-beach-city-council-the-most-sexist-flag-in-the-usa-0df9c5d8-4889-483d-8f62-ec377ef17cda?redirect=false", "time": 1604106599.0}, {"subreddit": "politics", "text": "We need to start running for local offices such as supervisor if elections.  We need to stand up and stop allowing these bad behaviors.", "time": 1603686022.0}, {"subreddit": "politics", "text": "This is my town.  This is the 2nd inside event in 45 days from the Trump team.", "time": 1602249636.0}, {"subreddit": "politics", "text": "As someone who graded debates.  I would have stopped Trump due to not following the rules.  Big adult bullies don’t win a debate.", "time": 1601518073.0}, {"subreddit": "democrats", "text": "There are 5 total. This one was 98 and 231", "time": 1601006989.0}, {"subreddit": "politics", "text": "We don’t have to wonder.  We have allowed the hate, fear and greed to run our society.", "time": 1600828566.0}], "republican_score": 0, "democrat_score": 6}