{"name": "Landontaylor2020", "posts": [{"subreddit": "democrats", "text": "Just a quick question about Trump...\n", "time": 1606149560.0}, {"subreddit": "democrats", "text": "A little food for thought...\n", "time": 1605831850.0}, {"subreddit": "democrats", "text": "Trump pissed off Captain America, and his response is priceless.\n", "time": 1605393690.0}, {"subreddit": "democrats", "text": "The Captain has spoken.\n", "time": 1605284108.0}, {"subreddit": "democrats", "text": "I could have sworn that’s what I said. My mistake. Lmao", "time": 1607201690.0}, {"subreddit": "politics", "text": "In short, not wearing a mask in public should be treated as nothing less than a hate crime, with similar consequences.", "time": 1607190731.0}, {"subreddit": "politics", "text": "Why would we expect anything more than a childish temper tantrum from far-right subscribers, when they are simply following the rhetoric and example of their now-fallen leader? Temper tantrums, threats of violence, and lack of accountability have flooded the media for over five years now, and they have become emboldened by it. We have got to start issuing gross, wide-spread punishments and consequences to this behavior NOW, if we ever want to stem the tide.", "time": 1607190625.0}, {"subreddit": "democrats", "text": "Alex Jones hasn’t said a true word in his entire(ly too long) life.", "time": 1607188941.0}, {"subreddit": "democrats", "text": "If they are indicted and sentenced to jail time, yes.", "time": 1607188717.0}, {"subreddit": "democrats", "text": "We’d have more Trump supporters is what would happen...", "time": 1607187054.0}, {"subreddit": "politics", "text": "Please...his entire presidency has been a great human tragedy.", "time": 1607132827.0}, {"subreddit": "democrats", "text": "That explains so much... viva la reptard!", "time": 1607130925.0}, {"subreddit": "politics", "text": "Why is Trump trying to kiss an older tortoise?! No means no, fish fucker!", "time": 1607094220.0}, {"subreddit": "politics", "text": "They don’t want to be wrong and lose. Evidence be damned. Everyone knows that the only election fraud that has occurred has been at the hands of Trump & Co, but republicans think that if they can fight the system long enough, we will just give up and let them win. Little do they know the resolve of the Democratic Party.", "time": 1607094181.0}, {"subreddit": "politics", "text": "QAnon is fucking stupid...", "time": 1607038176.0}, {"subreddit": "politics", "text": "And no one thinks she’s nuts?!", "time": 1606940859.0}, {"subreddit": "politics", "text": "How the fuck did that walking tortoise with a nutsack on his neck get re-elected?!", "time": 1606940795.0}, {"subreddit": "politics", "text": "Because that plan doesn’t make the church more money. Duh...doesn’t get them into expensive resort hotels at a discount, either.", "time": 1606940693.0}, {"subreddit": "politics", "text": "Because Jesus had been doing such a great job at preventing COVID so far...", "time": 1606930582.0}, {"subreddit": "politics", "text": "Say it with me now, “he’s a crook. Duh...”", "time": 1606914592.0}, {"subreddit": "politics", "text": "I feel like you just described Trump directly... lol", "time": 1606688905.0}, {"subreddit": "politics", "text": "What disturbs me is you’re probably right. I can only hope Biden investigates the shit out of him, indicts him on felony charges, and renders him unable to run again.", "time": 1606604332.0}, {"subreddit": "politics", "text": "At what point do even his followers get tired of boundlessly supporting his failing ass?", "time": 1606603447.0}, {"subreddit": "politics", "text": "I hope they both get eaten by tigers. /shrug", "time": 1606603379.0}, {"subreddit": "politics", "text": "Yeah, impeach your governor for trying to save your lives, you dumb fucks.", "time": 1606440864.0}, {"subreddit": "politics", "text": "Per the Constitution of the United States, the president had the authority to GRANT pardons. One cannot grant ones own self something. The word indicates a gesture meant to be received by another party. Ergo, Pres Dipshit, who obviously has never read the constitution that granted him his position in the first place, CANNOT pardon himself.", "time": 1606440719.0}, {"subreddit": "democrats", "text": "Won, namely.", "time": 1606370293.0}, {"subreddit": "democrats", "text": "I’m gay, and I wouldn’t piss on him if he were on fire. Well...maybe if it made the orange shit run down his face like Giuliani...", "time": 1606369836.0}, {"subreddit": "politics", "text": "Is it just me, or does he look older every day since the election?", "time": 1606253066.0}, {"subreddit": "politics", "text": "That fits Trumps MO: promise a lot of work with “biggest results ever”, get what he wants started, realize it’s too much work, but won’t leave it alone like a dignified person.", "time": 1606159249.0}, {"subreddit": "politics", "text": "...or just be democratic. Lol", "time": 1606159124.0}, {"subreddit": "politics", "text": "What makes me laugh is every one of trumps dumbassed followers claim to be Christians, but none of them can see the anti-Christ right in front of them.", "time": 1606159065.0}, {"subreddit": "politics", "text": "Is this what the Bible meant about splitting the Red Sea? Lmao", "time": 1606158921.0}, {"subreddit": "democrats", "text": "You know one of those presents has a shotgun in it...", "time": 1606086727.0}, {"subreddit": "politics", "text": "When I swore my oath to join the military, I swore it to the country, to her citizens, and to protect her history. I would never pass that oath over to Trump. Get him out of OUR White House.", "time": 1605915587.0}, {"subreddit": "democrats", "text": "Because you’re awesome? Lol", "time": 1605832581.0}, {"subreddit": "politics", "text": "He knows he’ll never work again after this scandal, so he’s racking up as much per day as he can. We all know this will be done quick. Lol", "time": 1605731255.0}, {"subreddit": "democrats", "text": "This is the Democrat thread. Peddle your bullshit elsewhere. I was just posting something funny.", "time": 1605476353.0}, {"subreddit": "democrats", "text": "Yup. That’s how powerful Dominion is! :eyeroll:", "time": 1605450014.0}, {"subreddit": "democrats", "text": "Still funny...", "time": 1605449955.0}, {"subreddit": "democrats", "text": "Trump would just try to fire them \nfor not being in his club.", "time": 1605449916.0}, {"subreddit": "democrats", "text": "All they said was it was disputed. If they said it was a lie (it is) then I’d agree with you. All the disputed tag does is encourage people to look at proof for themselves.", "time": 1605449874.0}, {"subreddit": "democrats", "text": "I guess someone forgot to give the proof to literally ANY judges. Simple mistake that anyone could make. Go call Giuliani so he can start up a new lawsuit, wasting taxpayer money and tell him where the evidence is being hidden. I think he forgot.", "time": 1605449787.0}], "republican_score": 0, "democrat_score": 19}