{"name": "rhino910", "posts": [{"subreddit": "democrats", "text": "Top 10 things Trumpsters have said to me that I will enjoy saying to them\n", "time": 1607101909.0}, {"subreddit": "democrats", "text": "Remember this when you hear Trump supporters saying they will take up arms- 18 U.S.C. § 2384 - U.S. Code - Unannotated Title 18. Crimes and Criminal Procedure § 2384. Seditious conspiracy\n", "time": 1605885969.0}, {"subreddit": "democrats", "text": "What we (Americans) should be focused on moving forward\n", "time": 1605808548.0}, {"subreddit": "democrats", "text": "Facebook post by unstable anti-American nutjob Virginia Wesleyan dean is teaching our young men and women\n", "time": 1605454448.0}, {"subreddit": "politics", "text": "I don’t feel sorry for my Trump-voting neighbors\n", "time": 1605192789.0}, {"subreddit": "democrats", "text": "The only election fraud Trump's own international observing team witnessed was Trump himself\n", "time": 1605022334.0}, {"subreddit": "politics", "text": "Brad Parscale cried during arrest, told officers his wife won’t have sex with him\n", "time": 1602181724.0}, {"subreddit": "politics", "text": "Stock market news live updates: Stocks fall after Trump says he is 'rejecting' House Democrats' $2.4 trillion stimulus proposal\n", "time": 1602012298.0}, {"subreddit": "politics", "text": "Trump Somehow Not Likable Even After Being Coached by Chris Christie and Rudy Giuliani\n", "time": 1601495399.0}, {"subreddit": "politics", "text": "Analysis: Trump's fear dominated his first debate with Biden\n", "time": 1601477322.0}, {"subreddit": "politics", "text": "We mailed 100 letters to test the Postal Service. The verdict: Spotty at best, dismal at worst\n", "time": 1600189551.0}, {"subreddit": "politics", "text": "Bob Woodward reveals 'extraordinarily shocking' audio of Trump on 'The Late Show'\n", "time": 1600177935.0}, {"subreddit": "politics", "text": "Fox Is So Rattled By Trump Military Story That It Confirms, Debunks, Then Reconfirms It\n", "time": 1599314388.0}, {"subreddit": "democrats", "text": "A great perspective on Joe Biden\n", "time": 1593707965.0}, {"subreddit": "politics", "text": "Group including N.J. correctional officer mock peaceful protesters, reenact George Floyd Killing\n", "time": 1591786874.0}, {"subreddit": "politics", "text": "Re-contextualizing Tucker Carlson's monologue that fearmongered about protesters\n", "time": 1591559180.0}, {"subreddit": "politics", "text": "D.C. Police Charged Demonstrators With Wearing Masks Even Though Coronavirus Guidelines Require Them\n", "time": 1591137617.0}, {"subreddit": "politics", "text": "White Extremists Terrorize and Loot: 14 Videos of Destruction Black People Will Be Blamed For\n", "time": 1591039234.0}, {"subreddit": "politics", "text": "17-Year-Old Girl Who Recorded George Floyd's Killing Says 'I Don’t Know How To Feel'\n", "time": 1590841811.0}, {"subreddit": "politics", "text": "In the early days of the pandemic, the U.S. government turned down an offer to manufacture millions of N95 masks in America\n", "time": 1589043572.0}, {"subreddit": "democrats", "text": "Frankly, I think you overestimate the moral value of your extreme arrogance (which is also utterly uwarranted).  They are anti-American foaming at the mouth cultists immune to logic and reason.   They need to be defeated.   Their criminal cult leader was caught trying to stage a coup in Georgia.   People who still support him are traitors on par with Benedict Arnold", "time": 1607203292.0}, {"subreddit": "democrats", "text": "Please explain....   just give me a minute or two to get my popcorn, first", "time": 1607178329.0}, {"subreddit": "politics", "text": "> They were mistakenly told to leave at 10pm, as well as the media.\n\nYou made that false statement 3 hours ago well after it had been properly debunked by multiple sources.\n\n\nThat fact that you hate me, shows me that I am being a good patriotic American", "time": 1607112209.0}, {"subreddit": "politics", "text": "Usually that many white people only in one room is for a Klan meeting", "time": 1607112065.0}, {"subreddit": "politics", "text": "instead of slandering good patriotic Americans, you should make sure what you claim is the truth.  \n\nPS-  I am not buying your Trump move.   You are the VILLAIN not the VICTIM", "time": 1607104587.0}, {"subreddit": "politics", "text": "Yeah, I don't think everyone fully appreciates the toxic affect right-wing hate radio has had on rural America (where, as you say, the options are limited)", "time": 1607104497.0}, {"subreddit": "politics", "text": "nothing about the criminal's lawyer's claims are true\n\nhttps://leadstories.com/hoax-alert/2020/12/fact-check-video-from-ga-does-not-show-suitcases-filled-with-ballots-pulled-from-under-a-table-after-poll-workers-dismissed.html", "time": 1607099574.0}, {"subreddit": "politics", "text": "You are spreading treasonous Anti-American Republican lies\n\nhttps://leadstories.com/hoax-alert/2020/12/fact-check-video-from-ga-does-not-show-suitcases-filled-with-ballots-pulled-from-under-a-table-after-poll-workers-dismissed.html", "time": 1607099502.0}, {"subreddit": "politics", "text": "It's absolutely another treasonous lie from Giullani\n\nhttps://leadstories.com/hoax-alert/2020/12/fact-check-video-from-ga-does-not-show-suitcases-filled-with-ballots-pulled-from-under-a-table-after-poll-workers-dismissed.html", "time": 1607099393.0}, {"subreddit": "politics", "text": "It's simple, the people who support Trump hate America and Americans", "time": 1607093519.0}, {"subreddit": "politics", "text": "Right-wing hate radio, TV, and social media have all worked in concert to rot the minds and souls of so many Americans", "time": 1607092105.0}, {"subreddit": "politics", "text": "best politician money can buy", "time": 1607090042.0}, {"subreddit": "politics", "text": "It's a shame the treasonous immoral Republicans destroyed the courts by abusing their power to harm our nation", "time": 1607090017.0}, {"subreddit": "politics", "text": "I can't feel sorry for all the wild-eyed American hating traitors he conned out of their cash", "time": 1607089982.0}, {"subreddit": "politics", "text": "you didn't delete this treasonous anti-American thread.  So your intentions of trying to destroy America are crystal clear", "time": 1607089841.0}, {"subreddit": "politics", "text": "since when did \n\nbeing a foaming at the mouth wild-eyed anti-American traitor = common sense\n\nright-wing hate radio, TV, and internet has destroyed the minds and souls of millions of former Americans", "time": 1607089753.0}, {"subreddit": "politics", "text": "By design, Zuckerberg is just another anti-American treasonous Republican", "time": 1607089637.0}, {"subreddit": "politics", "text": "At this point Trump and his supporters are traitors on par with Benedict Arnold", "time": 1607089532.0}, {"subreddit": "politics", "text": ">Because more than half the states – including most of the key battlegrounds – don’t provide a grace period for ballots that arrive after Election Day, it is likely 25,000-50,000 ballots nationwide were ultimately rejected because of USPS problems.", "time": 1607008348.0}, {"subreddit": "politics", "text": "Ironically this was the only fraudulent part of the election where Trump tried to STEAL our nation's election from the American people", "time": 1607008272.0}, {"subreddit": "politics", "text": "In prison", "time": 1607004876.0}, {"subreddit": "politics", "text": "More proof of just how dishonest and anti-American Republicans are", "time": 1606942785.0}, {"subreddit": "politics", "text": "The GOP is proving to the biggest threat to our nation, rights, and liberties that we have ever faced.  We need to vote ALL Republicans out of office and ban right-wing hate radio that has brainwashed too much of our nation", "time": 1606941457.0}, {"subreddit": "politics", "text": "yeah change voters from voting Democratic to Republican", "time": 1606938370.0}, {"subreddit": "politics", "text": "Why does the words of a convicted traitor matter?", "time": 1606928288.0}, {"subreddit": "politics", "text": "The \"people\" in Kentucky that voted for Moscow Mitch betrayed their nation as badly as Benedict Arnold did", "time": 1606919298.0}, {"subreddit": "politics", "text": "The GOP is pro-Covid\n\nThey have given up all pretense of humanity", "time": 1606829810.0}, {"subreddit": "politics", "text": "Republicans have become the party of evil", "time": 1606829750.0}, {"subreddit": "politics", "text": "The irony being anyone who is a member of the anti-American Trump cult are the true traitors", "time": 1606757534.0}, {"subreddit": "politics", "text": "Villains claiming to be victims, the bedrock that today's GOP is built upon", "time": 1606750112.0}, {"subreddit": "politics", "text": "It's is frightening how woefully uninformed  and hating of America all the time you spent in the right-wing propaganda bubble has left you.   Having to deal with Republicans/right-wingers makes me appreciate how good Germans had to deal with  right-wing Nazis (who hated Communist).   You have so much hatred for America you are actively rooting for Americans to die of Covid\n\n\nWe hold these truths to be self evident that all men have the right to LIFE. liberty, and the pursuit of happiness", "time": 1606429424.0}, {"subreddit": "politics", "text": "You clearly love killing Americans with Covid, so it stands to reason you love the radical Constitution judges killing Americans.   \n\nPublic health has trumped all, for hundreds of years until the nazi right wingers took over our nation", "time": 1606427102.0}, {"subreddit": "politics", "text": "The Evil Republican Supreme Court abused its power and ordered the deaths of thousands of Americans!", "time": 1606395896.0}, {"subreddit": "politics", "text": "But Trump and Moscow Mitch have packed our Supreme Court with evil radical judges who are already destroying the nation abusing their power.    They ordered the deaths of thousands of Americans last night", "time": 1606394118.0}, {"subreddit": "politics", "text": "This is why the evil Republicans packed the court with radical Constitution hating judges.  They wanted to destroy our nation and killing people with Covid is just the start", "time": 1606393960.0}, {"subreddit": "politics", "text": "If you claim to know better, why are you repeating Republican lies as fact?????", "time": 1606393786.0}, {"subreddit": "politics", "text": "Stacking the courts with radical American hating judges is not his \"job\", not even remotely", "time": 1606308779.0}, {"subreddit": "politics", "text": "I guess he got his burn notice", "time": 1606245099.0}, {"subreddit": "politics", "text": "Touché", "time": 1606242177.0}, {"subreddit": "politics", "text": "fucking ghoul, we need to defeat this monster in Georgia", "time": 1606237250.0}, {"subreddit": "politics", "text": "You know you are a failure when you think Randy Quaid is an expert on elections and election law", "time": 1606231916.0}, {"subreddit": "politics", "text": "Have them explain why we started a revolution over taxation without representation", "time": 1606231140.0}, {"subreddit": "politics", "text": "and their utter contempt for America's democracy and the American people", "time": 1606161432.0}, {"subreddit": "politics", "text": "Oh Putin, why so salty?   How long did you really expect the American people to tolerate your pathetic puppet destroying our nation?", "time": 1606159853.0}, {"subreddit": "politics", "text": "Like anything the GOP names, they mean the opposite", "time": 1606159184.0}, {"subreddit": "politics", "text": "Republicans hate African Americans and it clearly angers them when they have the \"nerve\" to vote.  That is why they want to steal our election", "time": 1606159121.0}, {"subreddit": "politics", "text": "More proof of that we can't trust Republicans with our democracy or our nation.  They are dishonest anti-American weasels at heart", "time": 1606158491.0}, {"subreddit": "politics", "text": "There are only 14 elections that were decided by a bigger margin than what Biden's 7 million votes", "time": 1606156814.0}, {"subreddit": "politics", "text": "No, religion really didn't play a role in any of it", "time": 1606156641.0}, {"subreddit": "politics", "text": "Ironically the revolution was fought over taxation without representation.  Now the Republicans are fighting to bring that back", "time": 1606156446.0}, {"subreddit": "politics", "text": "> If 23.000 voters in 3 states voted Trump instead of Biden, Trump would've won\n\nDoes not match\n\n>That's a total of 43,692 more votes that Biden has over Trump", "time": 1606155576.0}, {"subreddit": "politics", "text": "your post history amply demonstrates your open disdain for facts, critical thinking, and Americans.  You are in no position to lecture anyone", "time": 1606154991.0}, {"subreddit": "politics", "text": "7 million more votes is OVERWHELMING, not matter how you try to spin it", "time": 1606154614.0}, {"subreddit": "politics", "text": "Why is this even news?   All claims spread by conservatives are  always proven false.", "time": 1606154568.0}, {"subreddit": "politics", "text": "> Trump would have beat Biden had only 45K votes been flipped across three states\n\nA) they tie, not \"Trump wins\"\n\nB)  If a cow had horns it would be a bull", "time": 1606153320.0}, {"subreddit": "politics", "text": "> If 23.000 voters in 3 states voted Trump instead of Biden, Trump would've won.\n\nthat simply isn't true", "time": 1606153257.0}, {"subreddit": "politics", "text": "living up to your creed I see:\n\n>A_Dumb_Mech_Engineer\n \n>[-1] 3 points 6 days ago* \n\n>I resort to personal attacks to when I realize I literally can't back up anything I'm saying. It makes me look very smart to all my pseudo intellectual friends.", "time": 1606153207.0}, {"subreddit": "politics", "text": "More like 7 million votes\n\nNow doubt the system has been rigged against the American people but Trump was so despised that advantage failed to save him", "time": 1606149173.0}, {"subreddit": "politics", "text": "Trump and his allies are criminally violating the voting rights act.  They should end up in jail as prescribed by law", "time": 1606148035.0}, {"subreddit": "politics", "text": ">All this was inspired by the principle—which is quite true within itself—that in the big lie there is always a certain force of credibility; because the broad masses of a nation are always more easily corrupted in the deeper strata of their emotional nature than consciously or voluntarily; and thus in the primitive simplicity of their minds they more readily fall victims to the big lie than the small lie, since they themselves often tell small lies in little matters but would be ashamed to resort to large-scale falsehoods.\n\n>It would never come into their heads to fabricate colossal untruths, and they would not believe that others could have the impudence to distort the truth so infamously. Even though the facts which prove this to be so may be brought clearly to their minds, they will still doubt and waver and will continue to think that there may be some other explanation. For the grossly impudent lie always leaves traces behind it, even after it has been nailed down, a fact which is known to all expert liars in this world and to all who conspire together in the art of lying.\n\n>— Adolf Hitler, Mein Kampf, vol. I, ch. X", "time": 1606145593.0}, {"subreddit": "politics", "text": "The Republicans have been robbing people of their right to vote for decades, it wasn't a big stretch to just ignore the vote", "time": 1606145420.0}, {"subreddit": "politics", "text": ">  It’s just delusional to say Biden won overwhelmingly\n\nWow!   you are proof that so many people in America are utterly lacking in self-awareness.   Biden won by 7 million votes and  you are so detached from reality that you claim that isn't overwhelming.  I urge you to stop calling reality \"delusional\" , it's not healthy for you", "time": 1606142780.0}, {"subreddit": "politics", "text": "The anti-American criminals must be held accountable for their crimes!", "time": 1606142417.0}], "republican_score": 0, "democrat_score": 8}