{"name": "bobsaget4765", "posts": [{"subreddit": "democrats", "text": "Clearly I didn’t read. I was looking to rant. Sorry", "time": 1607100621.0}, {"subreddit": "democrats", "text": "Seems to be on both sides. But on this topic the republicans are absolutely overreacting and being stupid. I promise no one cares if you tell then merry Christmas. If some tells me or a another normal person happy Hanukkah I want break my brain and get bothered.", "time": 1607097077.0}, {"subreddit": "democrats", "text": "In Atlanta everyone says merry Christmas of all ethnicities and even religious backgrounds. I live in the most diverse area in the city. The right try’s to over blow this. Just cuz some Instagram activist girl that might be their niece posted something about no more saying merry Christmas they think this is actually going on. These idiots don’t leave their little towns to find out for themselves.\n\n\nWho in their right mind gets offended by merry Christmas? I love Christmas not religious at all. Santa and Christmas movies are dope. Giving is good \n\nWho in their right mind gets offended by happy holidays.. why would that offended you?", "time": 1607096012.0}, {"subreddit": "democrats", "text": "Exactly they think they care about being justice or morals but they only care about their feelings and emotions not ppl, I don’t care what they tell themselves they really don’t. No different than the racists hateful white ppl. See republicans don’t care about ppl but they also don’t pretend to unless they are super religious.. lol both are the same kind of people, but yet they hate each other.", "time": 1607095407.0}, {"subreddit": "democrats", "text": "I hate when ppl tell ppl to do things than go out and do the opposite in their own lives. I held trump accountable for being a jackass/dumbass idiot. But if a D is next to your name doesn’t mean your “moral” or a “good person” so we should hold the democrats accountable god knows Pelosi needs to be held accountable. Virgin Mary wasn’t a virgin and most Democrats don’t care about people they care about how they feel.", "time": 1607095135.0}], "republican_score": 0, "democrat_score": 5}