{"name": "jonfla", "posts": [{"subreddit": "democrats", "text": "The GOP Is the Party of Civil War\n", "time": 1607178347.0}, {"subreddit": "democrats", "text": "Georgia Senate poll suggests Trump’s “voter fraud” lies are hurting the GOP\n", "time": 1607097097.0}, {"subreddit": "politics", "text": "Trump Pentagon Nominee Boosted Calls For Martial Law This Week\n", "time": 1607094476.0}, {"subreddit": "democrats", "text": "Iowa Is What Happens When Government Does Nothing About the Pandemic\n", "time": 1607007338.0}, {"subreddit": "politics", "text": "Trump Doubles Down On Attacks That Have Inspired Death Threats Against GOP Officials In GA\n", "time": 1606918784.0}, {"subreddit": "democrats", "text": "PA GOP State Senator Supporting Election Challenge Leaves Meeting With Trump After Testing Positive For COVID-19\n", "time": 1606754090.0}, {"subreddit": "politics", "text": "Democrat Mark Kelly Will Be Sworn Into The Senate On Wednesday\n", "time": 1606753953.0}, {"subreddit": "politics", "text": "Progressives Can’t Repeat the Mistakes of 2008\n", "time": 1606679224.0}, {"subreddit": "democrats", "text": "Trump Pardoned Flynn to Save Himself\n", "time": 1606494717.0}, {"subreddit": "democrats", "text": "Trump Complains On Speakerphone To PA GOP That No One Will ‘Overturn’ Election For Him\n", "time": 1606342153.0}, {"subreddit": "politics", "text": "Gaetz Urges Trump To Go Wild With Pardons, Including A Self-Pardon, To Own The Libs\n", "time": 1606314196.0}, {"subreddit": "democrats", "text": "How Trump’s conspiracy theories have led some Republicans to call for a Georgia Senate runoff boycott\n", "time": 1606314039.0}, {"subreddit": "politics", "text": "What Donald Trump and Dick Cheney Got Wrong About America\n", "time": 1606160902.0}, {"subreddit": "democrats", "text": "Trump Lawyer Tries To Toss Out His Own Vote In Wisconsin Recount\n", "time": 1606160759.0}, {"subreddit": "democrats", "text": "The Growing Republican Chorus: Murkowski Says It's 'Time’ To Begin Biden Transition, Blasts Trump For Election Attacks\n", "time": 1606140024.0}, {"subreddit": "politics", "text": "Rick Scott Becomes The 6th Member Of Congress To Test Positive This Week\n", "time": 1605893001.0}, {"subreddit": "democrats", "text": "‘We Can Wait No Longer’: House Dems Demand Briefing On Trump Appointee’s Refusal To Begin Transition\n", "time": 1605883871.0}, {"subreddit": "democrats", "text": "GOP Election Officials in Michigan Now Want to “Rescind” Their Votes to Certify Detroit-Area Results After Collective Republican Establishment Is Hating On Them\n", "time": 1605794651.0}, {"subreddit": "democrats", "text": "Lindsay Graham is not going to resign. There are no 'shoulds' or 'norms' when it comes to Republican politics, there is only the raw exercise of power. Democrats need to wield it more forcefully.\n", "time": 1605712515.0}, {"subreddit": "politics", "text": "Local Officials Are the Heroes of the 2020 Election\n", "time": 1605712343.0}, {"subreddit": "democrats", "text": "Jaime Harrison tweets that DoJ investigation and possible South Carolina senate recount is justified by Lindsay Graham attempt to subvert election results in Georgia\n", "time": 1605624590.0}, {"subreddit": "democrats", "text": "Trump’s Top COVID Adviser Denies Trying To Incite Violence Against MI Guv. With ‘Rise Up’ Tweet\n", "time": 1605537881.0}, {"subreddit": "politics", "text": "Trump Admits Biden Won Election but Quickly Takes It Back\n", "time": 1605460686.0}, {"subreddit": "politics", "text": "Sounds good, thanks", "time": 1601663423.0}, {"subreddit": "democrats", "text": "No one thought Trump would win either. Loomer's going to have the full panoply of Republican hate mongers including Roger Stone (who lives nearby) and Alex Jones, who's already signed on. Given that Trump is voting (however illegally) from Mar A Lago, this promises to be a big money/media attention race.", "time": 1597866122.0}, {"subreddit": "politics", "text": "I would really like your advice on this. At the time I posted the article, the headline was as I posted it. It appears to have been changed later by Vox. I understand that you have a program that you say tracks this, but I would like to know if you can look back to see the header I posted on their site earlier. I am trying to be scrupulous about this, but as you no doubt know, headlines change sometimes several times daily so I'm not sure what to do: take a screen shot at the time of posting and send it to you? Thanks - Jon", "time": 1595863843.0}], "republican_score": 0, "democrat_score": 15}