{"name": "PhiloPhocion", "posts": [{"subreddit": "democrats", "text": "The highest profile surrogate trips are usually most effective during GOTV (which sure mail in voting makes all the time GOTV but surrounding the highest participation dates). That's especially so since the GOP strategy is to run this the way they always have lately - Southern and Midwestern states actually respond best to for Democrats is localisation - i.e. SC issues for SC, Joe Cunningham for Lowcountry, (I know she lost but with her gains) Theresa Greenfield who knows Iowa farmers and crop prices etc. What the GOP wants more than anything is to try to nationalize it - which they did successfully for both races. They tried to erase Joe Cunningham and Greenfield and tried to make it race against AOC and Pelosi and the DNC instead. Biden coming in too early feeds that narrative and distracts from what Warnock and Ossoff are presenting. And the biggest drive of a high profile name like Biden coming in is enthusiasm - which is where GOTV it becomes worth it but before then, most of the people who would see that rally already know to vote day 1 of mail in voting anyway. \n\nAlso, truth be told, high-profile surrogate trips are a trade-off. They can draw a lot of attention but, especially with someone like the President-elect in a state with a lot going on right now, it takes an enormous amount of time and money - dozens and dozens of staff that could be working on a lot of voter contact or building the supports for voter contact or even 10 other big surrogates in that time, will be pulled to work on a visit like that, plus a bunch of resources. \n\nAnd in impact, a lot of that will be limited by the fact that we're still in a place doing drive in rallies with, at best, a couple hundred people, not the thousands that they would normally have.", "time": 1607078558.0}, {"subreddit": "democrats", "text": "Especially some places I see it. \n\nLook I get that some places feel they need guns for safety but sir, this is a Whole Foods in Palm Beach. What do you think is going to happen here?", "time": 1606285847.0}, {"subreddit": "democrats", "text": "Wait is the concept of the hashtag to write in trump for the GA Senate runoffs?", "time": 1606246113.0}, {"subreddit": "democrats", "text": "Not to mention, there have actually been some pretty severe outbreaks in Amish communities.\n\nBut I do know some communities have managed to basically build a bubble of their entire community", "time": 1605655694.0}, {"subreddit": "democrats", "text": "It’s a pretty interesting space for the argument and a lot of avenues pro NPVIC folks could take (though they have to make one). \n\nOne I didn’t think about before reading this wiki was whether or not this meets the requirement of the US having an interest re: precedent in the shift in leveraging state agreements for more power in the vertical - when arguably states are ceding power in joining.\n\nAlso that even with this it could conceivably pass without an amendment but with the NPVIC and congressional approval (but not state legislatures).", "time": 1605632734.0}, {"subreddit": "democrats", "text": "Even the GOP has been there. \n\nAfter the 2012 election, their post mortem concluded that they needed to concede on some social issues including LGBTQ rights, immigration, and abortion because the country was moving forward on them. \n\nInstead they got someone who went even more extremist on all of those issues and won.", "time": 1605632505.0}, {"subreddit": "democrats", "text": "I will never not be awe-struck that she still taught as Second Lady - even moreso that I somehow didn't know that while Biden was still VP.", "time": 1605540561.0}, {"subreddit": "democrats", "text": "Contextually, those 15 and DC bring the compact to 196 Electoral College votes.\n\nThere are a few pending though uphill and frankly unlikely attempts currently open in their state legislatures (Texas, Ohio, Pennsylvania, Virginia, and South Carolina).\n\nAlso of note, the NV legislature has passed a bill to join the NPVIC through both chambers was but vetoed by the governor last year. So it could potentially come back.\n\nAlso of note, like this person mentioned, these are all blue states that have passed it but the NY Legislature was actually Republican controlled when it passed (in effect). And OK and Arizona both passed it through one Republican controlled chamber (though also before 2016). And Georgia and Missouri both passed it through Republican controlled committees.\n\nThat also being said, some of the states that have passed it already are projected to lose some seats after this reapportionment, which may change the number of remaining votes needed.", "time": 1605472530.0}, {"subreddit": "democrats", "text": "Sorry I’m going to disagree. If you want to disagree on tax policy or something, that’s a disagreement on a political opinion. \n\nSupporting an agenda that promises to infringe on the rights and safety of others isn’t a political opinion difference - it’s a moral difference. \n\nNot saying people should go unfriending everyone who is on the other side since I do think that just leads to the alt right info bubbles we have now. And we need to be willing to break that bubble. But these issues aren’t a game but are very real life for a lot of people.", "time": 1605465158.0}, {"subreddit": "democrats", "text": "For what it’s worth - if you’re a NPA (no party affiliation) they may have made the calculus that you may also be worth reaching out to. \n\nThey can’t know if you voted for a Republican or not but they can tell IF you voted in past elections. Usually when campaigns target voters, their primary people to turnout are (in this example), strong Republicans that vote inconsistently and consistent voters who MIGHT be Republican votes. The other two axes (reliable Republican votes and potential Dem votes) aren’t worth their effort because those will likely roll the way they will. \n\nAnd since they can’t see WHO you voted for, just if you voted, they likely did the back math on demographics (how others vote in your area or even neighborhood, your income, your age, your race, your education level, etc if they can find it to map back) and then make an educated guess on people they think might be Republican votes. Some areas they did the same calculus even to target people who are registered Dems but based on results from recent elections, they can presume some have turned for the GOP.", "time": 1605397657.0}, {"subreddit": "politics", "text": "The military votes were overwhelmingly for Biden. I was told they’d be voting for trump. Thus fraud.", "time": 1605286512.0}], "republican_score": 0, "democrat_score": 10}