{"name": "Imnewhere948", "posts": [{"subreddit": "democrats", "text": "\"The President’s team is intentionally misleading the public about what happened at State Farm Arena on election night. \"\n", "time": 1607122753.0}, {"subreddit": "democrats", "text": "Trump is Mentally Unfit to be in Office Right Now - Delusional, Crazy. He Needs to be Removed ASAP.\n", "time": 1605503480.0}, {"subreddit": "democrats", "text": "Can someone explain to me why Kayleigh McEnany implies every voter fraud allegation is caused by a Democrat?\n", "time": 1605166261.0}, {"subreddit": "democrats", "text": "Sidney Powell: People with links to powerful Democrats using Dominion voting machines to 'steal' votes\n", "time": 1604869483.0}, {"subreddit": "politics", "text": "Trump's anti-lockdown coronavirus adviser, Dr. Scott Atlas, says the president's COVID-19 diagnosis will not change how the White House tackles the pandemic\n", "time": 1602349520.0}, {"subreddit": "politics", "text": "Trump says he will leave hospital, tweets 'Don't be afraid of Covid'\n", "time": 1601924012.0}, {"subreddit": "politics", "text": "Trump Proclaims on Twitter: \"Don’t be afraid of Covid. Don’t let it dominate your life\"\n", "time": 1601923721.0}, {"subreddit": "democrats", "text": "There is a lot of info online if you Google it but basically there was surveillance video released of poll workers counting ballots, thats it. \n\nOnly the Republicans \"claimed\" that they were taking out secret suitcases filled with ballots (totally debunked since then, these were ballot boxes accessed per regular procedure), that all poll watchers were kicked out (again, debunked, as some people voluntarily left because it was late), etc. Basically the Republicans alleged this was voter fraud just because someone made up that these hard working people were cheating after hours and scanning fake ballots...\n\nThese are the facts, however:\nhttps://www.washingtonpost.com/national/surveillance-tape-breeds-false-fraud-claims-in-georgia/2020/12/04/8e203752-3686-11eb-9699-00d311f13d2d_story.html", "time": 1607137399.0}, {"subreddit": "democrats", "text": "I know, right?\n\nTake a look at /r/DonaldTrump or /r/Conservative or /r/Republican\n\nThey are having a field day over this story, claiming that **no matter what** its true. Any fact checks are false. This story 100% presents voter fraud to them and nothing will change their minds. That's their latest thing - refusing \"fact checks\" and actual investigations and evidence as \"lies\".\n\nMy blood was boiling reading their comments, simply because they are based on conspiracy theories and not fact. This spread of disinformation needs to stop. They are attacking people online and ruining (innocent) people's lives over this.", "time": 1607124573.0}, {"subreddit": "democrats", "text": "[https://twitter.com/GabrielSterling/status/1334825233610633217](https://twitter.com/GabrielSterling/status/1334825233610633217)", "time": 1607122829.0}], "republican_score": 0, "democrat_score": 7}