{"name": "ScabusaurusRex", "posts": [{"subreddit": "democrats", "text": "Decision Desk HQ projects that @JoeBiden has won Pennsylvania and its 20 electoral college votes for a total of 273.\n", "time": 1604671257.0}, {"subreddit": "democrats", "text": "I don't see any Russian flags on those jackets... Must be an oversight.", "time": 1607191029.0}, {"subreddit": "democrats", "text": "Yep and, although best news of the year if it were true, one should be careful not to spread baseless information around. If it does not have a source, you are no different from Qanon wackos.", "time": 1606100998.0}, {"subreddit": "democrats", "text": "I have high hopes for Letitia James. AG gon' get em.", "time": 1605849316.0}, {"subreddit": "democrats", "text": "The death cult is melting before our very eyes. We just need to be sure to melt it into slag and bury it deep in the earth, like all hazardous waste.", "time": 1605848705.0}, {"subreddit": "democrats", "text": "The icon at the bottom needs to be a little snowflake.", "time": 1605811206.0}, {"subreddit": "democrats", "text": "\"You're fired. Bing, get out.\"", "time": 1605753745.0}, {"subreddit": "democrats", "text": "I think it was a sarcastic comment.", "time": 1605103071.0}, {"subreddit": "democrats", "text": "It's something I'm trying to work on: don't attack people, but attack a bad idea / act.  Don't insult it; break it down.", "time": 1604939589.0}, {"subreddit": "democrats", "text": "If you are trying to educate someone, and you've surrounded the message with something that will make the audience tune out, you've failed.  You will not be able to educate them, they will not listen to you ever again, and you will have alienated them.\n\nThis is probably *the* message that Democrats need to hear, and the other comments here show why we have failed.\n\nTotal side note:  I am not dyslexic, but I had a fuckin hell of a time reading the font this was in.  I know there's a dyslexic font out there that helps people read, but ... is it possible that there is a make-you-dyslexic font, and whatever this one is *is it*?!\n\nEdit: [https://riverratdemocrats.com](https://riverratdemocrats.com)", "time": 1604937518.0}, {"subreddit": "democrats", "text": "It was established to\n\n* Give slave-holding states and advantage, per capita, against non slave-holding, because slaves didn't \"count\" as population.\n\n* Ensure that the mindless rabble of the populace wouldn't elect a populist imbecile. Since they couldn't be trusted with directly voting, electors would do the voting in their staff and correct for any populist mistakes.\n\nIt is a 200+ year old artifact of different times.", "time": 1604498390.0}, {"subreddit": "democrats", "text": "You have a fundamental misunderstanding here. Police are allowed to respond to a situation with deadly force if a person will likely cause deadly harm to the officer or another person. Resisting arrest is not an offense that carries the death sentence to be carried out immediately by police officers.\n\nUnless you're black. Which is, of course, the problem.", "time": 1604267944.0}], "republican_score": 0, "democrat_score": 12}