{"name": "OrangeUTraitor", "posts": [{"subreddit": "democrats", "text": "Remember how they said The South will rise again, it's like that, but in the rural parts of every state.", "time": 1607196494.0}, {"subreddit": "politics", "text": "ONLY 5 is what it should say.", "time": 1607192994.0}, {"subreddit": "politics", "text": "I didn't expect that based on his persona.", "time": 1607192965.0}, {"subreddit": "politics", "text": "It doesn't really make sense to assume everyone is an average of everyone else. The only way you know what this is that person or group will do is to give them a chane and see.", "time": 1607132858.0}, {"subreddit": "politics", "text": "I wonder what percent of people came to this thread to say this.", "time": 1607117536.0}, {"subreddit": "politics", "text": "That would mean the Women's March participants rule America because they got the most bodies in the streets. I don't think it's quite that simple.", "time": 1607099171.0}, {"subreddit": "politics", "text": "I'm pretty sure it's a dimensional phase anchor to keep Biden anchored to our reality. That's how he beat Trump at his own 4D dimensional chess game. It's the only thing that makes sense. IT WAS RIGGED ...in the fourth dimension!¡\n.\n.\n.", "time": 1607090679.0}, {"subreddit": "politics", "text": "Well more often than not that means you're getting close to something versus them just casually blowing you off.", "time": 1607090171.0}, {"subreddit": "democrats", "text": "It just makes more sense for the agencies to be separate. They can still do better at sharing information than they did in the past, but they should be compartmentalized.", "time": 1607088857.0}, {"subreddit": "politics", "text": "If Wallstreet would act like any of this was actually happening it would help a lot. They've been in near total denial the entire time just trying to make as much money as they can with no plan beyond that.", "time": 1607063339.0}, {"subreddit": "politics", "text": "They still can't even stop torrents and bots and they think they have any real capacity to stop people calling them names on the internet? That's just stupid to even think it could work.", "time": 1607062128.0}, {"subreddit": "politics", "text": "Trump would be nothing if the GOP and Fox did not empower him or fail to put him in his place.", "time": 1607061993.0}, {"subreddit": "politics", "text": "I think most people will be focused on pandemic recovery and then economic recovery and a bunch of rocking the boat will not be that popular, especially since it will hurt economic recovery and get Americans and European citizens nothing in return. \n\nI would just apply slow and steady pressure on China to shutdown it's forced labor and not make a big global showdown deal out of if. The more demanding we are in public the more reasons we give China to resist an otherwise pretty simple request. Their forced labor is not that valuable compared to their trade relationships with Europe and America, not even close. SO it's kind of a common sense thing that they stop, even just the damage to their own brands is not worth the cheap labor. Especially as automation becomes more and more of an option. \n\nChina could impress the world with automation OR they could look like a desperate authoritarian nation clinging to forced labor as investors flee. Either way a very public global showdown is probably a really dumb idea.", "time": 1607061601.0}, {"subreddit": "politics", "text": "Wealth consolidation and radicalized media are having a Trump effect all over the world and yeah clearly that's a FAR bigger threat to America than anything China is doing.", "time": 1607061359.0}, {"subreddit": "politics", "text": "Nah, wealth and media consolidation is far worse than China because it's everywhere. Dude, not even close to seeing the big threat on that one. China is small potatoes compared to billionaires pulling our strings. China will hit a wall of climate change, automation and that huge population will be nothing but a huge expense and liability. They are doing ok now, but they have a lot more long term challenges than America or Europe... other than potentially having our democracies overthrown by radical media and billionaires.\n\nChina is an easy target for the world to fixate on compared to the much bigger threats of growing radicalization and wealth consolidation. It's like one real big problem vs a million medium sized problems and that means China is much easier to deal with than our growing internal threats.\n\nAnybody with common sense can just look around their country and see China is not their biggest problem. I mean, except maybe Hong Kong and a few other nations, but MOST democracies big problems are their own internal corruption and that always links back to money and those who have way too much of it.", "time": 1607061121.0}, {"subreddit": "politics", "text": "\\-20% trade negotiation penalty for leaving EU!", "time": 1607054254.0}, {"subreddit": "politics", "text": "Yeah, that's another example of how Democrats taking the high road doesn't work worth a crap. Republicans would be EASY targets for third party nutjob ghost candidates, but actually getting Democrat to play hardball EVEN when it's 100% legal is like pulling teeth from a hungry shark in the middle of the ocean.", "time": 1607050524.0}, {"subreddit": "politics", "text": "Also, heart disease!", "time": 1607048985.0}, {"subreddit": "politics", "text": "Because the systems of supposed checks and balances is a bunch of crap AND 74 million jackasses just voted for that traitor.", "time": 1607042926.0}, {"subreddit": "politics", "text": "You think they all made the same quote? That's a dumb theory, they obviously didn't all say the same exact thing. The founding fathers are not one person sharing many names. They weren't all close buddies with the same ideas.\n\nThey formed opposing political parties and that's a vastly more real and defining fact than that one time one of the said something about entrenched parties.\n\nThe founding fathers were just people, flawed like anyone, prone to hypocrisy like anyone. Don't be so naive to not realize they made plenty of mistakes and went back on their own words at times.\n\nHere is more history for you to sadly deny.\n\n>Virtually all the leading political figures of the new country, starting with Washington, believed that political parties would polarize citizens and paralyze government. Hamilton and Jefferson agreed with this notion, but by 1793 the two groups that they represented had broken off into separate factions. Hamilton's group became the Federalists, while Jefferson's faction adopted the name \"Democratic Republicans.\"\n\nDoes this sound like a familiar division?\n\n>On economic matters, the Jeffersonians differed strongly with the Federalists. The Democratic-Republicans believed in protecting the interests of the working classes—merchants, farmers, and laborers. They believed that an agrarian economy would best serve these citizens. They saw the establishment of a national BANK OF THE UNITED STATES (which Hamilton strongly favored) as a means of usurping power that belonged to individual states, and they also believed that it would be tied too closely to the rich. The Federalists saw industry and manufacturing as the best means of domestic growth and economic self-sufficiency. They favored the existence of protective tariffs on imports (which had Congress had adopted in 1789) both as a means of protecting domestic production and as a source of revenue.\n\nYou should read up and get a more realistic view of the Founding Fathers and their oppositions to each others ideas as well as the history of political parties, because the history does not follow your idealistic quote.\n\nIt's a nice quote, but the reality of their actions tell a different story where political parties and political division cannot be avoided. Divisions were already significant by just 1793 and. The Constitution was ratified in 1789. It took 4 whole years to form parties and divisions.\n\n[https://law.jrank.org/pages/6058/Democratic-Republican-Party.html#:\\~:text=The%20Federalists%20believed%20that%20American,strengthen%20ties%20with%20the%20French.&text=The%20Democratic%2DRepublicans%20believed%20in,merchants%2C%20farmers%2C%20and%20laborers](https://law.jrank.org/pages/6058/Democratic-Republican-Party.html#:~:text=The%20Federalists%20believed%20that%20American,strengthen%20ties%20with%20the%20French.&text=The%20Democratic%2DRepublicans%20believed%20in,merchants%2C%20farmers%2C%20and%20laborers).\n\nYou can keep arguing BUT that's not what they said, but it's a weak ass argument compared to actually looking at the history of their actions on a timeline. I provided real facts that show the scenario play out, you provided like one line from history. \n\nGo ahead and prove your point with links and explain why it's ok that after they supposedly outlined these dangers that they went ahead and embraced them anyway in just a few years. \n\nWe can all give human ideal advice, like get more educated, be persistent with your goals,  do unto other as you would have them do unto you, but these are not real means of governing or rules that make governments work.\n\nThe rules of government have to work with human behavior, not go against it to a degree that is not practical. SOoo their advice was kind of dumb considering it was so very much against long standing human behavior.\n\nIt's like me telling people to just get along or something, it sounds nice, but it means very little.", "time": 1607031222.0}, {"subreddit": "politics", "text": "Clearly the big problem is not the one guy who is President, but the other 535 people in congress. Even Trump would be easier to convince to act on climate change than a majority of Congress, no less a Senate super majority. \n\nThat's not to say everyone in congress is worse than Trump, just that lumping that many people together guarantees there will be endless disagreements. It's just the nature of human behavior and math.", "time": 1607028288.0}, {"subreddit": "politics", "text": "Major companies need to find ways to elect more Democrats OR bribe more Republicans if that's what they really want. Is it what they want or is it what they say they want? A lot of people SAY they want action, but do very little themselves to make that happen, thinking it's all the job of someone else.\n\nBiden will be a public official. Major companies can do almost anything they want and in many ways the have the flexibility to act now while Biden can only do what can be done via the Executive Branch. \n\nWhat REALLY needs to be done requires major funding and regulates from congress and all the desire in the world to act does not necessarily have any impact on Congress.", "time": 1607028105.0}, {"subreddit": "politics", "text": "Well, the Republican will pass more stimulus IF the dow starts dropping or unemployment shoots up, but many of them will say. meh the economy is good enough market forced can do the rest and.. well they will over time and things will be corrected. It's just a question of how much time and how many people's lives are ruined while the markets correct. \n\nFood lines are scary, but unemployment is amazingly high and the markets are not doing bad, Republicans only have mild pressure to pass relief right this second, especially with their guy on the way out of the White House, but really either way because that's the kind of people they are.\n\nThey want the acorns to fall where they will, not gather them up and help them along. Hundreds of thousands dead and millions bankrupt.. that's just gods way.", "time": 1607026352.0}, {"subreddit": "politics", "text": "THAT WAS THEIR PLAN.. they knew Mitch would block it... derp derp derp MOON LANDING!", "time": 1607026122.0}, {"subreddit": "politics", "text": "Which is just a false as it is 99% of the times humans jump to the same predictable conclusion among so many different topics and millenial. It's amazing how the simple childish logic plays out for all human history.\n\nHave you ever considering how statistically unlikely it is that both sides are the same? All those people on both sides essentially just so happen to wind up having all the same motivations? I don't see how you can possible think that's a likely outcome.\n\nIt would be kind of like having two sports teams so equally the same that EVERY game they played was a draw. It's just no possible unless they are all corpses or robots.", "time": 1607026099.0}, {"subreddit": "politics", "text": "You have been misinformed. Most founding fathers did embrace political parties regardless of a couple supposed quotes here and there. Sorry to burst your bubble.\n\n>Along with Thomas Jefferson, Madison organized the Democratic-Republican Party, which was, alongside Hamilton's Federalist Party, one of the nation's first major political parties. After Jefferson won the 1800 presidential election, Madison served as Secretary of State from 1801 to 1809.\n\n>The **Democratic-Republican Party**, better known at the time under various other names, was an American political party founded by Thomas Jefferson and **James Madison** in the early 1790s that championed republicanism, political equality, and expansionism.\n\nI suggest you read the history of political parties in America, it's kind of interesting how the flip flop and changed over the years. Sometimes there was just one party too, which might be the most obvious solution to the problem... we all just join one party and the other side can't stop us. Now you have true shared primaries.", "time": 1607025860.0}, {"subreddit": "politics", "text": "History says otherwise. Dems were the majority party from 1930 to 1980, the country did get a lot done. Republicans have been the majority party since the 80s and the country went deep into public debt, consolidated the hell out of media, allowed healthcare to skyrocket in cost and held wages down. \n\nIf you really bother to learn the history of the country over the last two major political cycles from 1930 to 1980 and 1980 to now, you're have a MUCH better understanding what works and what doesn't. \n\nIn reality every 40 years one party tends to be entrenched over the other, most people just have no idea because they just look at Presidents and make general assumptions. BUT you can look up who controls congress and the senate and by how many seats and actually get a better understanding of which party has held majority power.", "time": 1607025565.0}, {"subreddit": "politics", "text": "You really need to educate yourself better. The parties are completely different and have been for decades. Go learn your nations history for once in your life or just give up on pretending you care about any of this.\n\nYou can't care and also refuse to educate yourself on the topic. It's ONE or the OTHER and you clearly don't know what you're talking about.", "time": 1607024935.0}, {"subreddit": "politics", "text": "Yeah, unemployment insurance is easily the most accurately targeted relief in there. \n\nPeople who don't understand that also tend to think that like 50% of the economy is shutdown and their a HUGE amounts of people not working.\n\nThat's just not the case. Unemployment peaked at 14% and went right down to 7%. Even at the peak of the first outbreaks while we were stilling coming up with basic plans over 85% of the workforce was working and has been working the entire time.\n\nEssential businesses make up the VAST majority of businesses and jobs. Most people don't seem to understand that. They see some shops shut down and think the entire nation has shutdown... and then they go shopping at Walmart and Home Depot bitching about having to wear masks.\n\nWe live in a national of liars!", "time": 1607024824.0}, {"subreddit": "politics", "text": "You're like a child trying to repeat yourself until it's true.", "time": 1607024643.0}, {"subreddit": "politics", "text": "You're just resorting to generalization because you have no idea what you're talking about so your brain has to invent some super simple scenario to explain it yourself.\n\nObviously political parties are made up of lots of different people and not one recurring mindset that you can just call THEY. \n\nThe inability of many people to decide on one thing is usually not the conspiracy again you that you think it is. That's you own ego and greed getting in the way of your rational thinking, simplifying things, getting angry and then launching mass blame.\n\nIn general if you're at the mass generalization stage you already failed yourself at rational thought and you need to go ask other people to show you the solution because you're probably never going to find it with that mindset.\n\nGovernment is not two big entities conspiring against you. It's lots of people going in lots of directions for many different reasons, like a multi-headed beast that cannot decide who is in charge. \n\nIn any case the House has held it's ground for quite awhile now and I suspect Republicans would be far more ok with passing no relief at all than Democrats.\n\nWhat better solution do you actually have beside bitch and moan and attempt to point blame at everyone equally.\n\nHave you ever really considered what the chances are that everyone is equally to blame? That would be like winning the lottery 10,000 times in a row. Humans are complex, they have all kinds of different reasoning. \n\nUntil you can learn to put in the effort to point the blame where it goes, you're opinion has no value other than to inflate your own ego. You speak to hear yourself talk, not to actually present reasons and solutions. I suggest you don't waste your effort if you refuse to take the time to reason things out. \n\nJust let other people think for you if you're too lazy to do it yourself. That's how humanity got this far, not through endless individual freedom.", "time": 1607024627.0}, {"subreddit": "politics", "text": "Nah, a lot more Republicans are moderate on the issues but simply divided blindly by politics. The GOP does a horrible job representing them, but to do good to rally them against Democrats.\n\nRepublican voters don't get what they want, but also Democrats don't get what they want, which at least makes Republican voters somewhat happy.\n\nIn the bigger reality though a lot of Republican support legislation led by Democrats... until they find out it's led by Democrats. Just like lots of Republican would support the stimulus but Republican leadership won't allow it.\n\nRepublicans are scared of siding with Democrats because they know a lot of Dems issues would be popular, just like ACA become too popular even among their own voters to get rid of.\n\nYou're not being realistic about how much easier it is to obstruct law vs pass law and how that benefit the party that wants less change vs the party that wants more reform. What it means is that it's ALWAYS harder to be the liberal and it's always easier to be the party sticking with tradition.\n\nOne party is always calling for reform and the other is saying lets change as little as possible, so the party that wants reform has a constant disadvantage and thus must compromise more. It's easier to sell fear and traditional than new ideas and hope because people would rather have the problem they know than a bunch of new problems. \n\nIt's harder to be the guys asking for more reform and that means you will have to compromise more because it's easier to market sticking with the same old same old 90% of the time or more than it is to sell big change. Only when people are quite desperate does big change start to outsell sticking with the poison you know.", "time": 1607024211.0}, {"subreddit": "politics", "text": "We could easily crowdfund the operation with zero tax dollars and still raise plenty of money, probably far more than the probe costs in fact.", "time": 1607023533.0}, {"subreddit": "politics", "text": "It's nothing, when Trump came into off the Woman's March drew 470,000 protestors just to DC alone and Between 3,267,134 and 5,246,670 in the US as a whole.\n\nThe problem is occasional protests probably don't do a lot. You have to strike or shut down the economy somehow to start making people understand this is not a joke.", "time": 1607019002.0}, {"subreddit": "politics", "text": "The low protest turnout when the election news was still fresh suggests there will be no major turnout. \n\nThe lack of constantly right wing attacks also suggests there is no serious momentum to fight on any kind of scale that would do anything but get it's ass kicked by police and/or national guard.\n\nAND keeps in mind most police in DC are black, police aren't all wind wink nod nod with this shit. People thinking that are doing the same dumb shit generalization Republicans do against immigrants.", "time": 1607018886.0}, {"subreddit": "politics", "text": "Only 36% of police in DC are white, so I dunno about all that. You're thinking of police the wrong way. They are made up primarily from the local population. \n\nIn some areas they are super white and perhaps completely out of touch with anything but white people and their behavior and maybe also racist, BUT in the areas of high minorities the police are often the very types of minorities they often represent.", "time": 1607018629.0}, {"subreddit": "politics", "text": "What percent of police do you think are white in DC?\n\nI google for you!\n\n**52%**\n\n**As of 2017, about 52% of sworn personnel were black, 36% were white, 9% were Hispanic, and 4% were Asian.**", "time": 1607018389.0}, {"subreddit": "politics", "text": "Any Republicans closer to post FDR is going to be much much more moderate because Republicans got destroyed by Democrats so badly. It took them decades to recover and start putting up more radical conservatives.\n\nIt's kind of like how when Boomers turned conservative as a BIG generation they forced Dems to become more moderate. That's the reality of politics. You can stand on your ideals for awhile, but at some point you have to error on the side of winning elections, even if it means altering your morals for awhile.", "time": 1607018106.0}, {"subreddit": "politics", "text": "They know Lincoln didn't fight for the South and they are waving the flag of The South. They can still say we love American and Lincoln as a Republican because they also know how to lie and the internet has taught them to be much more effective propagandists. They can now conspire in large groups, even perhaps lie to polls in great enough numbers to have an impact.", "time": 1607017835.0}, {"subreddit": "politics", "text": "It's more like political labels are just meaningless labels that switch around all through history. The part that matters it's how the ideologies compare. Who was the states rights party back then? I mean.. it's called North vs South for an accurate enough reason. The Northern liberals were the Republicans and the Southern conservatives were the Democrats, that's all. It's still mostly the South being the racists state rights traitors and the North being the liberals trying to do the right thing. The different is just the label, not one group of people transitioning to a good or bad mindset. It's a lot of the 'same' people from the same region, just warped into the future with somewhat different genetics, yet they may as well have inherited much of the intolerance, dislike for education and disdain for law because modern Republicans act JUST LIKE Southern Democrats. It's uncanny.\n\nIt's more accurate to say Republican were the liberals in Lincolns day and Democrats were the conservatives because it's pretty darn easy to prove who is the party of traditional values and who was the party of change.\n\nPolitical labels have changed a lot more than just that too, they've flopped around and been re-used all through US history. It's like there is a finite pool of words that people want to use a political labels, so they just keep re-using those words with no concern what they meant in the past.\n\nIt might be more accurate to just generalize North vs South, because that shit hasn't really changed all that much and it's pretty clear the wounds didn't exactly entirely heal as people wave around their traitor flags thinking they are patritios.\n\n**They are patriots.. of the South, not of the United States. That's kind of the re-occuring problem here. They are still doing what they think is best for them without regard for the nation or respect for the constitutional and laws.**\n\nThey should give up the charade and become The Rebel Party, because that's really what they having been working at for decades.", "time": 1607017430.0}, {"subreddit": "politics", "text": "Republicans were the liberals back then anyway. The political labels are just cool sounding words that get used over and over again for totally different ideologies.", "time": 1607016933.0}, {"subreddit": "politics", "text": "As much as I like privacy protections, it seems to me that strong encryption for everyday communication mostly just helps assholes, same thing with money systems that have less oversight. The people most likely to benefit form those things.. are mostly assholes.\n\nIn a world were you give most of your important info to Facebook and Google to sell, allowing clandestine networks to operate in ways that purposely avoid the consequence of the law seems like a dumb idea.\n\nGovernments justice systems have been in place for hundreds of years. You should not expect technology to provide you loopholes to your justice system. You should expect technology to be adapted to your laws and occasionally tweak them, but not take away significant power.\n\nIt's just not practical to think that because a new technology can be used to try to put yourself above the law, that it has some innate right to be used to do so. Technology is not supposed to force the hand of basic procedural law. Like if I develop an invisibility cloak and use it to cheat the law, that doesn't mean you should just be like OH WELL, he invented the technology, I guess well just have to change all the laws to meet his new reality. That's just not how society and government works. If the technology cannot be made to fit into society, you don't allow it for common use. Like I can't buy a rocket launcher, at least not easily, but I could totally afford one if I really wanted and I might never use it in any bad way, BUT the potential would still be there and society says that a no no.\n\nEncryption should not be a way to give yourself a boost to avoiding legal prosecution for your crimes. That's a net loss to society vs a net gain because the opportunistic assholes will mostly be the only ones to use the exploit. Technically cannot be a net loss to society or it has no place in society.", "time": 1607010145.0}, {"subreddit": "politics", "text": "Unforunately Michael Steele has about as much traction in the GOP as Nancy Pelosi.", "time": 1607007326.0}, {"subreddit": "politics", "text": "It's a bailout economy .. and the bailouts just left town!", "time": 1607006852.0}, {"subreddit": "politics", "text": "What reason is there for a President to follow the law if they are above the law AND can issue blanket pardons. The American citizens should not accept blanket pardons as legitimate regardless what any court says. Americans have never wanted their President to be above the law and they should not accept such behavior from their government regardless of endless interpretations of the law.\n\nAt the end of the day it's We The People who interpret and decide the law. The government is just a tool we use to get a job done and only exists to serve the people. If they can't do that, they need to be corrected without compromise.", "time": 1607006167.0}, {"subreddit": "democrats", "text": "He wasn't a legit candidate in 2016 and he pulled 70+ million voters this time around, don't kid yourself. He is going to be like the Pat Robinson of politics commanding his audience from the sidelines even if he doesn't run.\n\nGetting people to send you money for nothing is a better business model than he's ever had, he's not going to let go of it no matter how the politics plays out, nor will his kids.\n\nHe's setting up those millions of subscribers for the Trump dynasty to inherit, so he's going to ring the Repubican fanboys for everything they are worth. If you had no morals or shame, you'd probably do the same simple because it's such an easy opportunity to make money without effort or risk.\n\nWhen you break laws in politics and campaign finance, they are even less likely to be enforce than most other types of fraud, other than perhaps fraud from the media which is, for some reason never enforced as the for profit service that it is.", "time": 1607005890.0}, {"subreddit": "democrats", "text": "Unless you put him in prison he would just rant and rave that much more and pull voters off the GOP. Stopping him from being eligible won't make the problem go away for the GOP and there will be plenty of media willing to take advantage of the easy for profit nature of the cult like behavior.", "time": 1607005672.0}, {"subreddit": "democrats", "text": "There is no more popular GOP figure to stop him, so yeah, almost certainly. It would be easy for Trump to shave millions of voters off the GOP, if not tens of millions.", "time": 1607005512.0}, {"subreddit": "politics", "text": "Graham already endorsed their claims without proof, his word is poop.", "time": 1607004737.0}, {"subreddit": "politics", "text": "In my opinion Democrats would be better going to Georgia and pretending to be Trump supporters and just repeating that rhetoric. \n\nyeah it's kind of mean, but we've done past the stage of being mean to be competitive in elections.\n\nIf you're still thinking about taking the high road, you need to get your head out of your ass because this country is moving towards Civil War not merely a battle of civility.\n\nThis is not just a battle of mean words. Republicans really are intent on undermining democracy to whatever extent it takes for them to win. \n\nThey've gerrymandered the house, they regularly suppress the vote at the state level, they've discard it most of the senate rules that provided judiciary balance so that they can stack the courts.\n\nAnd they do all of this while consistently producing less votes than Democrats.\n\nNow their president is denying the election results, blatantly undermining democracy and providing sympathy and support for those that call for violence against the United States of America.\n\nAnd Republican top leadership does nothing!\n\nYou should fight as competitively as it takes to win just like you would have done whatever it took to beat the Nazis. You can't always be nice when so much is on the line.", "time": 1606999777.0}, {"subreddit": "politics", "text": "Bill Barr's job is to stay out of the way and occasionally process some federal crimes and investigations.\n\nThe attorney general doesn't project legal force into every state with any real power. In general whatever legal problems you have are happening at the state level.\n\nBesides all that Bill Barr has repeatedly broken the law to protect Trump and has abdicated his duties an independence as attorney general, which has effectively made him and his entire office a complete joke.\n\nAny ruling that Bill Barr barks down at the states the states could just laugh at and say well we really don't care what a corrupt ass attorney general says.\n\nand in all reality the federal government does not have a ton of options to four states to do anything. That's why it normally their number one go to plan is to cut funding, because actually trying to enforce federal law on a large scale within a state that doesn't want it is a complete nightmare that you probably will not win against the much more well-established state.\n\nyet another reason why you primarily want to get legal stuff done at the state level and only rely on the federal government when you've exhausted all other options because they're probably not going to help anyway.\n\nI don't know what the exact percentage is but I imagine like 95% or more of enforced laws are just state laws and almost all the court rulings and sentencings and precedents are state-based. That's pretty much where all the crime and justice happens and The federal government really doesn't do much when it comes to enforcing the law other than when it is a multi-state type of intercommerce issue where the states wouldn't have jurisdiction.\n\nYou can also see this when you look at federal law enforcement, which are ultimately a rather tiny force. I know the FBI may sound impressive, but they're only about 35,000 people total. That's less than the police force of New York City. The state of California employs 120,000 police! \n\nWe have that many police at the state level because they're the ones doing the VAST execution of the law and feds mostly just watch and occasionally take notes.\n\nIt's not like on TV where the state cops can't get the job done and the feds swoop in with their unlimited resources. they don't really have unlimited resources and all federal law enforcement combined really doesn't represent a particularly large amount of people, especially compared to the actual amounts of people that run the states police and judiciary systems which is really just a fraction of the overall executive and judicial employees. \n\nThis is also why focusing on local and state law is usually the most effective avenue  when it comes to actually having an impact on your life", "time": 1606999003.0}, {"subreddit": "politics", "text": "Ha, He's not going to terminate Bill Barr. First off the guy knows way too much, secondly he'd be very lucky to be able to find someone more corrupt than Bill Barr who has any type of qualification.\n\nAt this point Bill Barr is just protecting Trump from himself and Trump is predictably too stupid to realize that..\n\nLike the case about bribery for pardons is Bill Barr attempting to stop Trump from illegally accepting money because he knows the guy definitely will if you offer a month.\n\nIf you wave a couple of million dollars in Trump's face there's a chance he'll do almost anything and worry about how illegal it is later.", "time": 1606998590.0}, {"subreddit": "politics", "text": "It's kind of a shame the anti-science crowd still winds up getting saved by science even as they constantly attack it.", "time": 1606998528.0}, {"subreddit": "politics", "text": "It's like they know a big asteroid is coming and they are just keeping it hidden from us while they milk the system for everything it's worth.\n\nOn April Friday the 13th 2029 it'll turn out the Apophis asteroid is 100 times bigger than predicted making it roughly 18 mi in diameter. It will thread the gravitational keyhole and for the next 39 years we will watch our incoming doom as society tears itself apart.\n\nThat's why Elon musk wants to get to Mars by 2026! The aliens already told him the asteroid was far bigger than the media and scientists would admit!", "time": 1606963791.0}, {"subreddit": "politics", "text": "Police are overfunded, overly corrupt and crime is low, stop being so tame. \n\njust the fact that crime is low means you don't need as much funding for the police. \n\nThe simple fact here is that generation X was more well-behaved than the baby boomers and millennials are more well-behaved than generation X and it's likely generation Z will follow the law even more than millennials.\n\nUntil something happens to reverse that trend we can reduce our spending on police.\n\nWhen people say defund the police it's supposed to be a statement of power because We The People are the ones who fund the police therefore we are the ones  who take funds away from the police.\n\nDefund is just a short and sweet way of saying that.\n\nWe increased police funding when there was high crime and we should decrease police funding when crime has been historically low for decades, especially if we accidentally kept up the trend of increasing police funding after crime stopped rising because that would have been stupid.\n\nThat would be like spending more and more on military even though there aren't really any significant threats. \n\nIt's a waste of taxpayers money and it's throwing away the future of the country because every bad investment or instance of poor money management is just a wasted opportunity.\n\nDefunding the police gives us the opportunity to spend the money where it's better needed.\n\nYou can reword it if you're talking to an audience that is less receptive, but I don't see a real need.\n\nI think people will just get used to the idea because crime will remain low enough, police won't get particularly more popular and Budget constraints will be reoccurring problem.\n\nand you can say oh well it's only going to be the city fair, well you know that's like most of the people and most of the economy and most of the police.\n\nAll the rural folk can get down on their knees for the police and buy them military equipment and worship authoritarian idols, but if the cities want to defund the police they will and nobody's going to be able to get in their way because they're the ones that fund the police.\n\n\n\n\nAt the end of the day this is not even a state issue, it's a local issuematter because it's not a national issue.\n\nWe don't fund the police nationally so it doesn't really matter if some people don't like it and some people do It's not meant for everyone to like It's meant to apply where necessary and often in the instance was where you see a lot of police corruption in the local area.\n\nSo really I think the worst part about the defund the police message is just when you don't bother to be specific about the area you're talking about.\n\nI don't think there's really any national defund the police initiative. These are just instances where people want to punish poor use of taxpayer money or correct bloated funding.\n\nThis is just like calling any other government organization bloated.\n\nYou have to stop being afraid to criticize the police they are only a couple million total employees. They are not some huge influential group of voters or workers or wealth. \n\nThere's a hell of a lot more people that work in food service and there are police and plenty of other industries have far higher amounts of employees so if you're going to kiss anybody's ass you should probably kiss the industry's ass with the most employees or kiss the industry's ass that has the most skill.\n\nPolice are not highly skilled, not a profit-driven industry and not really a ton of people. So we should only cater to them as is practical and necessary which does not include like having six police when you only need two or allowing them all kinds of special privileges and immunity from prosecution. Like 90% of people think police is the super dangerous job and it's not even in the top 10 most dangerous industries. That's how far a reality is off from perception. The amount of police that die per year is crazy low. The police union and the media I believe actually have the police convinced their job is far more dangerous than it actually is and that has the effect of making the police act more scared and trigger happy. \n\nWe have the problem out here in my little rural town, they just keep hiring police for no reason. It's like if you give somebody a budget they're going to justify that budget by trying to grow that budget and then you just wind up in the same corrupt position as as any other government organization or corporation gone wild that tries to grow well beyond its purpose or britches.\n\nHumans are just like that, if you allow them to consume too much and you don't push back against poor spending or greed, they will in general take advantage of those situations and the police departments are no different. It's just a bunch of people doing a job, if they don't have enough oversight they're all going to wind up with their hands in each other's pockets even if they don't know how they got there.", "time": 1606961378.0}, {"subreddit": "politics", "text": "More proof Dems big problem is messaging", "time": 1606952794.0}, {"subreddit": "politics", "text": "Because Bill Barr is not elected to office, duh.", "time": 1606940461.0}], "republican_score": 0, "democrat_score": 5}