{"name": "Bagged-Lunch", "posts": [{"subreddit": "democrats", "text": "But that isn’t how it’s broadcasted during riots and such. Especially when some want to disband police departments all together. \n\nI’m not saying I don’t see the possible benefits of it, the “garbage” I was talking about were all the narratives and fluff that come with statements like that. (I know my post was misleading, I will edit).", "time": 1607224745.0}, {"subreddit": "democrats", "text": "My dad is one of those people. He brings it up on the phone a lot. When I tell him I don’t agree, blow his theories off, and basically act like he’s a nut, he gets so frustrated with me that it’s almost more satisfying than changing his mind. \n\nMaybe use that tactic? Disagree, play cool, and shrug off their “proof” until they are all red in the face. \n\nThese people can’t be convinced.", "time": 1607221840.0}, {"subreddit": "democrats", "text": "Yeah and believe it or not, not all Democrats want to defund the police and don’t necessarily enjoy being associated with it because they are Democrats. I live in a red town full of yards that have both Trump signs AND “We Support our police” signs.\n\nDemocrat = anti-police to a lot of people because of the “defund” garbage.", "time": 1607221225.0}, {"subreddit": "democrats", "text": "I live in a very red town. When people find out I’m a democrat (I’ll always say I am when asked, but don’t generally bring it up) one of the first things they ask is “So are you ok with abortions then?”\n\nFirst off, I’m a male. So I really have no right be anything but pro-choice because I have no right to involve myself with what women do with their bodies. BUT the answer is no. I’m not “Ok with abortions.” Nobody on the left actively roots for people to have abortions. Abortions are terrible things that NOBODY WANTS TO GO THROUGH. \n\nWhy is it that republicans think this?", "time": 1607109728.0}, {"subreddit": "politics", "text": "It’s insane. Anyone who has ever had work work with 4-5 other people on a project for work or school knows how hard THAT can be....and these people think millions of individuals can conspire to rig an election without a shred of proof leaking out.", "time": 1605527605.0}, {"subreddit": "politics", "text": "His followers believe every word of it too. I’m from a rural town and people are head over heels for him here. They believe 100% that the election was rigged. I work with a woman who blurted out “WHY DO THESE DEMOCRATS HAVE TO CHEAT?” During our lunch break. My neighbor believes operation warp speed will save America. These statements are dangerous and there aren’t enough people laughing them off as silly claims. Many people believe them and you cannot convince them otherwise.", "time": 1605524714.0}, {"subreddit": "democrats", "text": "Sometimes you just can’t. I have a similar situation with my father who I call every week. This always comes up and I just shrug it off. They have their vote and you have yours....you can just hope there are more of you than them.", "time": 1604418621.0}, {"subreddit": "politics", "text": "Are we living in a movie or something? Like this feels like something I would binge watch on Netflix or Prime.", "time": 1604318972.0}, {"subreddit": "democrats", "text": "I live in a VERY conservative town in PA. To the point where almost everyone has a pro-trump sign or flag in their yards and and it’s rare to see anything for Biden. Most Biden signs are defaced or stolen, which is why we never put ours out. \n\nI just learn to bite my tongue and be as neighborly as possible. I would rather be remembered as “a pretty nice guy” by everyone than “that loud mouth opinionated liberal” by some. Unfortunately a lot of conservatives don’t follow this same advice!", "time": 1604156065.0}], "republican_score": 0, "democrat_score": 6}