{"name": "slow_rizer", "posts": [{"subreddit": "politics", "text": "Trump admits at rally he won't be around next 4 years @ 25 sec\n", "time": 1607224661.0}, {"subreddit": "democrats", "text": "Laura Ingraham uncovers voter fraud. [Must see]\n", "time": 1605357233.0}, {"subreddit": "politics", "text": "You better start preparing. He ain't leaving. No system can withstand a madman. He'll go to prison if he leaves.", "time": 1607202581.0}, {"subreddit": "politics", "text": "What a quote:\nWe have established a very long, 240-year tradition of an apolitical military that does not get involved in domestic politics,\" Milley told NPR in October. \"We want to ensure that there is always civilian leadership, civilian control of the military, and we will obey the lawful orders of civilian control of the military.\"\n\n\nTrump is the civilian leader. These are opposing views. What happens when civilian control orders to get involved in political affairs?", "time": 1607201421.0}, {"subreddit": "politics", "text": "They are accusing others what they in fact are doing. The coup is on! Get your guns out!", "time": 1607184654.0}, {"subreddit": "politics", "text": "But Hillary did nothimg and got shredded for it.", "time": 1607182789.0}, {"subreddit": "politics", "text": "I wonder when the coup happens Trump will have these poll workers arrested. Then they'll secure a false confession by intimidation. Prosecutors do this all the time by making deals. \n\nThis is gonna be a shitstorm. Get prepared for Armageddon.", "time": 1607174168.0}, {"subreddit": "democrats", "text": "\"Suit case\"... they were ballot cases. \n\nThe truth doesn't matter to them. Trump is trying to get the legislature to overturn the election. He's making strides to that effect.", "time": 1607159006.0}, {"subreddit": "politics", "text": "Where TF are these reporters' heads at? Look how nutty this guy is so far. All he has to do is fucking ssy it was so the deep state can't get to them. Dughhhh!", "time": 1607064435.0}, {"subreddit": "politics", "text": "You need a smoking gun to indict a sitting senator. It's nice to have any investigation.", "time": 1607031648.0}, {"subreddit": "politics", "text": "We do. I'm getting a little paranoid.", "time": 1607027818.0}, {"subreddit": "politics", "text": "I wish I could believe you. For his fans it's a beloved speech by a truth seeker. There's a lot of his fans who really do want martial law. \n\nI don't think Trump is leaving. He's going to figure how to stay. I swear he is. I don't know how but he is. His speech seemed a suggestion he had a plan and quite a bit of confidence. \n\nChange my mind..", "time": 1607023423.0}, {"subreddit": "politics", "text": "I think an internal violent coup is coming. How, msybe q'anon members up in high places. Maybe he'll bomb the US with a false flag. Nuclear or otherwise.", "time": 1607014992.0}, {"subreddit": "politics", "text": "This is it. This isn't crazy, this isba coup, a violent one! I promise it will be. He's saying right there he's taking over. It's in plain sight, soooo?", "time": 1607013366.0}, {"subreddit": "politics", "text": "This needs to be on the front page. What I got from this is:\n\n* Trumps personality is the real problem. Other dictators had similar personalities.\n\n* The dictatorship is a necessary step to hide their crimes. Trump's following the \"authoritarian playbook\". \n\n* You shouldn't take the high road, much of what the dems and Biden are doing. The dictator takes this as a weakness. You must confront him hard and challenge him on everything.", "time": 1606996198.0}, {"subreddit": "politics", "text": "I think I should have said elaborately explained, or explained in length or with fine nuance and detail. Once the initial explanation is done  (like Stop the Steal), say 7 words, the actual receiver should have no other questions about the slogan but instead about the movement or whatever. \n\nI thought of a different explainer: a slogan should be simple enough to garner understanding and a guide to a platforms meaning.", "time": 1606929836.0}, {"subreddit": "politics", "text": "Obviously, this was/is an open ended slogan. His supporters might put something positive as the answer and his detractors something negative. \n\nTo me it's quite an ingenious slogan. To me it meant Obama can become the first black president. \n\nAs far as your own financial situation, it's hard to say that it was Obamas fault or not. Remenber that financial meltdown just as he was taking office? It wasn't a good time for anyone except the rich. But it was hardly Obomas fault.", "time": 1606920899.0}, {"subreddit": "politics", "text": "If only I could have been so wise to think of this retort.", "time": 1606913807.0}, {"subreddit": "politics", "text": "There's no way in hell \"defund the police\" was/is a good slogan.\n\nDefund\ntransitive verb \n: to withdraw funding from\nto deplete the financial resources of: \n\nSo let's just say the slogan is lacking in accurateness.", "time": 1606885684.0}, {"subreddit": "politics", "text": "> Every single person I've had a 2-minute conversation about what \"defund the police\" means has been like \"oh, well that makes sense\",\n\nA slogan schould never have to be explained. The right can't meme and the left can't slogan.", "time": 1606883347.0}, {"subreddit": "politics", "text": "This came from a BLM protest chant. \"No, no, no, the words don't mean that.\" \n\nLPT: if a slogan needs to be explained, maybe get a better one.", "time": 1606883146.0}, {"subreddit": "politics", "text": "Here it is. \n\nTrump: I declare martial law. We need a new vote. \n\nDems: well if we must and have no other choice. \n\nTrump: ooops, I declare myself the winner because it's too late for another election; besides it would be unconstitutional to have another go at at.", "time": 1606882220.0}, {"subreddit": "politics", "text": "It's not over until  Jan. 20th!", "time": 1606866011.0}, {"subreddit": "politics", "text": "Must be here.   r/nottheonion", "time": 1606708588.0}, {"subreddit": "politics", "text": "Wow, this is news. Can you imagine? Tonight at ten, traffic went as planned, there were no accidents and no deaths!", "time": 1606708329.0}, {"subreddit": "politics", "text": "There are those who incompetent but sane and there are those who are competent but insane.", "time": 1606698584.0}, {"subreddit": "politics", "text": "Well propaganda is going to trump evidence when confusion arises. The repubs have an advantage there so maybe they want questionable elections. \n\nYa know, Trump is so desperate to pull off this win. I think because he won't ever get another chance. Plus all his illegal behavior", "time": 1606696840.0}, {"subreddit": "politics", "text": "Trump ran once and won. Hillary was different because she had 20 years of right wing attacks agsinst her. Why risk it?", "time": 1606678061.0}, {"subreddit": "politics", "text": "I don't want him to run again. We laughed the first time. I'm not laughing anymore. I'm actually scared. Though still far, he's gotten closer to destroying our republic than anyone before. We need to stop goading this man along.", "time": 1606670308.0}, {"subreddit": "politics", "text": "> You mean as president of the United States, I don't have standing? What kind of a court system is this?\" Trump continued.\n\nReplace president with \"king\".", "time": 1606668732.0}, {"subreddit": "politics", "text": "> It is not as if she actually believes any of her so called theories\n\nBut what if she does? Doo dooohhh doo doooooo  doo dooohhh", "time": 1606667914.0}, {"subreddit": "politics", "text": "How can the conservative subreddits keep positive about these court cases? There are some reasonable comments out there about the lawsuits, but not many.", "time": 1606666978.0}, {"subreddit": "democrats", "text": "Whrn are these suits going to get their lawyers sanctioned?", "time": 1606609011.0}, {"subreddit": "politics", "text": "It was 10 feet to 6 feet distance. State Supremes overruled that. So Trump didn't even win that.", "time": 1606606523.0}, {"subreddit": "politics", "text": "I think I'm going to keep repeating this. \n\nWhat Trump is breaking the norm of us truth. He's teaching politicians and others the value of lying and propaganda. Cruz sees it's the words that get linked/repeated and not the truth.", "time": 1606604060.0}, {"subreddit": "politics", "text": "Oh no. Librel media can't do that. But conservative media does it all the time! \n\nIgnoring Trump means the conspiracy if the librel media is true. Not ignoring him makes it true too.", "time": 1606602998.0}], "republican_score": 0, "democrat_score": 3}