{"name": "Sugarysam", "posts": [{"subreddit": "politics", "text": "Factbox: Notable legal opinions of Trump's Supreme Court nominee Barrett\n", "time": 1602508739.0}, {"subreddit": "politics", "text": "Duncan Hunter may delay prison term until 2021 due to coronavirus\n", "time": 1588856019.0}, {"subreddit": "politics", "text": "Alabama Supreme Court: Fence 'alters' Confederate monument in Birmingham\n", "time": 1574888901.0}, {"subreddit": "politics", "text": "Zelensky could win big by gambling on Trump\n", "time": 1569195861.0}, {"subreddit": "politics", "text": "Mike Pompeo unveils panel to examine 'unalienable rights'\n", "time": 1562637161.0}, {"subreddit": "politics", "text": "'They admitted their guilt': A look at what Trump has said about the Central Park Five\n", "time": 1561007269.0}, {"subreddit": "politics", "text": "Senate GOP declares war on conservative troublemakers\n", "time": 1558744614.0}, {"subreddit": "politics", "text": "Mueller fails to detonate for endangered Republicans\n", "time": 1556110479.0}, {"subreddit": "politics", "text": "Trump Isn’t Just Reversing Obama’s Foreign Policies. He’s Making it Impossible for His Successor to Go Back to Them.\n", "time": 1556023814.0}, {"subreddit": "politics", "text": "A threat in Trump’s back pocket: Shaking up the global oil industry\n", "time": 1556023637.0}, {"subreddit": "politics", "text": "Mueller explains why his family left Trump's golf club\n", "time": 1555641521.0}, {"subreddit": "politics", "text": "Hatch warns 'dangerous' idea of court packing could hurt religious liberty\n", "time": 1554953629.0}, {"subreddit": "politics", "text": "Here’s what happened inside Trump National Golf Club during the president’s South Bay visit\n", "time": 1554769751.0}, {"subreddit": "politics", "text": "Inside the breakdown of auto emission talks between California and the Trump White House\n", "time": 1551637636.0}, {"subreddit": "politics", "text": "Supreme Court's ‘10th justice’ favors unusual tactic for Trump cases\n", "time": 1549895616.0}, {"subreddit": "politics", "text": "Trump Administration Begins 'Remain In Mexico' Policy, Sending Asylum-Seekers Back\n", "time": 1549466475.0}, {"subreddit": "politics", "text": "In the heart of California, a sheriff makes a case for a middle ground on immigration\n", "time": 1548617387.0}, {"subreddit": "politics", "text": "Guatemala in political crisis as Trump administration looks the other way\n", "time": 1547397834.0}, {"subreddit": "politics", "text": "Mnuchin has a simple reason why the Dow is poised for its worst December since 1931\n", "time": 1545165596.0}, {"subreddit": "politics", "text": "Don't Expect Mueller to Charge a Grand Conspiracy\n", "time": 1544104906.0}, {"subreddit": "politics", "text": "Conservative activists: Trump was ‘tricked’ into Calif. endorsement\n", "time": 1536348054.0}, {"subreddit": "politics", "text": "Did Donald Trump’s Administration Help Vladimir Putin Silence An Opposition Figure In Russia?\n", "time": 1533043010.0}, {"subreddit": "politics", "text": "Calling my fellow Republicans: Trump is clearly unfit to remain in office\n", "time": 1532291380.0}, {"subreddit": "politics", "text": "Allred outraises Sessions as 5 Texas Democrats lead run for the money in GOP-held House districts\n", "time": 1532005177.0}, {"subreddit": "politics", "text": "Watchdog closes Zinke threat probe, citing lack of cooperation from Interior\n", "time": 1530146668.0}, {"subreddit": "politics", "text": "Pentagon's new problem after years of crying poverty: Spending all the cash\n", "time": 1520185638.0}, {"subreddit": "politics", "text": "Steve Mnuchin rushes to clarify he doesn’t care about gun laws\n", "time": 1518750060.0}, {"subreddit": "politics", "text": "Has Anyone Seen the President? Michael Lewis goes to Washington in search of Trump and winds up watching the State of the Union with Steve Bannon.\n", "time": 1518188883.0}, {"subreddit": "politics", "text": "Supreme Court's conservatives appear set to strike down union fees on free-speech grounds\n", "time": 1518098651.0}, {"subreddit": "politics", "text": "Mnuchin: Trump open to national internet sales tax\n", "time": 1517376853.0}, {"subreddit": "politics", "text": "Trump’s jargon is infectious\n", "time": 1516559025.0}, {"subreddit": "politics", "text": "Guess who loses with Trump's tax plan?\n", "time": 1508724240.0}, {"subreddit": "politics", "text": "With consent from Brazil, AT&T has only one regulatory hurdle left before it can gobble Time Warner\n", "time": 1508418243.0}, {"subreddit": "politics", "text": "With consent from Brazil, AT&T has only one regulatory hurdle left before it can gobble Time Warner\n", "time": 1508417768.0}, {"subreddit": "politics", "text": "Demonstrators, counter protesters converge in Seattle\n", "time": 1502661834.0}, {"subreddit": "politics", "text": "Lisa Murkowski Walked A Tightrope In Alaska When She Voted 'No' On Obamacare Repeal\n", "time": 1501437388.0}, {"subreddit": "politics", "text": "How to secure the border. Spoiler Alert: A wall won't do it.\n", "time": 1492968288.0}, {"subreddit": "politics", "text": "What happens when the 'bad hombres' are ICE agents? The finer points of immigration law get ignored\n", "time": 1488146298.0}, {"subreddit": "politics", "text": "This New York cow town loves Trump, but talking politics can get you tossed from the only bar\n", "time": 1488144967.0}, {"subreddit": "politics", "text": "Trump's Cabinet picks aren't standing by some of his controversial opinions — or even discussing them\n", "time": 1486221289.0}, {"subreddit": "politics", "text": "Advocate’s Russian ties cause concern in state secession movement\n", "time": 1486221285.0}, {"subreddit": "politics", "text": "Can Nancy Pelosi survive the Trump aftershock?\n", "time": 1480020071.0}, {"subreddit": "politics", "text": "Donald Trump’s letter to the L.A. Times\n", "time": 1477191715.0}, {"subreddit": "politics", "text": "Campaign manager: Trump's donation to Clinton Foundation not 'pay to play'\n", "time": 1472173559.0}, {"subreddit": "politics", "text": "Donald Trump Taps Foreign Work Force for His Florida Club\n", "time": 1456409593.0}, {"subreddit": "politics", "text": "In 1992, Joe Biden called for an election-year blockade of Supreme Court nominations\n", "time": 1456190487.0}, {"subreddit": "politics", "text": "Hillary Clinton will help Obamacare move forward\n", "time": 1454682111.0}, {"subreddit": "politics", "text": "Bernie Sanders' fiction-filled campaign\n", "time": 1453952780.0}, {"subreddit": "democrats", "text": "> The GOP is now divided between conspiracy theorists and those who want to keep at least a toehold in reality.\n\nThe GOP has been run by the conspiracy theorists since at least 2010.  Any republican who thinks otherwise is as delusional as the nuttiest of Qanon", "time": 1607195451.0}, {"subreddit": "politics", "text": "Cue the Trump Facebook speech with a stack of blank paper he refers to as “the greatest vaccine plan ever created.”", "time": 1607194726.0}, {"subreddit": "politics", "text": "Actually, I just discovered TV tropes.  I think you nailed it with Refuge in Audacity.  We are seriously sitting back and asking ourselves  if he’s “pretending to try to seize power for the sake of his grift”, when he might just be trying to do the exact thing he appears to be doing.", "time": 1607142049.0}, {"subreddit": "politics", "text": "He literally will never accept defeat.  Even if he is physically dragged from the White House, he’ll be running around claiming to be the real president.  He’ll be a touring deposed ruler playing the whole Fake King trope. He might even openly take on a foreign backer under the guise of being in exile.  Jesus this sounds crazy but way too plausible. \n\nhttps://tvtropes.org/pmwiki/pmwiki.php/Main/FakeKing", "time": 1607133566.0}, {"subreddit": "politics", "text": "Ah, then not an accomplishment if it’s veto proof", "time": 1607118127.0}, {"subreddit": "politics", "text": "It would be a great sign for the future if Congress could muster a veto proof majority for this vote.  \n\nNot holding my breath", "time": 1607091354.0}, {"subreddit": "politics", "text": ">”This isn’t California,” said Fuchs. “We actually investigate and seek to prosecute individuals who try vote here illegally.\n\nAnd there it is.  Any evidence that California doesn’t investigate voter fraud?  Nope, just some limp-dick Georgia official who thinks he needs to include an unprovoked attack on big blue CA to preserve his street cred with Cult45 neighbors who might get upset about him doing his fucking job.\n\nEdit: Fuch that guy.", "time": 1606965560.0}, {"subreddit": "politics", "text": "This is why integrity and competence are important. I firmly believe that at least 80% of our doctors and nurses will take a vaccine that they believe is scientifically sound.  \n\nThis is a deadly disease.  If the vaccine is based on questionable science, do you really think a $1500 bribe is enough to make medical professionals step up?   I sure hope not, because that’s mighty cheap.", "time": 1606858765.0}, {"subreddit": "politics", "text": "The vaccine needs to be delivered to exactly the right people.  Adding a money incentive will only cause people to try to jump in line.  \n\nDo the stimulus, and do a lot of it.  \n\nMake the vaccines free and make sure the people managing delivery exude competence and integrity.\n\nDon’t get those efforts mixed up.", "time": 1606801947.0}, {"subreddit": "politics", "text": "National Review, u okay?   \n\nSomeone’s right and someone is wrong here, but NR is unwilling to take a side.  Strange.", "time": 1606793361.0}, {"subreddit": "politics", "text": "Imagine Donald Trump playing with a dog.", "time": 1606701024.0}, {"subreddit": "politics", "text": "Surgeon General Adams, nearly half this country would gladly let your mother die if it means they can dine-in at Applebee’s.  Their biggest objection would be the expenditure of any tax  dollars to prevent her death or ease her pain.", "time": 1606683277.0}, {"subreddit": "politics", "text": "Let me fix that.\n\n>”Senior Republican Senator accepts that his party hasn't overthrown Democracy in a desperate, fascist power grab YET, but would be cool with it if they can.”", "time": 1606682887.0}, {"subreddit": "politics", "text": "In my lifetime, I have never seen a national candidate elected on a purely progressive platform.  The conservative candidate has to be shackled to recession, scandal, or war.  Usually a combo of the three.  \n\nAmerica is governed by a conservative plurality of voters. In a strong peacetime economy, tax policy decides the election in favor of conservatives every time.  They rely on the rest of us to divide ourselves.", "time": 1606426406.0}, {"subreddit": "politics", "text": "Cult 45 are like Daffy Duck shouting “DUCK SEASON!”  over and over just to own the libs.   \n\nAssume every stranger you see is one of them, and keep your distance.", "time": 1606411993.0}, {"subreddit": "politics", "text": "It’s funny just yesterday I saw a headline about the “surprisingly moderate Supreme Court”.   It’s a little like the articles about how ‘Maybe Kavanaugh isn’t that bad’ that came out earlier this year before he ruled to cancel votes in WI.", "time": 1606410107.0}, {"subreddit": "politics", "text": "If this precedent is set, the only solution is either a constitutional amendment or another SCOTUS decision reversing it.\n\nOr, depending on how narrowly the decision is written, the Indiana legislature can change the law.", "time": 1606407970.0}, {"subreddit": "politics", "text": "> A three-judge panel for the 7th Circuit Court of Appeals heard the case in early 2017 but waited 32 months to issue a decision that sided with the mothers. The panel of conservative judges finally ruled unanimously on behalf of the mothers.\n\nIt’s almost like conservatives know they can’t win without rigging the game.", "time": 1606407509.0}, {"subreddit": "politics", "text": "Never say never, Joe.  I said that about the Democratic Party in about 1998.  Cultish support of dear leader can happen to any party.", "time": 1606336934.0}, {"subreddit": "politics", "text": "All this means is that Trump has given up on his “legal team” and thrown them to the dogs.  \n\nExpect Carlson to still be fully on board with GOP officials appointing their own electors, regardless of the vote.  That seems to be the current Trump strategy. \n\nHe’ll be arguing that this is how the founders intended it.", "time": 1605909696.0}, {"subreddit": "politics", "text": "Oh wow, this is a gutsy play right off the bat for Biden.  If he gets out there and the GOP wins, that’s a total momentum killer.  Suddenly this thing becomes that much more of a must win.", "time": 1605491393.0}, {"subreddit": "politics", "text": "I see we’re once again relying on Republican decency. That always works well.", "time": 1605449974.0}, {"subreddit": "politics", "text": "I’m sure the riot police will be there waiting for them, with rubber bullets and pepper spray ready.", "time": 1605223587.0}, {"subreddit": "politics", "text": ">My AR-15 and drum magazine survived...\n\nI also have expensive things that are collecting dust and do nothing to enrich my life or society.  Our things make us feel so much more secure, don’t they?", "time": 1605216113.0}, {"subreddit": "politics", "text": "I’m confused by these stories because I have not seen Rahm’s name floated for any cabinet post.  \n\nTrying to figure out what if she was asked about him and is just reacting, or if she picked Rahm out of the air as the one Democrat that better not be in the cabinet.", "time": 1605149968.0}, {"subreddit": "politics", "text": "We can pretty safely assume that the real number is somewhere around 44%.  It’s pretty clear that there’s a solid 5-10% of Americans who routinely lie to pollsters.", "time": 1605147136.0}, {"subreddit": "politics", "text": "Fortunately he and Trump don’t have to agree on who is the master of their mutually exclusive universes.", "time": 1605063385.0}, {"subreddit": "politics", "text": "Trump‘a China strategy was a disaster.  \n\nHaving said that, I’d like to see Biden drop the tariffs in favor of sanctions due to the treatment of the Uighers.  I’d also like to see a pivot to a more aggressive, multi-lateral stance visa vis Taiwan and the South China Sea.", "time": 1604984795.0}, {"subreddit": "politics", "text": "It’s refreshing to hear her thoughts about the personal toll of office.  I’d like to think this is what most honest, passionate people go through when they first experience the toll of leadership. \n\nIt makes me that much more in awe of people like Maxine Waters and Nancy Pelosi who have spent decades being attacked just like AOC has .\n\nDemocracy and law are substitutes for violent revolution, and AOC is near the point of the spear for progressives in America.  Because she is an agent of change, the way she is being treated goes with the territory.  Just like on a real battlefield, we have to make alliances, and compromises on strategy.  The modern Democratic Party since the New Deal has always been this type of coalition.  We stand together to do the most that can accomplished for all of the people, without handing power off to the far right.  This election proved how tenuous that dynamic is.  That doesn’t mean you have to compromise on principals; it just means you have to be tough, persuasive and patient. I think she knows that.", "time": 1604855032.0}, {"subreddit": "politics", "text": "It’s a caravan, not a train.", "time": 1604325604.0}, {"subreddit": "politics", "text": "> \"Maybe a lot of little things add up and Biden loses Pennsylvania by half a point, and then he doesn't quite pull off Arizona or North Carolina. He does have other options. ... But still, without Pennsylvania, then Biden becomes an underdog.\"\nThe big picture: FiveThirtyEight gives President Trump a 10% chance of winning the election and Biden a 90% chance.\n\nOh ffs. Nate making sure that no matter what happens, he said it “might happen”.", "time": 1604267773.0}, {"subreddit": "politics", "text": "How about the little bitch Carlson is trying to find a graceful way to not be sued for libel by publishing fake documents from a foreign source? He can’t admit he and his producers were duped so he has to play this stupid game.", "time": 1604087980.0}, {"subreddit": "politics", "text": "With high Florida humidity. Sweat’s not evaporating?  Oh, well let’s get you more wet.", "time": 1604061450.0}, {"subreddit": "politics", "text": " LOL, I don’t think we’re going to see a face turn in this one.", "time": 1604017804.0}, {"subreddit": "politics", "text": "I think Trump’s entire campaign and presidency has been adapted from Vince McMahon’s “Corporation” angle in the late 90’s.  What’s truth or fiction doesn’t matter, as long as the crowd plays along.  \n\nI don’t want to trivialize what has happened any further, but I think it important to recognize how WWE’s manipulation of reality has so easily transferred to Republican politics.", "time": 1603998892.0}, {"subreddit": "politics", "text": "Sorry, but no.  I’m not saying that Chris Wray is doing a bad job or is a political hack, but he hasn’t been fired by this president. That goes against his credibility. \n\nBiden should appoint someone who is at least a little antagonistic to the Justice dept-  possibly someone who has made a career as a civil rights lawyer.  \n\nHire back the people below the director that Trump chased out, but the person at the top needs to have a new level of independence.", "time": 1603939678.0}, {"subreddit": "politics", "text": "Tucker should devote a full segment to how Louis DeJoy is responsible for the failure to nail Biden.", "time": 1603939006.0}, {"subreddit": "politics", "text": "They could also pretend the votes didn’t happen or aren’t valid.  They have all kinds of levers they can pull with their current power. \n\nIf they try it, they are abandoning the idea of a peaceful transition of power.", "time": 1603937016.0}, {"subreddit": "politics", "text": "Oh jeez don’t give DeSantis an excuse to complain about fucking voter fraud.  The fact that it’s his own government doesn’t help at all if it means he can get the legislature to appoint electors regardless of the vote.", "time": 1603919779.0}, {"subreddit": "democrats", "text": "Let the blame game commence.   Will the campaign blame the city, the airport, the governor, or the Biden Campaign?", "time": 1603893178.0}, {"subreddit": "politics", "text": "Just making judges elected doesn’t necessarily solve any problems. All that means is that they can run on a platform of “fuck you, that’s what” and win once a decade or so.. then get re-elected for ever and ever.  This is what happens with elected state court judges all over the country.", "time": 1603849139.0}, {"subreddit": "politics", "text": "Who is laughing?  I don’t see any evidence anyone is laughing about the Trump campaign encouraging the spread of a disease that has killed 225,000 people this year.  People are horrified and angry.  \n \n>only two people I know who got Covid are both Democrats\n\nAh, so since you don’t know enough people to have seen someone suffer with this disease, we’re all supposed to dismiss it and pretend the suffering is fake. Your lack of empathy is very much on-brand, so kudos.", "time": 1603773396.0}, {"subreddit": "politics", "text": "..And they are all swing states until Trump and his goons in the Senate are gone.", "time": 1603767392.0}, {"subreddit": "politics", "text": "Is this an in-kind campaign contribution?", "time": 1603491386.0}, {"subreddit": "politics", "text": "It’s not like this is a marginally moderate nominee.  She’s hard right.  Nobody who feels strongly in favor of this justice is going to vote for Sinema anyway.   I hope Sinema can recognize that her seat isn’t up until 2025.  If she votes with her party here, it won’t matter by then.  If she votes against the party, she can rest assured there will be a well funded challenger from the left—- in a state that is changing quickly.", "time": 1603485236.0}, {"subreddit": "politics", "text": "Last year at this time, the offer on the table was $10-12 billion.  Why are we now at 8? \n\n\nhttps://www.nbcnews.com/news/us-news/purdue-pharma-offers-10-12-billion-settle-opioid-claims-n1046526\n\n\nI guess I’m not clear on how this impacts the civil cases.", "time": 1603311893.0}, {"subreddit": "politics", "text": "Fascist crowd.  Not proto-fascist.", "time": 1603036336.0}, {"subreddit": "politics", "text": "They do not look like the official boxes.  However, the first ones had the word “official” on them.  GOP said they would remove the word official, but I’m not sure they’ve done it.", "time": 1602953433.0}, {"subreddit": "politics", "text": "If (big if) Trump isn’t still running the show next february,  I will make it my mission to make sure that every Trump voter I know hears about what they did to the country every single time.", "time": 1602802838.0}, {"subreddit": "politics", "text": "Congressional races and down-ballot, yes. \n\nBut more importantly, they want to claim that they were victims of voter suppression.  Once the state comes in and puts an end to this, they’ll squeal long and loud.  They’ll go to court. They’ll get months of sympathetic Fox News coverage out of it.  When white nationalist thugs show up at polling stations to intimidate minority voters, GOP will say that it’s no worse than what happened to them in California. They thrive on these false equivalencies.", "time": 1602737178.0}, {"subreddit": "politics", "text": "Herd immunity means thinning the herd-  specifically people who lack access to healthcare or the economic resources to seek treatment.   \n\nThere is nothing about that fact that worries Republicans. Remember that when you vote.", "time": 1602727129.0}, {"subreddit": "politics", "text": "Lindsey says it was sarcasm. But how can anyone know for sure?   At this point, he has wrecked his credibility to the point no one can say where he stands on anything.  That’s what happens when you are DJT’s finger puppet.", "time": 1602699484.0}, {"subreddit": "politics", "text": "This isn’t about electing Trump though. GOP is trying to take back congressional and legislative seats after getting humiliated in 2018.  \n\nIt also sure looks like they are trying to create a legal confrontation in which they claim the state is suppressing their votes.  Not sure what the endgame of that would be, other than as a rallying cry for like minded idiots in future elections.", "time": 1602682179.0}, {"subreddit": "democrats", "text": ">you would be a moron\n\nA fucking moron to be precise.  There is a soft /s around my initial comment. I don’t seriously believe they would do that.  \n\nI do seriously believe that they would use any excuse to play the “no,you” card, and really prefer no one give them an excuse to do so.", "time": 1602551303.0}, {"subreddit": "democrats", "text": "Probably should pull that down as it’s not a legal polling location or drop box.  \n\nTrump voters are dumb enough to put their ballots there, and nutty enough to sue if the ballots aren’t counted.", "time": 1602543629.0}, {"subreddit": "politics", "text": "For reference here is a link to the full list of legal Dropbox locations in Orange County.  It’s not like there’s a shortage of locations.  There’s no reason for the GOP to do this other than shenanigans.  \n\n\nhttps://www.ocvote.com/voting/voting-and-dropoff-locations-by-election/ballot-drop-box-locations-for-the-2020-presidential-general-election", "time": 1602543481.0}, {"subreddit": "politics", "text": "I’m not sure what game the GOP is really playing. My guess is that they want to drag the state to court and claim that the GOP vote is being suppressed, specifically in the Orange County congressional races. \n\nWhether they are also packing the ballot box with a bunch of intentionally fraudulent votes is not clear.  But if GOP get permission from the state or court to allow these votes to be counted, i hope the state contacts every single one of the voters involved for an affidavit that their ballot was handled in this way and is accurate in full.", "time": 1602542592.0}, {"subreddit": "politics", "text": "The sad thing is that if people of sound mind put too much attention on the stupid thing this Sheriff said, it will likely wind up featured on Hannity, then Bill Barr getting involved and trying to torpedo the case.", "time": 1602277214.0}, {"subreddit": "politics", "text": "You can’t spell Pestilence without Pence.", "time": 1602167483.0}], "republican_score": 0, "democrat_score": 4}