{"name": "wenchette", "posts": [{"subreddit": "politics", "text": "Arizona Legislature 'cannot and will not' overturn election, Republican House speaker says\n", "time": 1607205689.0}, {"subreddit": "democrats", "text": "Biden officially secures enough electors to become president\n", "time": 1607129737.0}, {"subreddit": "politics", "text": "Pennsylvania Republican legislative leaders say they cannot overturn popular vote, but promise continued investigation of election\n", "time": 1607112850.0}, {"subreddit": "democrats", "text": "Court Order Reveals DOJ Investigation Into Suspected Bribery-For-Pardon Scheme\n", "time": 1606869028.0}, {"subreddit": "politics", "text": "Ohio tea party leader urges Trump to suspend the Constitution, declare martial law to hold new vote\n", "time": 1606861668.0}, {"subreddit": "politics", "text": "With the vote count now over, here’s how Pennsylvania broke for Joe Biden\n", "time": 1606697812.0}, {"subreddit": "politics", "text": "Biden’s Covid-19 Mission — As Donald Trump continues to find new ways to make things worse, Joe Biden is preparing to take immediate action on an escalating crisis.\n", "time": 1606610485.0}, {"subreddit": "politics", "text": "Trump Is Gaslighting Himself and Really Thinks He Won the Election, Mary Trump Says — “I don’t think he’s ever accepted the truth of the loss. I don't think he’s psychologically or emotionally capable of that.”\n", "time": 1606524357.0}, {"subreddit": "democrats", "text": "A(nother) Georgia GOP Senator Was Reportedly Investigated for Insider Trading — This is historically bad timing for the Senate Republicans, as both senators are facing run-off votes that could decide the balance of the chamber.\n", "time": 1606521715.0}, {"subreddit": "politics", "text": "Biden Considering Lisa Monaco, Sally Yates For Attorney General\n", "time": 1606007450.0}, {"subreddit": "democrats", "text": "Michigan group sues Trump campaign for alleged mass voter suppression\n", "time": 1605986205.0}, {"subreddit": "democrats", "text": "Trump’s Strategy for Contesting the Election: Throw Out Black People’s Votes\n", "time": 1605744440.0}, {"subreddit": "politics", "text": "The first big test of Trump’s attempt to steal the electoral college was a failure\n", "time": 1605738703.0}, {"subreddit": "politics", "text": "Trump’s originalist judges should reject his lawsuits usurping states’ rights. The framers would.\n", "time": 1605653812.0}, {"subreddit": "politics", "text": "Time to pack your boxes, Donny.", "time": 1607205719.0}, {"subreddit": "politics", "text": "...who lost the popular vote *twice* by millions of votes.", "time": 1607129788.0}, {"subreddit": "democrats", "text": "[Per Marc Elias, it's now 44 losses.](https://twitter.com/marceelias)", "time": 1607122585.0}, {"subreddit": "politics", "text": ">The statement they issued late Thursday deals a blow to President Donald Trump’s hopes of overturning the state’s election results, which gave President-elect Joe Biden a decisive boost.\n\nThis seems to be what triggered Tooty Giuliani's bitter tears tweet today.", "time": 1607112921.0}, {"subreddit": "democrats", "text": "This is garbage. Dominion is owned by Staple Street Capital, which is based in New York.\n\nhttps://www.axios.com/private-equity-dominion-elections-voting-71afa7ff-9a97-4006-96d5-3370afb3bb61.html\n\nSee also this:\n\nhttps://www.dominionvoting.com/dominion-statement-on-sidney-powell-charges/", "time": 1607111350.0}, {"subreddit": "politics", "text": "The money he's raising through his election fraud scam can't be used for something like this because it's entirely unrelated to political office.\n\nMary Trump turned over voluminous financial records to the *New York Times* and presumably also to state and city investigators. Outside of his possible criminal charges, I think this will prove to be his biggest legal liability. Tax avoidance is very, very expensive if you're caught, and she provided more than enough documentation to sink him and his siblings.", "time": 1607104413.0}, {"subreddit": "politics", "text": "Correct. I was thinking more like a Louis XIV absolute monarch type of king.", "time": 1607103667.0}, {"subreddit": "politics", "text": "There is no mechanism to \"suspend the Constitution.\" No such critter exists. That's like saying someone could \"suspend oxygen.\"\n\nIf Trump tried to do something blatantly unconstitutional, he would be quickly slapped down by a federal court. It has happened many, many times during his presidency. And he always backs down ultimately. And, yes, even his nominees will slap him, as happened recently with the Third Circuit appeal in one of his election cases.\n\nTrump makes a lot of noise but he's ultimately rather feckless. In order to impose a dictatorship, a lot of work is first necessary. He's done none of that. A President has no power to void an election. If he tries to declare martial law, he needs a compelling and valid reason. Being a sore loser isn't that reason. If he doesn't have a compelling and valid reason, martial law would be quickly voided by a federal court. He is a President, not a king. He has broad but ultimately limited powers. The highest and last authority is the judiciary and they won't play along with any kind of unconstitutional games he might try.", "time": 1607103216.0}, {"subreddit": "politics", "text": "You'd think at $10K a day, Rudy would invest in some Gas-X.", "time": 1607036461.0}, {"subreddit": "democrats", "text": "Article link:\n\nhttps://www.buzzfeednews.com/article/davidmack/rudy-giuliani-fart", "time": 1607035066.0}, {"subreddit": "politics", "text": "This is a civil action. A pardon would have no bearing on that.", "time": 1606949200.0}, {"subreddit": "politics", "text": "> Brennan Center\n\nThey're a progressive legal think tank affiliated with NY University School of Law.\n\nhttps://www.brennancenter.org/", "time": 1606929026.0}, {"subreddit": "politics", "text": "There needs to be a \"catastrophic emergency\" for that to be invoked.\n\nhttps://www.fema.gov/txt/about/org/ncp/nspd_51.txt\n\nLosing an election is not a catastrophic emergency.", "time": 1606928926.0}, {"subreddit": "politics", "text": "Correct but he needs a valid reason to declare martial law.", "time": 1606928630.0}, {"subreddit": "politics", "text": "This literally arrived in my email just as I opened Reddit:\n\nhttps://www.thedailybeast.com/moorish-sovereign-citizens-are-knocking-on-doors-and-claiming-peoples-homes", "time": 1606928547.0}, {"subreddit": "politics", "text": "No, I'm arguing from within the parameters of the Constitution. It is our nation's highest authority. I don't know Elizabeth Goitein personally but I've seen her speak and I've read some of her work. I suspect she would agree that a President who attempted to suspend the Constitution was in violation of that very same document.", "time": 1606868225.0}, {"subreddit": "politics", "text": "> If civilian courts were closed as a result of a foreign invasion or a civil war\n\nThat's different than what you earlier posted when you said \"if the courts were to be closed which is an Emergency War power Trump has.\" Note that the linked article did not make that sweeping conclusion.\n\nWe are not currently in a state of war nor is there any foreign invasion or civil war.", "time": 1606867822.0}, {"subreddit": "politics", "text": "> if the courts were to be closed which is an Emergency War power Trump has.\n\nLet's see a source on that. And, by the way, we're not currently in a state of declared war with any nation.", "time": 1606867466.0}, {"subreddit": "politics", "text": "As Wesley Snipes learned the hard way.\n\nOr should I say \"the hard-time way\"?", "time": 1606867097.0}, {"subreddit": "politics", "text": "There's a big difference between imposing martial law and \"suspending the Constitution.\"", "time": 1606866922.0}, {"subreddit": "politics", "text": "Yes, but that's a long way from suspending the Constitution.", "time": 1606866732.0}, {"subreddit": "politics", "text": "My brain just gagged at the image of Trump in pajamas.", "time": 1606865762.0}, {"subreddit": "politics", "text": "I am aware of that term; however, it's not widely used in political science. Note that the link you provided has only a single source for the phrase.", "time": 1606865604.0}, {"subreddit": "politics", "text": "> in a coup\n\nIt technically wouldn't be a coup. A coup requires the ouster of the head of state. If Trump were to do this, then he would be imposing a dictatorship. He would essentially be doing what Ferdinand Marcos did in 1972 in the Philippines.", "time": 1606864549.0}, {"subreddit": "politics", "text": "That's the \"sovereign citizen\" approach. Trouble is, it fails pretty much every single time.", "time": 1606862481.0}, {"subreddit": "politics", "text": "In case you're wondering, Trump cannot \"suspend the Constitution.\"", "time": 1606861714.0}, {"subreddit": "politics", "text": ">Digging into the numbers, it’s a story of the suburbs delivering in overwhelming fashion for Biden, giving him margins that swamped Trump’s fervent support in more rural and postindustrial areas of the state.", "time": 1606697829.0}, {"subreddit": "politics", "text": ">[Trump] has kept Biden’s coronavirus task force—which the President-elect has already assembled—from fully engaging with career public-health officials and scientists in the government, many of whom Trump has sidelined and belittled. (As of last week, Dr. Anthony Fauci, whom Trump has called an “idiot and a disaster,” had not yet formally met with Biden.) “We’ve been unable to get access to the kinds of things we need to know,” Biden said on Wednesday. He mentioned the Strategic National Stockpile: it’s more difficult to make a plan for distributing supplies if no one will tell you what the government has at hand.\n\nTrump is endangering Americans' lives and health because he's too emotionally immature to admit that he lost the election.", "time": 1606610637.0}, {"subreddit": "politics", "text": "Yes. It's a garbage suit. The Republican judge at the district court trashed it and the three Republicans on the appellate panel, one of whom was nominated by Trump, trashed it. The case was thrown together and has no merit and no proof.", "time": 1606527032.0}, {"subreddit": "politics", "text": "Sadly, too many people are gullible fools.", "time": 1606526258.0}, {"subreddit": "politics", "text": ">Michael Cohen, Trump’s estranged former personal attorney who spent 15 years at Trump’s elbow, takes the same view. “It’s the difference between a bullshit artist and a sociopath,” Cohen told VICE News. “Donald Trump is a sociopath, because he does believe his own bullshit.”", "time": 1606524423.0}, {"subreddit": "politics", "text": "They wouldn't touch this festering corpse of a case. There's nothing for them to review. Their original suit was hollow and thrown together. Their appeal was equally empty. The district court judge was a Republican. The three judges on the appellate panel were all nominated by GOPers, one of whom was a Trump nominee.", "time": 1606505952.0}, {"subreddit": "politics", "text": "One of their other cases in PA state court has the GOP-controlled legislature as an opposing party saying the Trump suit is garbage.\n\nYet Trump's die-hard supporters think somehow they still have a win-from-behind chance, notwithstanding they've lost more than three dozen cases.", "time": 1606505767.0}, {"subreddit": "politics", "text": ">Look up Charles p. Mccullough\n\nHere's a link about his criminal conviction:\n\nhttps://www.post-gazette.com/news/crime-courts/2020/07/09/Superior-Court-denies-McCullough-request-for-full-panel-hearing/stories/202007090150\n\nHere is a link about his crime and his judge-wife's involvement:\n\nhttps://observer-reporter.com/opinion/editorials/a-heavy-thumb-on-the-scales-of-justice/article_db73bf4f-6ba8-58fb-918f-4b63faf3f255.html", "time": 1606345420.0}, {"subreddit": "politics", "text": "Even the Republican-controlled legislature says this suit is trash:\n\n>The Republican-controlled state Legislature responded, in legal filings, that the case should be dismissed because Act 77 didn’t alter the requirements of who constitutes a qualified voter, and that the Legislature is constitutionally authorized to prescribe the method by which those electors may cast their votes.", "time": 1606345133.0}, {"subreddit": "politics", "text": "> a retreat\n\nDing ding ding! They've been retreating since the election.", "time": 1606342517.0}, {"subreddit": "politics", "text": "This was not a hearing. It was only for Republicans and was not a legislative event. It was simply a gripe session for sore losers.", "time": 1606341000.0}, {"subreddit": "politics", "text": "It was not a real hearing so perjury would not apply. It was simply a bitch session for sore losers.", "time": 1606340960.0}, {"subreddit": "politics", "text": "> Rudy Giuliani and Jenna Ellis\n\nEach of whom is laughably clueless in his or her own special way.", "time": 1606074659.0}, {"subreddit": "politics", "text": "You need actual legal justification to argue for an appeal founded in stare decisis. \"Sore loser\" is not that justification. The Trump case at the district court was so deficient, it's difficult to imagine on what basis they would build their appeal.", "time": 1606074592.0}, {"subreddit": "politics", "text": "It's not going before Alito. They're going to the US Court of Appeals for the Third Circuit. They can't skip the appellate level and race to the Supreme Court. It doesn't work that way.", "time": 1606074410.0}, {"subreddit": "democrats", "text": "Blexit explainer:\n\nhttps://news.sky.com/story/us-election-what-is-blexit-who-are-the-blexiteers-and-what-do-they-want-12102983", "time": 1606069656.0}, {"subreddit": "politics", "text": "Both would be superb. Both have DoJ senior rank experience. Nominating Yates would make Trump's head explode, considering he fired her.", "time": 1606007485.0}, {"subreddit": "politics", "text": "This is the most important suit.\n\nThe judge just totally nailed Trump's testicles to the floor:\n\nhttps://electionlawblog.org/?p=118942", "time": 1606004084.0}, {"subreddit": "democrats", "text": "See this post for an answer to your question:\n\nhttps://www.reddit.com/r/JoeBiden/comments/jwcxk1/there_is_no_plausible_route_to_a_soft_coup/", "time": 1605833301.0}, {"subreddit": "democrats", "text": "Post the *Atlantic* link and then add your text above as the first comment. That subreddit does not have an age limit on links and that link has never been posted on Reddit before (I just checked).", "time": 1605807692.0}, {"subreddit": "democrats", "text": "You might think about posting this on r/law.", "time": 1605744762.0}, {"subreddit": "politics", "text": "Free paywall workaround:\n\nhttps://archive.is/I8BJP", "time": 1605738891.0}, {"subreddit": "politics", "text": "Trump is learning the hard way that GOP officials are not willing to commit political suicide to steal the election for him.\n\nFree paywall workaround for the article:\n\nhttps://archive.is/I8BJP", "time": 1605738855.0}, {"subreddit": "politics", "text": "Give him a rake and he can start raking the woods to prevent forest fires.", "time": 1605636576.0}, {"subreddit": "politics", "text": "Take him golfing and then just don't bring him back to the White House. Trump won't be too chuffed, however, when he realize his mile-long motorcade is gone for the rest of his life. It's strictly a two-car deal when you're an ex-President.", "time": 1605635948.0}, {"subreddit": "politics", "text": "[Two years after Trump withdrew from the Iran nuclear deal, Tehran cut in half the time it would need to produce enough weapons-grade fuel for a nuclear bomb.](https://foreignpolicy.com/2020/05/08/iran-advances-nuclear-program-withdrawal-jcpoa/)\n\nSo now Trump wants to attack Iran for a circumstance that could have been avoided had he not junked the deal in 2018.", "time": 1605573755.0}, {"subreddit": "politics", "text": "The Trump campaign had its genesis in a lie, too, with his birther garbage.", "time": 1605485255.0}], "republican_score": 0, "democrat_score": 12}