{"name": "karstens_rage", "posts": [{"subreddit": "democrats", "text": "Good fucking riddance to Betsy Devos\n", "time": 1604768996.0}, {"subreddit": "democrats", "text": "For the last four years America has not had a president.", "time": 1607147400.0}, {"subreddit": "democrats", "text": "Fund Education not War", "time": 1606889554.0}, {"subreddit": "democrats", "text": "For the last four years I referred to him as BLOTUS Biggest Liar ....", "time": 1606184184.0}, {"subreddit": "democrats", "text": "The democrats lost seats despite massive spending. I fear the worst but what *does* work?", "time": 1605800709.0}, {"subreddit": "democrats", "text": "I got no check and what the fuck do I care about that cretin donating to his “church.” Now I can tell you are just being edgy so good luck with whatever it is you are after.", "time": 1605770120.0}, {"subreddit": "democrats", "text": "Can you tell me what ideologically makes you a republican and then contrast that with what you believe Trump represents. n.b. there are a lot of republicans that do not support Trump at all (see Liberty Project)", "time": 1605769787.0}, {"subreddit": "democrats", "text": "Well I guess now we take their guns and silence/cancel anything we don’t like. I know Im forgetting something. Oh yeah I guess we make them all gay and have abortions.  That should do it.", "time": 1605419400.0}, {"subreddit": "democrats", "text": "What do you mean by better?", "time": 1605329943.0}, {"subreddit": "democrats", "text": "The constant “he’s your president” from the right really rubbed me in that we blue states knew and know he does not represent us at all. He’s definitely not a president of united anything.", "time": 1605326769.0}, {"subreddit": "politics", "text": "If there is no fraud, the election was fair and stands and BIDEN won.", "time": 1605303896.0}, {"subreddit": "democrats", "text": "When are the courts going to sanction all these obviously frivolous lawsuits?", "time": 1605235147.0}, {"subreddit": "politics", "text": "I feel the exact same way. Never felt like an American, born and bred in California and will always feel like a Californian.", "time": 1605225435.0}, {"subreddit": "democrats", "text": "Trump is not in the lead by any measures. Were you fine with it when Hillary conceded the election and Obama met with Trump 48 hours later? Or do you think the Democrats should have not accepted it until the electorate voted? Please refrain from using divisive language in your responses.", "time": 1605135738.0}, {"subreddit": "democrats", "text": "That is an unbelievably disingenuous reply. So we democrats created the hatchet (pinning the divide exclusively on the left) and we are \"taking\" the election? And you are stumped as to why its so hard to offer the olive branch to you guys?", "time": 1605134807.0}, {"subreddit": "democrats", "text": "I was making an observation about what is going on right now about accepting Biden as the rightful winner of the 2020 fair election by the GOP. There seem to be a portion of the right that the GOP is hesitant to disenfranchise by not supporting Trump and I am identifying that as a problem. \n\nFrom your post history I can see that you are on the right. Are you feeling victimized? Perhaps you should examine why that is.", "time": 1605134612.0}, {"subreddit": "democrats", "text": "I'm not implying anything. What are you assuming?", "time": 1605126232.0}, {"subreddit": "democrats", "text": "Never assume anything anymore. No matter what anyone says, vote. This will continue to escalate until we can resoundingly win every single time. They will NEVER let up, we can't either.", "time": 1605111701.0}, {"subreddit": "democrats", "text": "As individuals we should definitely try harder to start seeing each other. The problem right now is that the grip of the 71M Trump voters on the GOP means that the GOP will do nothing to go against the 71M.", "time": 1605109386.0}, {"subreddit": "politics", "text": "And Ted Cruz", "time": 1604939033.0}, {"subreddit": "democrats", "text": "I’d rather someone younger and more progressive but maybe this isn’t the time since she objectively has been working that system longer than anyone.", "time": 1604902396.0}, {"subreddit": "democrats", "text": "Wow I’m really sorry to hear that. Yes of course you are welcome. No penance necessary.", "time": 1604899107.0}, {"subreddit": "democrats", "text": "Misled how?", "time": 1604898777.0}, {"subreddit": "democrats", "text": "The 70M votes for Trump mean that we have to be very very very very careful who we nominate in the future. I'm sorry to say this but Hillary gave us Trump and we need someone that can take the country, not the particularly liberal states or liberal mindset of Reddit (which I love btw)", "time": 1604888159.0}, {"subreddit": "democrats", "text": "The problem is that you are assuming that bad things happen in urban areas that you need a gun to protect yourself. What if’s and lions and tigers and bears is not reality. Statistically hardly anything happens but all you get from news is 24/7 terror. Your what if of “someone entering your house” sounds scary but how often does that actually happen? And how do you prepare for the infinite what if’s you can imagine.", "time": 1604857847.0}, {"subreddit": "democrats", "text": "This. What else could they be doing except hiding their poisonous dangerous group think. What trump did for us is get the cockroaches to come out of the walls. We can’t let them slink back for the next more competent demagogue.", "time": 1604849143.0}, {"subreddit": "democrats", "text": "I read at the time that snow witch removed them that the gardeners saved them and stored them so they could be restored. Let’s hope that was true.", "time": 1604806797.0}, {"subreddit": "democrats", "text": "I hope the first thing she does is put Jackie’s roses back.", "time": 1604801287.0}, {"subreddit": "democrats", "text": "Hi and welcome and thank you, that’s gracious of you. In terms of understanding better could you tell me what you agree on with Trump and disagree  with Biden?", "time": 1604796707.0}, {"subreddit": "democrats", "text": "I love his ugly unmasked face and the two in front masked up.", "time": 1604783280.0}, {"subreddit": "politics", "text": "Wouldn’t he fleece taxpayers to pay though?", "time": 1604763786.0}, {"subreddit": "democrats", "text": "This is pretty scary.", "time": 1604704484.0}, {"subreddit": "democrats", "text": "I wish more people understood like this. When we say lesser of two evils we are not saying Ted Bundy vs. Jeffrey Dahmer. We are saying someone that will move the needle a bit forward rather than an idiotic demagogue that will move it 194 steps backward. \n\nThank you for your vote, its appreciated.", "time": 1604690998.0}, {"subreddit": "democrats", "text": "California is only 66% reporting so yeah", "time": 1604546660.0}, {"subreddit": "democrats", "text": "It’s already up to 71M and Nate Silver just predicted 81M final.", "time": 1604546401.0}, {"subreddit": "democrats", "text": "That sounds very stressful. Hoping things will be alright for you and your wife and your child.", "time": 1604466702.0}, {"subreddit": "democrats", "text": "Very upset and want to secede from this shit hole country. Trump is literally a cock blocker for me.", "time": 1604466429.0}, {"subreddit": "democrats", "text": "Being from California myself it’s really hard to sit through this every four years hoping the swing states do the “right thing.”", "time": 1604330700.0}, {"subreddit": "democrats", "text": "Thank you, it’s appreciated.", "time": 1604109609.0}, {"subreddit": "democrats", "text": "Thank you, its appreciated.", "time": 1604019333.0}, {"subreddit": "democrats", "text": "Thank you", "time": 1603916621.0}, {"subreddit": "democrats", "text": "Incredible that this goes on. In California where our votes don't matter, it was as simple as receiving the ballot in the mail, filling it out and dropping in an official drop box less than 1 mile from my house. Rode my bike with an N95 mask. Online check and its been received and will be counted.\n\nThank you from the deepest part of my soul for helping the country. I wish I could help more.", "time": 1603847973.0}, {"subreddit": "democrats", "text": "I'm very sorry this is so hard, its been hard on a lot of us. It might be cliche and sound glib but mindfulness has really helped me. With COVID, Trump constantly in our collective psyche and the smoke filled air of California of late, I was having a very difficult time of it. But realizing that I have a good job that was remote before all this, my family is safe, and the sky is blue once again helps to calm me down. Just be aware of yourself, breathing, your feet on the ground. Don't judge yourself for feeling stressed its normal, but breathe through it.", "time": 1603847691.0}], "republican_score": 0, "democrat_score": 39}