{"name": "zabadoh", "posts": [{"subreddit": "democrats", "text": "Rock The Runoff Virtual Benefit Concert for Fair Fight Georgia tonight 9PM EST\n", "time": 1607028982.0}, {"subreddit": "democrats", "text": "Republicans hold $28 million ad advantage in Georgia Senate runoff races\n", "time": 1606252348.0}, {"subreddit": "democrats", "text": "Pelosi formally seeks another 2 years as Speaker\n", "time": 1604900401.0}, {"subreddit": "democrats", "text": "Flip The Senate: Donate to Warnock and Ossoff\n", "time": 1604762479.0}, {"subreddit": "democrats", "text": "The Atlantic: Biden's Virtual Campaign Is a Disaster\n", "time": 1589650310.0}, {"subreddit": "democrats", "text": "Hosted by\n\n**Kerry Washington**\n\nFeaturing a solid lineup:\n\n **Monica**  \n **Ludacris and Jermaine Dupri**  \n **Michael Stipe of R.E.M.**  \n **Indigo Girls**  \n **EarthGang**  \n **John Legend**  \n **Ant Clemons and Justin Timberlake**  \n **Common**  \n **Ben Gibbard of Death Cab For Cutie**\n\nAnd a special performance from Broadway superstars:\n\n**Audra McDonald**  \n**Idina Menzel**  \n**Lin-Manuel Miranda**  \n**Billy Porter**  \n**Ben Platt**  \n**Bernadette Peters**  \n**Danielle Brooks**\n\nIt's all about getting out the vote at this point, so please invest in our ground game in Georgia.\n\nTickets $5 and up for access.", "time": 1607029110.0}, {"subreddit": "democrats", "text": "> Fair Fight - Federal\n\nI believe the cross-state version of Fair Fight is called \"Fair Fight Action\" which is organizationally different PAC from \"Fair Fight\"\n\n[https://en.wikipedia.org/wiki/Fair\\_Fight\\_Action](https://en.wikipedia.org/wiki/Fair_Fight_Action)", "time": 1606280400.0}, {"subreddit": "democrats", "text": "Oh right, as if ~~we~~ most of us don't have sales taxes at the state and county level.", "time": 1606263278.0}, {"subreddit": "democrats", "text": "Oh now that their loved ones are hit, now they believe the science...", "time": 1606072628.0}, {"subreddit": "democrats", "text": "Does someone have a link to a news article, or articles?", "time": 1605626977.0}, {"subreddit": "democrats", "text": "They live in an alternate media universe where the light of what is of general consensus to be the truth never shines.", "time": 1605416663.0}, {"subreddit": "democrats", "text": "The Public Service Commission regulates the state's monopoly utilities, \n\n[https://www.onlineathens.com/news/20201111/georgia-election-public-service-commission-seat-heads-to-runoff-along-with-high-profile-senate-race](https://www.onlineathens.com/news/20201111/georgia-election-public-service-commission-seat-heads-to-runoff-along-with-high-profile-senate-race)", "time": 1605201801.0}, {"subreddit": "democrats", "text": "Not true.\n\nThe vice president will break the tie.", "time": 1605161874.0}, {"subreddit": "democrats", "text": "Broadcast TV news was regulated by the FCC's Fairness Doctrine until 2011.\n\nThat pretty much dictated that the Big 3, then 4, TV networks give equal time to both sides.\n\nNever mind 3rd parties with some good points like the Greens and Libertarians, but I digress.\n\nBut the Fairness Doctrine didn't regulate talk radio, nor cable TV news networks, nor social media networks.\n\nI think Fox should be prosecuted for labeling themselves as \"news\" when clearly their most important programming is more opinion or editorial, or just plain nonsense like Sean Hannity or Glenn Beck", "time": 1604901774.0}, {"subreddit": "democrats", "text": "Oh wow, I thought that was photoshopped in. \n\n[It's real!](https://globalnews.ca/news/7440056/white-house-wall-donald-trump/)", "time": 1604901028.0}, {"subreddit": "democrats", "text": "Thank you for telling me about Stacey Abrams' Fairfight!\n\n$100 donated!", "time": 1604900694.0}, {"subreddit": "democrats", "text": "Good for her, it's just a formality, I'm sure.\n\nDoes this mean she's still going to retire from the House in 2022?", "time": 1604900529.0}, {"subreddit": "democrats", "text": "I sense a misunderstanding here...", "time": 1604797501.0}, {"subreddit": "democrats", "text": "By “Bible” you mean DeVos’ wallet from her ownership of charter schools.\n\nThose same charter schools that benefited directly from her taking away funds from public schools and giving those funds to charter schools that she owns.", "time": 1604797033.0}, {"subreddit": "democrats", "text": "We still have a chance to make a real difference in Washington for the next two years by dumping Mitch McConnell as Senate Majority Leader.\n\nAs Majority Leader, McConnell has \n\n-\tSlowed the recovery for the Great Recession back in 2008 as part of his stated goal to “make Obama a one term President”\n-\tBlocked an election security package that was needed after 2016 until January 2020, and then only passed $250 million of $600 million passed by the House, hence “Moscow” Mitch\n-\tBlocked Obama’s Supreme Court nominee Merrick Garland\n-\tRushed through 300 conservative Federal judges and Amy Coney Barrett\n-\tBlocked the second vital COVID19 financial relief package for all Americans\n\nAmong many other acts against the national interest.\n\nIt is vital for Democrats to take control of the Senate agenda.\n\nBut we can only do that if BOTH Democrats win of Georgia’s Senate runoff elections on January 5th.\n\nThat’s only 2 months from now, so early donations will have the largest impact on both races.", "time": 1604763908.0}, {"subreddit": "democrats", "text": "\"Law and order\"\n\nRighty-o.", "time": 1604730114.0}, {"subreddit": "democrats", "text": "Donated before I saw this.\n\nDon't forget to give to Warnock too.  [https://secure.actblue.com/donate/warnock-for-georgia-1](https://secure.actblue.com/donate/warnock-for-georgia-1)\n\nWe'll need both of them to ditch Mitch!", "time": 1604729815.0}, {"subreddit": "democrats", "text": "Nobody really expected Trump to win in 2016, so the Democratic leadership thought they'd have time to replace RBG + Scalia, fix the loopholes in Obamacare, etc.", "time": 1603818099.0}], "republican_score": 0, "democrat_score": 23}