{"name": "gerroff", "posts": [{"subreddit": "democrats", "text": "You won't see McConnell on the ballot in Georgia, but... he's there.\n", "time": 1607087319.0}, {"subreddit": "democrats", "text": "In this preview of The Simpson’s 31st season premiere, we see Homer Simpson in a voting booth deciding on which presidential candidate to vote for. It airs this coming Sunday.\n", "time": 1602663749.0}, {"subreddit": "democrats", "text": "Seems like Trump is so sick he can't make it up his long set of stairs to wave and lose umbrellas. This appears to me to be the cargo stairs on Air Force One.\n", "time": 1602636924.0}, {"subreddit": "politics", "text": "This politician may have just saved your U.S. city. ~Or~ How a politician is supposed to do.\n", "time": 1584101412.0}, {"subreddit": "democrats", "text": "Plot twist, Trump is so horrible anybody could have done this.     \n~Dim Dems, to point out how horrible his supporters are supposed to be for a racist president.     \n~Reptile Repubs, to be horrible supporters of a racist president.      \n~Asshole anarchists, because they just want the world to burn.", "time": 1604511299.0}, {"subreddit": "democrats", "text": "I feel it may be some of that and also a LOT of Americans are wishing Covid was over. Biden still wants to try to save the hundreds and possibly millions who will end up crippled for life or dead.\n\nPeople are basically selfish assholes in general and will vote for cretins if they will allow an easy out for individuals.", "time": 1604489435.0}, {"subreddit": "democrats", "text": "... on those other guys!", "time": 1604004740.0}, {"subreddit": "democrats", "text": "It is probably too late to mail in your ballot and KNOW it will be there on time with Trumps destruction of our mail system. \n\nThe early vote registrar will usually take a mail in ballot at their drop box OR let you do early voting on a machine that will tabulate at 7am on Nov 3rd. It is hard for Trump to complain about the machines too.", "time": 1603636396.0}], "republican_score": 0, "democrat_score": 7}