{"name": "googlebah", "posts": [{"subreddit": "democrats", "text": "Thank god reddit wasn’t on the list", "time": 1607112292.0}, {"subreddit": "democrats", "text": "Off to Florida", "time": 1606335210.0}, {"subreddit": "politics", "text": "Cooperations should be immune, IF they are giving their employees PPE, IF they are exercising all options to work from home, IF they are socially distancing offices and work environs, IF they are screening vendors and employees each day and IF they have a plan to payout potentially exposed or positive employees.  If employers agree to all that then let them be immune from further persecution. This is a compromise", "time": 1606318892.0}, {"subreddit": "democrats", "text": "I want to break you down...  brick by brick!", "time": 1605803438.0}, {"subreddit": "democrats", "text": "Trump absolutely shits his pants", "time": 1605738780.0}, {"subreddit": "democrats", "text": "Onfly $400,000 in PROFIT gets taxed. If your landlord or a small business is making $400,000 profit after all expenses, they are doing pretty damn well!!!", "time": 1605007899.0}, {"subreddit": "democrats", "text": " Just when you think this can’t get dumber, Virginia doesn’t have potato farms", "time": 1589934287.0}, {"subreddit": "politics", "text": "If trump really thought it was a hoax why would he declare a national emergency and deploy the Defense Production Act then hold all the Press  Conferences covering it?", "time": 1589750775.0}, {"subreddit": "politics", "text": "Democrats can’t rally either??", "time": 1589744272.0}, {"subreddit": "democrats", "text": "Democrats don’t want to take guns away from anyone. They aren’t going to go house to house demanding you give up firearms. This is how the right has twisted it. Democrats want to regulate the flow of who can get guns and what guns people will be able to get. That’s all.", "time": 1588780018.0}, {"subreddit": "democrats", "text": "You can’t compare those anyway it’s easier to let everyone vote my mail and avoid coming in compare to making order groceries. People can’t do they but they can all participate in mail voting", "time": 1588388861.0}, {"subreddit": "democrats", "text": "He said he has been against beaches for years?", "time": 1588367574.0}, {"subreddit": "democrats", "text": "That’s also how many deaths the flu does in an entire year... and we were quarantined", "time": 1588198175.0}, {"subreddit": "democrats", "text": "And if you get tested once it’s not ok no more testing for you. People will need multiple tests! You could catch the virus 5 minutes after taking the test", "time": 1588084408.0}, {"subreddit": "democrats", "text": "Damn calling out Illinois like that. We’re getting better!! Prob cuz gov JB’ calling trump out.", "time": 1588017737.0}, {"subreddit": "politics", "text": "Trump has probably been asking if he could ban Incoming flights from China and Europe every week since he took office. Now when he asked it was the beginning of a pandemic and he finally could", "time": 1587486277.0}, {"subreddit": "politics", "text": "What freedom are they fighting for? Freedom of what? To choose between McDonalds or Wendy’s? What about the liberty of being guaranteed a roof above your head, food on your table and education for your children. Things Republicans pucker up about when they hear it could cost them a little bit of tax money.", "time": 1587416174.0}, {"subreddit": "democrats", "text": "What will help us a lot if rallying up friends and family to go vote. Encourage it as much as you can. A week before the election post on FB to remind people to check they are registered to vote!", "time": 1587270795.0}, {"subreddit": "politics", "text": " They are holding this conference in front of a hospital the Army Corps of beginners built in FIVE DAYS preparing for a potential outbreak in Chicago. As an IL resident I am finally able to be proud of a governor!", "time": 1586016483.0}, {"subreddit": "politics", "text": "The only flaw I see in your logic is thinking that $15 an hour is a lot of money.", "time": 1585835003.0}, {"subreddit": "politics", "text": "People are throwing a fit at the thought of amazon workers, Food or retail workers making over $12 saying they “don’t deserve it”\n\nMeanwhile no one concerned with Bezos making over a  million an hour?  You think he is working 100,000x harder than the next guy? \n\n\nThey should change the 10x rule to the 100,000x rule.", "time": 1585829917.0}], "republican_score": 0, "democrat_score": 13}