{"name": "alsoaprettybigdeal", "posts": [{"subreddit": "democrats", "text": "Wait...what?? I didn't hear that. What does that mean??", "time": 1607073782.0}, {"subreddit": "politics", "text": "I seriously thought this was an SNL sketch at first. Then I saw Giuliani and was like *why is Giuliani doing SNL?* \n\nThen it hit me, \n*OMG...THIS. IS. REAL.* \n🤦🏼‍♀️", "time": 1607013743.0}, {"subreddit": "democrats", "text": "I’m not even kidding when I tell you that I thought this testimony was an SNL sketch when I fist started watching the video of the blonde chick talking about pill books until I saw real Giuliani there with her. And even he was like, “whoa whoa whoa.... easy does it.”  \n\nAbsolutely fucking bonkers.\n\nI’d also like to add: I worked for the elections as an E-pollbook Election Judge this year. Not everyone has to have an “ID” (driver’s license) but we can verify a persons Identification in a whole host of other ways. We conduct what’s called Minimum Matching Criteria. A voter can bring one of any items from a list of about 20 or so items with which we can verify their ID. When I look up a voter I match their first, middle, last names, date of birth, address, last 4 of ss#, etc. Lots of other forms of ID are acceptable- pilots license, higher education student ID, birth certificate, passport, etc. \n\nIf you’re a registered voter all that information in the Epoll book system has already been verified and if you’re not in there and you want to register you can bring an acceptable form of ID and a current bill statement (like your water bill) from your current address and we can use that. \n\nThe idea that ANYONE can walk in and vote without ANY confirmation of their Identification is 100% FALSE!! \n\nIf you’d like to learn more then offer to work for the elections (for pay!! I made $17.49/hr) and you’ll learn all the ins and outs of how the system works. It was very eye opening!", "time": 1607010310.0}, {"subreddit": "politics", "text": "Try this. It’s titled *What Happened*?\n\nhttps://www.stitcher.com/s?eid=79745011&autoplay=1", "time": 1606781697.0}, {"subreddit": "politics", "text": "I just listened to the latest episode of The Asset podcast and they talked about this. Basically Krebs did an end run bypassing Congress and fuckface McConnell and had trump sign an order to do some cyber security stuff that essentially gave him pretty wide latitude to implement a lot of countermeasures to deter an outside attack and beef up our election systems without having to go through Congress. He also separately was running an NSA ...DHS(?) website that basically identified and debunked all the of disinfo that trump was constantly spewing, which is part of the reason he was fired because trump found out about it (which I find to be kind of hilarious).  \n\nObviously the podcast goes into a lot more detail but that’s the gist. I’d like to shake Krebs’ hand and buy him a beer. That was a pretty masterful play he executed, and it WORKED!", "time": 1606772990.0}, {"subreddit": "politics", "text": "Breaking: trump has tweet fired his NATO ambassador. \n\n(Note: this is a joke....for now).", "time": 1606771025.0}, {"subreddit": "politics", "text": "I feel like the US government has its ways of dealing with those who would sell our country’s deepest secrets. I can’t imagine that they’re not going to be keeping a very very close eye on where he goes and who he talks to.", "time": 1606641704.0}, {"subreddit": "politics", "text": "It’s gotta’ be Fauci.", "time": 1606641129.0}, {"subreddit": "democrats", "text": "They’re only staying silent because they want to control the Senate. They know trump is a POS, but they want to be able to sabotage Biden, which should tell you what kind of people they are. This has nothing to do with what’s right/good for Americans/ Georgians/ AMERICA, it’s only about control.", "time": 1606636745.0}], "republican_score": 0, "democrat_score": 3}