{"name": "PuffyPanda200", "posts": [{"subreddit": "democrats", "text": "A look at presidential elections past\n", "time": 1605482900.0}, {"subreddit": "democrats", "text": "Man Gets Schooled By Anti-Fascism Sign\n", "time": 1525324454.0}, {"subreddit": "politics", "text": "I am fairly confident that they do this so that he can be introduced as \"NYT Best Selling Author Donald Trump Jr\". SO I looked up what it takes to get on the NYT best seller list. This source:\n\nhttps://scribemedia.com/get-best-seller-list/#:~:text=You%20must%20be%20through%20a,recommend%2010%2C000%20to%20be%20sure.\n\nclaims that it only takes 5,000 to 10,000 book sales in a week to get on. At 20 ducks a book that's 100k to 200k, I guess the RNC is buying the book for 30 bucks a pop. \n\nAs a side not this seems like a really low barrier to adding a title that is, at least intended, to command respect: \"Best Selling Author\". The NYT should really change the criteria that the sales be to 20k different people from at least 5 different states and that the books be sold through a vendor not in a batch sale.", "time": 1607116044.0}, {"subreddit": "politics", "text": "My SO is a nurse at a nursing home that had COVID and worked the COVID unit. There were a number of patients that had COVID but would test negative repeatedly. A negative test doesn't rule out COVID.", "time": 1607035557.0}, {"subreddit": "democrats", "text": "IMO this is all an attempt to split off the Rs vs Trump divide that Trump has been driving the last few weeks. \n\nThe people around Trump know the obvious falsehoods of his statements but by drumming up a \"the Senate Rs won't help me thus they are traitors\" narrative is an attempt to separate the Trumpian base and The R base. Trump knows that most 1 term presidents kinda fade into obscurity (Carter, Bush Sr) but the entire point of the Trump presidency was to lift his public image, not fade into obscurity. \n\nIf you pop over to the conservative sub you can find comments like [this](https://np.reddit.com/r/Conservative/comments/k5waxq/trump_escalates_attacks_on_fellow_republicans/gehpbzg/) that are on the Trumpian side instead of the Republican side.", "time": 1607031648.0}, {"subreddit": "democrats", "text": "IMO this is all an attempt to split off the Rs vs Trump divide that Trump has been driving the last few weeks. \n\nThe people around Trump know the obvious falsehoods of his statements but by drumming up a \"the Senate Rs won't help me thus they are traitors\" narrative is an attempt to separate the Trumpian base and The R base. Trump knows that most 1 term presidents kinda fade into obscurity (Carter, Bush Sr) but the entire point of the Trump presidency was to lift his public image, not fade into obscurity. \n\nIf you pop over to http://np.reddit.com/r/conservative you can find comments like [this](https://old.reddit.com/r/Conservative/comments/k5waxq/trump_escalates_attacks_on_fellow_republicans/gehpbzg/) that are on the Trumpian side instead of the Republican side.", "time": 1607031471.0}, {"subreddit": "politics", "text": "fairfight is the Stacy Abrams run group that focuses on voter registration, if you are reading the above comment consider donating to them. Registering voters also helps for future races, the Warnock/Loffler seat will be up again in 2022 because it was last voted on in 2016 (I think my math is right on this one).", "time": 1607021197.0}, {"subreddit": "politics", "text": "https://fairfight.com/ is the Stacy Abrams run group that focuses on voter registration, if you are reading the above comment consider donating to them. Registering voters also helps for future races, the Warnock/Loffler seat will be up again in 2022 because it was last voted on in 2016 (I think my math is right on this one).", "time": 1607021138.0}, {"subreddit": "politics", "text": "It would be so funny if someone started advocating for a federal law that federal taxes could only be spent in each state proportionally to the taxes collected. I am fairly confident that this would play well to the \"grass roots\" conservative movements but they wouldn't realize that it would destroy poor red state's economies.", "time": 1606937703.0}, {"subreddit": "politics", "text": "In the 1st found of voting Le Pen had 34% of the vote. The other traditional parties had 20% of the vote each. The FI was .42% short of 20%. If you gave the FI votes to the other parties it would be unlikely that FN (Le Pen) would drop to 3rd place. A transferable vote would still have Macron winning with FN in 2nd. \n\nLe Pen was the 2nd most popular candidate for the French in 2017.\n\nhttps://en.wikipedia.org/wiki/2017_French_presidential_election", "time": 1606935981.0}, {"subreddit": "politics", "text": "I don't think that the '17 French election would be a good election for showing the failures of the Jungle Primary system. If a transferable vote had been used I doubt that the ~20% that went to the center left and center right parties would have transferred to either other \"traditional party\" candidate in high enough percentages to overcome Le Pen's ~33%. Macron would have won anyway regardless. \n\nI personally prefer the jungle primary system to a transferable vote as the jungle primary allows each run off candidate to make a case against the other candidate, as opposed to a field. Most voters are very low information so a run off serves to provide clarity and contrast between candidates. I also see it as unlikely that a 3rd place candidate would win in a transferable vote system although it is possible.", "time": 1606934766.0}, {"subreddit": "politics", "text": "Yes, both WA and CA do this so it isn't that strange to me. This is also how the French run their presidential elections. \n\nIt isn't uncommon for incumbent Ds to end up running off against other D candidates in the runoff election. This happened to both Feinstein and Pelosi the last time they were up for re-election. I am actually kinda surprised that this hasn't had a more moderating effect on the Rs of CA though.", "time": 1606930953.0}, {"subreddit": "politics", "text": "CA has jungle primaries (everybody runs 1st and then the top two run off). It is viable to run as a moderate R in OC but the Ds have made a lot of gains there in the last 4 years.", "time": 1606930129.0}, {"subreddit": "politics", "text": "Yea, I understand the desire to not be complacent but this idea that Rs have more consistent turnout than Ds is not so clear cut. \n\nThe 2004 Presidential election for Rs was the highest popular vote obtained until 2016. 2020 was by far much higher in R popular vote than any year previously. If R voters were very consistent in their turnout you should see R voting totals be consistent, they aren't.", "time": 1606848288.0}, {"subreddit": "democrats", "text": "The D house should conduct business for the next two years in exactly this manner (assuming Rs maintain control of the senate): Send the budget to the Senate with all the progressive policies you want. They can negotiate if they want but this may be in bad faith by the Rs. If negotiations are in bad faith go to their constituencies and talk up the benefits of their budget. If the Senate breaks nail them for not working, if the senate votes on other things nail them for focusing on dumb stuff. Budget bills are required to originate in the house.", "time": 1606326932.0}, {"subreddit": "politics", "text": "And to be clear: married a guy 16 years her elder only a few years after getting her MBA to obtain said 500 mil. Not that we should glorify self made wealth but she's literally a gold digger.", "time": 1606324565.0}, {"subreddit": "politics", "text": "Previous to Donald Trump the Rs could not obtain more than 62 million popular votes in presidential elections. 62 mill was in 2004. \n\nDonald Trump garnered 63, and then 73 (probably) million votes. A bunch of Donald Trump voters did not turn out for Bush, McCain or Romney. If those voters that previously didn't turn out don't turn out on Jan 5th and the Ds that voted for Abrahams in 2018 and Biden in 2020 do then Warnock and Ossoff have a really good shot. \n\nWe can only control how much D leaning areas are register through groups like fair fight.", "time": 1606171472.0}, {"subreddit": "democrats", "text": "[Parlez vous francais?](https://www.youtube.com/watch?v=ayiHyVR4DXY)\n\nOr pirate for \"to negotiate\".", "time": 1606164257.0}, {"subreddit": "politics", "text": "From 1968 to 1988 Ds only one 1 presidential election out of 6. After that no incoming R presidential candidate has won the popular vote. The country is changing, its just really hard to see from where we sit.", "time": 1606164005.0}, {"subreddit": "politics", "text": "She is married to a guy who is 16 years her elder and they were married in 04, at 33 and 49. She finished her MBA in 99 and the guy she married is exceptionally wealthy. I can't imagine why rural, poor Georgians would vote for her (other than racism).", "time": 1605807144.0}, {"subreddit": "politics", "text": "There are currently only 8,400 us troops in A-stan according to the [wiki](https://en.wikipedia.org/wiki/Withdrawal_of_U.S._troops_from_Afghanistan)\n\nThere are 160,000 us troops deployed *overseas according to the [wiki](https://en.wikipedia.org/wiki/United_States_military_deployments) not including A-stan, Iraq and Syria.\n\n*overseas may be anywhere that is not the continental US. Alaska and Hawaii are not listed under US. \n\nThe top countries with the most US troops are Japan: 53k, Germany: 34k, and South Korea: 26k. While I am all for cutting back on the US being the \"world police\" there are relatively few US troops in A-stan and a lot of US troops in places that really can take care of their own security.", "time": 1605743893.0}, {"subreddit": "politics", "text": "Rigging a single state wide election in the US is very difficult for the main reason that counties run their elections although the SOC oversees it. \n\nThe best way to change an election result is to \"flip\" votes from one candidate to another. Adding or subtracting votes is not a good idea as the total number of votes will be off. For the SOC office to flip D votes they would have to go through the D controlled county elections officials in democratic dominated urban counties. Doing this would be very difficult with a high chance of discovery. Reversing all of the above is also true. Flipping the minority votes is more risky as you need to do it in more counties to have the same effect.", "time": 1605734379.0}, {"subreddit": "politics", "text": "Harvard has a 40b+ dollar endowment that they don't get taxed on the gains from because they are a \"non-profit\"\n\nIf in ~400 years I had made an average of 100 million a year I would not be running a non-profit. I would also guess that the majority of that endowment was \"obtained\" (earned?) in the last 100 years. \n\nhttps://www.google.com/search?q=harvard+endowment&rlz=1CAHKDC_enUS788US789&oq=harverd+endowment&aqs=chrome.1.69i57j0l7.7130j1j1&sourceid=chrome&ie=UTF-8", "time": 1605714750.0}, {"subreddit": "politics", "text": "The R party must attract individuals that simultaneously claim to be pro life and pro gun with a strait face. They are very limited in the people who are willing to display and defend this kind of double think.", "time": 1605663455.0}, {"subreddit": "politics", "text": "Both Missoula and Bozeman have big hospitals. I have heard that medical specialists are well paid because they have issues finding people.", "time": 1605647437.0}, {"subreddit": "politics", "text": "Not only is Perdue in this weird catch 22 you described but he is also fundamentally unequipped to deal with the issue. \n\nHe is a management executive that bounced around various consumer based companies. The companies he had a hand in managing included consumer brand goods (Sara Lee Corporation), sporting goods (Reebok), textile companies (PillowTex), and Dollar General (this one was before being a Senator). The guy has probably little to no knowledge of any of these industries and is only a management executive. He's not inspiring or in any way interesting.", "time": 1605643324.0}, {"subreddit": "politics", "text": "https://en.wikipedia.org/wiki/Empty_chair_debating\n\nThis is a thing^", "time": 1605642747.0}, {"subreddit": "politics", "text": "I moved from Bozeman to the Bay Area. I just bought a place in the Bay Area so I may be a little bit used to high house prices.", "time": 1605635212.0}], "republican_score": 0, "democrat_score": 6}