{"name": "Blabulus", "posts": [{"subreddit": "democrats", "text": "Ella Fitzgerald - Blue Skies\n", "time": 1604789560.0}, {"subreddit": "democrats", "text": "If I Had a Hammer - Peter, Paul & Mary (1962)\n", "time": 1578097504.0}, {"subreddit": "democrats", "text": "Such a perfect use of this great old meme!", "time": 1607081987.0}, {"subreddit": "democrats", "text": "If they would get off facebook and go to parler at least some people's grandparents might eventually come un-brainwashed again...", "time": 1607081797.0}, {"subreddit": "democrats", "text": "Did the widdle babies have a temper tantwum  and tear things down because they didnt get what they wanted??", "time": 1605445021.0}, {"subreddit": "democrats", "text": "They never learned any history and dont realize that the democrats were the conservative party and the republicans were the liberals at that time, there were also \"republicans\" in ancient Rome who also had nothing to do with their current political party - its just a name, trumptards.", "time": 1605442617.0}, {"subreddit": "democrats", "text": "Now that's something we Can be proud of!", "time": 1605302134.0}, {"subreddit": "democrats", "text": "Because she's paid to say that.", "time": 1605180508.0}, {"subreddit": "democrats", "text": "They just want to be on the side thats winning...", "time": 1605180434.0}, {"subreddit": "democrats", "text": "Once their appointment is confirmed, Justices must often reflect over time that their reputations and careers are going to outlast many administrations and that they dont really owe as many favors as they may have led some to believe they were making in the confirmation process - after all, they cant un-appoint them later if they dont rule the way they said they would.", "time": 1604917288.0}, {"subreddit": "democrats", "text": "Why all the desperation - did Lindsay vow to throw himself into trump's funeral pyre like a loyal concubine if he loses?", "time": 1604916481.0}], "republican_score": 0, "democrat_score": 11}