{"name": "Hot-Bat-4537", "posts": [{"subreddit": "republicans", "text": "Exactly.", "time": 1607133154.0}, {"subreddit": "republicans", "text": "No, we hate it when someone asks us why we believe trustworthy news sources instead of the Fake News media that spent four years screaming \"Russia! Russia! Russia!\" and then claims that there was no Voter Fraud in this election. You don't research the truth, you push False Narratives and denounce anything that doesn't fit into the narrative as \"nonsense with no pretenses or evidence\". \"Fact checking\" is nothing but disinformation meant to make Biden's prematurely declared \"victory\" look legit.", "time": 1607132081.0}, {"subreddit": "republicans", "text": "State Legislatures are the ones who determine the Electors, not the courts.", "time": 1607051330.0}, {"subreddit": "republicans", "text": "I watched the Election and they did stop the vote count when Trump had the lead, giving the Democrats enough time to stuff the ballot boxes. As for the poll watchers, Republican ones were either thrown out or denied entry and the few that were allowed were kept at a distance that made it extremely difficult to see the ballot. Calling Arizona early screams that Fox is in cahoots with Fake News media sources in ensuring a Biden \"victory\". The fact that Trump won 81% of those counties only proves that the Democrats were rigging the election because there's no way that Biden could legitimately overcome that kind of deficit. Also, all AG Barr did was show his true colors.", "time": 1606939384.0}, {"subreddit": "republicans", "text": "Simple: count every legit vote, restrict Mail-In Balloting to people who actually needed it, don't use software provided by Dominion, don't call Arizona early, don't allow Poll Workers to kick out or deny entry to Poll Watchers, don't board up the windows, don't allow USB drives in Polling Places, and don't stop the vote count when Trump had the lead.", "time": 1606859534.0}, {"subreddit": "republicans", "text": "The problem is that the Left claims that there is no proof of Voter fraud, despite spending Trump's First Term screaming \"Russia Russia Russia\".", "time": 1606855061.0}, {"subreddit": "republicans", "text": "OAN, Newsmax, Project Veritas, Front Page, and Sky News Australia.", "time": 1606848982.0}, {"subreddit": "republicans", "text": "No. Reuters and Forbes are just as willing to get their hands in the cookie jar as CNN and MSM.", "time": 1606843610.0}, {"subreddit": "republicans", "text": "Neutral and Unbiased? Considering that you're a Leftist, I can safely assume that you mean Fake News sites.", "time": 1606800391.0}, {"subreddit": "republicans", "text": "Claiming that the men with the fake ballots in their car are Trump supporters is the most blatant lie I have ever heard, the fact that the postal worker was driving to the Canadian border with ballots in his van screams that he was doing something illegal, Trump votes were found in the trash, a Postal Worker in Kansas City was caught dumping ballots on camera, 800,000 Biden votes were \"found\" in a state where Trump had the lead at 3 AM, there is a video of poll workers who stayed and continued working in Fulton after the Poll Watchers and Poll Challengers were evacuated due to a \"burst pipe\", a Poll watcher testified that there were USB uploads to voting machines, Sharpiegate has been confirmed, and a \"glitch\" doesn't change 600,000 votes from Trump to Biden, especially when the software that supposedly \"glitched\" is provided by a company that is owned by the Clinton Foundation, has Nancy Pelosi as majority shareholder, and has an anti-Trump CEO who has an ANTIFA training camp on his property.", "time": 1606797854.0}, {"subreddit": "republicans", "text": "No. A network betraying its viewers is bad because it causes those viewers to leave in droves. In the case of Fox, it betrayed its viewers by abandoning its principles. What are you talking about? Under Obama, we had the slowest economic recovery since the Great Depression. Under Trump, we had rapid economic growth. You're the one who's lying, just like how you've been lying about fraud. It is not over. Trump is not leaving, as he is the only politician willing to stand up to China and North Korea. Trump earned the Nobel Peace Prize, considering that he negotiated historic Middle East peace deals. Cult? Last time I checked, Trump supporters are not the ones who've adopted crazy ideologies like Cancel Culture and Identity Politics. Fools? News flash! Most people who voted for Biden wouldn't have voted for him if they knew about his policies or the Hunter Biden scandal.", "time": 1606796307.0}, {"subreddit": "republicans", "text": "RINOs are not real Republicans and Fox News betrayed its viewers by siding with the Democrats. The Republicans that want to exorcise Trump supporters from the GOP? They are the ones who are going to be voted out come the primaries. Black eye? Trump oversaw the greatest economic recovery in American history and got nominated for the Noble Peace Prize three times. Cult? Last time I checked, Trump supporters are not the ones pushing insane ideologies like Critical Race Theory.", "time": 1606788846.0}, {"subreddit": "republicans", "text": "Bloomberg, like CNN, MSM, and the backstabbers at Fox News, are Fake News. They have a vested interest in making Biden's fraudulent and prematurely declared \"victory\" look legit.", "time": 1606787571.0}, {"subreddit": "republicans", "text": "Right, like I'm going to believe a news site owned by Michael Bloomberg, the king of Fake News.", "time": 1606785414.0}, {"subreddit": "republicans", "text": "You see, this is why people are fed up with hearing about Covid. Leftists like you hyped up Covid as Spanish Flu 2.0 and the Second Coming of The Black Death, creating unnecessary panic and causing toilet paper shortages.", "time": 1606690982.0}, {"subreddit": "republicans", "text": "Logic and reason? The Left is Cancel Culture and Identity Politics. Safe Spaces and Fake News.", "time": 1606679996.0}, {"subreddit": "republicans", "text": "Have you considered having common sense?", "time": 1606660903.0}, {"subreddit": "republicans", "text": "Courts where the judges are RINOs and corrupt Judges.", "time": 1606659858.0}, {"subreddit": "republicans", "text": "Facts= Things that are real and have been proven to happen.", "time": 1606658946.0}, {"subreddit": "republicans", "text": "Again, if a boxer goes against the heavy weight champ, makes some blatantly illegal moves, and is prematurely declared the winner by the referee, then it is an illegitimate win. You want data? Trump votes in Michigan were flipped to Biden, eight hundred thousand votes were found in Wisconsin, a social worker was arrested for multiple counts of voter fraud, two armed men were arrested for having boxes of fake ballots in their car, a postal worker was arrested for heading to the Canadian border with a van full of ballots, a postal worker in Kansas City was caught dumping ballots on camera, the CEO of Dominion (who is anti-Trump and has an ANTIFA training camp on company property) released a \"software update\" a week before the election, and there are plenty of Affidavits.", "time": 1606656331.0}, {"subreddit": "republicans", "text": "The photos of kids in cages were made during the Obama Administration, the President can't create a panic, and the Democrats have been trying to get Trump out of office since he got Inaugurated (the Mueller Investigation found no evidence of Russian Collusion and impeaching him for a routine call to the Ukraine didn't work).", "time": 1606654968.0}, {"subreddit": "republicans", "text": "Only three of those sources are fake News, you misspelled Newsmax, and according to ABC, the report of bounties was uncorroborated. That \"bone spur baby\" got nominated for a Nobel Peace Prize three times because of his historic peace deals. I do not want America to get into another war and I, for one, support pulling our troops out of the Middle East at this point.", "time": 1606624881.0}, {"subreddit": "republicans", "text": "If you were a patriot, you would not try to shame me for supporting the man who didn't send more of our boys to die in the Middle East. If you were a patriot, you would be supporting the man who took out Solemani while he was in route to plan the deaths of more Americans. If you were a patriot, you would not falsely accuse the president of being okay with bounties that were allegedly placed on US soldiers (the report that Russia placed bounties on the heads of US troops is uncorroborated).", "time": 1606623497.0}, {"subreddit": "republicans", "text": "I am called 'em as I see 'em.", "time": 1606600222.0}, {"subreddit": "republicans", "text": "Says the thin skinned pinko parrot.", "time": 1606598963.0}, {"subreddit": "republicans", "text": "Trump promised to improve border security and he improved border security. Trump promised to improve the economy and he oversaw the greatest economic recovery in history. Trump rebuilt the military and brought back NASA. Trump accomplished more in four years than Biden did in Forty-Seven. That's promises kept.", "time": 1606598167.0}, {"subreddit": "republicans", "text": "Donald Trump is not a scam artist. He got The Wall built, got us out of WHO and the Paris Agreement, and oversaw the greatest economic recovery in history.", "time": 1606596996.0}, {"subreddit": "republicans", "text": "Nope. He's got three Aces (Clarence Thomas, Kavanaugh, and Giuliani) and a Queen kicker (Amy Coney Barret). All Biden has is a pair of Jokers (Don Lemon and Chris Wallace), a Queen (Pelosi), and a four (The Squad). Also, Trump did not get his ass handed to him. If a referee declares a cheater the winner of a match with the heavyweight champ before the bell rings, then it is an illegitimate win.    \n\n#", "time": 1606594422.0}, {"subreddit": "republicans", "text": "Nope. It's always lying with you thin skinned pinkos.", "time": 1606594144.0}, {"subreddit": "republicans", "text": "It's a scam site.", "time": 1606593800.0}, {"subreddit": "republicans", "text": "We place America First. You support a demented pervert who made illict deals through his son Hunter and said \"if you don't vote for me, you ain't black\".", "time": 1606593588.0}, {"subreddit": "republicans", "text": "It is full of patriots, not parrots.", "time": 1606593357.0}, {"subreddit": "republicans", "text": "Trump is playing Poker while the Democrats are trying to count cards.", "time": 1606593282.0}, {"subreddit": "republicans", "text": "This is r/Republican, not r/Democrat.", "time": 1606593215.0}, {"subreddit": "republicans", "text": "Yeah, schools have no right to interrogate people, let alone for something as American as Thanksgiving.", "time": 1606509053.0}, {"subreddit": "republicans", "text": ":(", "time": 1606361460.0}, {"subreddit": "republicans", "text": "Really? You expect the man who made illicit deals with China through his son and called Trump's travel ban \"xenophobic\" to not be soft on China?", "time": 1606353356.0}, {"subreddit": "republicans", "text": "I've changed my mind.", "time": 1606094433.0}, {"subreddit": "republicans", "text": "Or partying in the streets. Or Cuomo's brother.", "time": 1606016972.0}, {"subreddit": "republicans", "text": "Patriotic duty? There is nothing patriotic about demanding that people wear a mask in the safety of their own homes or be tested for Covid before heading to family gatherings. Such orders are draconian and unconstitutional and frankly, people are sick and tired of hearing about Covid.", "time": 1605983405.0}, {"subreddit": "republicans", "text": "5% is a more reasonable interest rate.", "time": 1605939569.0}, {"subreddit": "republicans", "text": "Says the guy who supports BLM and ANTIFA.", "time": 1605843921.0}, {"subreddit": "republicans", "text": "The Media does not decide the results of the election and there are plenty of Affidavits that say that there is election fraud, not to mention that Dominion, the company that owns and runs the software for the machines, is connected to high ranking Democrats, a social worker in Pennsylvania was arrested on multiple accounts of Voter Fraud, two armed men were arrested with boxes of fake ballots in their car, and there were thousands of Trump votes found in the trash or in plastic bags. Also, there is a difference between being diplomatic and congratulating the demented crook who will ruin the economy and destroy our energy independence if allowed into office on a prematurely declared victory.", "time": 1605812990.0}, {"subreddit": "republicans", "text": "George W. Bush is dead to me, just like Mitt Romney and Fox News. My parents voted for him. I supported him and even considered him my hero. And how does he repay us? By stabbing us in the back by congratulating Biden on his \"victory\". A \"victory\" that has not been verified. A \"victory\" that is not legit.", "time": 1605811753.0}, {"subreddit": "republicans", "text": "Already filled out the form.", "time": 1605811293.0}, {"subreddit": "republicans", "text": "I think he would make a better VP than a President.", "time": 1605585738.0}, {"subreddit": "republicans", "text": "I would vote for him.", "time": 1605585126.0}], "republican_score": 47, "democrat_score": 0}