{"name": "DZP", "posts": [{"subreddit": "republicans", "text": "True.\n\nAnd I have some issues to vent. I collect math and also chemistry textbooks, and I find that in recent years the big textbook companies have injected political correctness in science and math. They can't just teach chemistry, it has to include greenness and gender equality, as witness its headings. A math book has  social justice-related problem sets. wtf.\n\nAnd some idiot woman (professor) claimed that math is racist because it represents the Western white privilege mindset. So education must be changed to suit her.", "time": 1607124452.0}, {"subreddit": "republicans", "text": "Anyone installed during the Obama era is suspect, and for good reason. Obama used the FBI against an opposing political party, on behalf of Hillary Clinton. Then did nothing about the RussiaGate hoax. This all makes anyone in the FBI from that time suspect.", "time": 1607115231.0}, {"subreddit": "republicans", "text": "I have said before that the corrupt Democratic party behaves like a criminal gang. This year we have seen riots, arson, looting and theft, physical attacks on people on the streets, attempted murder, constant lies, coercion, massive election fraud, and now physical attacks on those who expose their crimes.  Enough is enough.\n\nWe need to have an FBI that is not itself criminal, and a Department of Justice that does its job. We need to identify and prosecute the leaders of domestic parties behind all this, purge the communists too, and identify the foreign parties behind any crime and fraud (Soros, and the CCP, and Dominion) and then deal with them as needed. In Soros' case a drone strike is not off the table.", "time": 1607112508.0}, {"subreddit": "republicans", "text": "We are now way past simple incompetence and petty fraud and see major, criminal fraud, just in that state alone. But combined with the fraud across multiple states, well - we need to get to the root causes and heads need to roll. Including the FBI whose leader says nothing to see here. Prosecute Barr.  But take down the DNC for RICO.", "time": 1607105315.0}, {"subreddit": "republicans", "text": "It is apparent that the US is being warred upon. It's a covert war to bring us down. The enemy is both foreign and domestic. Not only that, it is not just one party but several. One set of drivers is the globalists; a second set are the communists. Domestically we have the traitors including those who are in it for power and profit for themselves, both individuals and corporations. There are the factions in the CIA, and the sellouts in the FBI and DOJ, and the members of the political machines such as Hillary, Pelosi, Obama. And of course there are rotten out media, who lie and propagandize to help control masses.\n\nForeign actors are the CCP and a small country in the middle east owned by the Rothschilds, whose Mossad is implicated in 9/11 and the Epstein blackmailing. \n\nIf we survive these evil times, we need to go through and clean out all the traitors. We need to remember who lied to us and we need to take care of them. Everyone who committed election fraud in order to take over the government must not be allowed to escape. We must take care of the liars who perpetrated the fraudulent Steele dossier, and the evil one who financed and drove the riots, and we need to find out all the names of those who ran the whole election fraud effort at the top.\n\nThis is a war, for real, and your freedom is at stake. Just pray they do not launch another bioweapon on us again, to stop any resistance.", "time": 1607070086.0}, {"subreddit": "republicans", "text": "AND I believe that Mussoli and Stalin were not nice people and Elvis is not dead but living in Las Vegas. Also Elmo is a Satanic force housed in a Muppet's body.", "time": 1607037866.0}, {"subreddit": "republicans", "text": "The minimum would be to discharge him from office. Not only  is he incompetent but also dishonest and he most certainly is ignoring his duty to the people of this country.", "time": 1607013270.0}, {"subreddit": "republicans", "text": "We need to hope the Supreme Court discards all the massively fraudulent ballots and either somehow mandates a new and monitored election, or gives Trump a valid presidency. But the lies and the fraud must not stand, and the criminals must be brought to justice, not let go free. or else they well do it again and again. And if China through owning Dominion played a large role, there must be a reckoning. In this election America was attacked, and this is a war. We can't ignore what went on.", "time": 1606951373.0}, {"subreddit": "republicans", "text": "There is overwhelming provable evidence and yet we continue to get bombarded with claims that there's no evidence and Trump is making it all up. When the shills try to lie on Reddit we must kick them to the curb.", "time": 1606951100.0}, {"subreddit": "republicans", "text": "John, what do all those crisp Benjamins smell like?", "time": 1606756656.0}], "republican_score": 10, "democrat_score": 0}