{"name": "SwaggySis", "posts": [{"subreddit": "republicans", "text": "Cool. I was talking to all the losers that are.", "time": 1607076913.0}, {"subreddit": "politics", "text": "I agree unemployment needs to be extended but essential workers that have no choice but to put their lives on the line to not starve, deserve hazard and essential pay.", "time": 1607072346.0}, {"subreddit": "politics", "text": "How boring will this world be for these wealth hoarders when they can’t throw it in our face and exploit us anymore. They need us more than we need them. Billionaires should not exist, they do not contribute to society.", "time": 1607071231.0}, {"subreddit": "politics", "text": "What pisses me off is that, that’s our money. Not theirs. We’re the tax payers. They work for us. How dare they not “give” us our money when we need it. The whole system is broken. Guess it’s time to Eat The Rich. They made this choice.", "time": 1607071005.0}, {"subreddit": "politics", "text": "I don’t understand how these people are able to walk around freely. Pure evil!! Keep it up and we really will have to Eat The Rich!!", "time": 1607070071.0}, {"subreddit": "republicans", "text": "Where can I order the orange clown face one from?", "time": 1607069729.0}, {"subreddit": "republicans", "text": "They’re the same. They both just want to control you and claim to be for freedom.", "time": 1607069624.0}, {"subreddit": "republicans", "text": "I agree. If you can’t trust the election, don’t waste your time voting.", "time": 1607069428.0}, {"subreddit": "republicans", "text": "Go away loser! The people have spoken. You’re FIRED!!!", "time": 1607069271.0}, {"subreddit": "republicans", "text": "They just don’t want to pay a living wage.", "time": 1607069096.0}, {"subreddit": "republicans", "text": "Of course they do if Trump pays them. 50 cent already told us they offered him half a mill.", "time": 1607068967.0}, {"subreddit": "republicans", "text": "No I don’t think it is a joke...", "time": 1607068617.0}, {"subreddit": "republicans", "text": "💯", "time": 1607068575.0}, {"subreddit": "republicans", "text": "Perversities? How old are you? Grow up. The naked human body is the most natural thing. Stop trying to push your outdated thinking onto other people. Yet you claim to support freedom?", "time": 1607068554.0}, {"subreddit": "republicans", "text": "Go ahead grifter! Sell your people out for that dollar.", "time": 1607068341.0}, {"subreddit": "politics", "text": "Got into an argument w a guy about this (about living wages) Told him he’ll never part of the 1%, so stop dreaming. He told me with that kind of attitude I never will be. I know I won’t because I live in reality not fantasyland. These peoples way of thinking is so warped.", "time": 1607066897.0}, {"subreddit": "politics", "text": "I live in WV and say this all the time. He’s the richest person in the state, all inherited. These people are delusional. They complain about welfare and socialism as they line up to cash their ss checks, buy energy drinks w their food stamp cards, use their Medicaid for drug rehab and live in housing projects. It’s just sick!!", "time": 1607066375.0}, {"subreddit": "politics", "text": "I voted for her!", "time": 1607065999.0}, {"subreddit": "politics", "text": "I just hate this guy so much! I’m so over him. I never want to see his fat face again!!", "time": 1603532409.0}, {"subreddit": "politics", "text": "Make America Empathetic Again", "time": 1603532306.0}, {"subreddit": "politics", "text": "Trump is an evil troll!", "time": 1603532196.0}, {"subreddit": "politics", "text": "Then they’re idiots for voting for him. They should kick them off their social security. Since they hate socialism so much. See how fast they vote him out then. I’m tired of my tax dollars going to people that hate socialism.", "time": 1602841690.0}, {"subreddit": "politics", "text": "They just can’t wait to start controlling women’s bodies. It’s a sick obsession.", "time": 1602841000.0}, {"subreddit": "politics", "text": "This guys brain is as swollen as him.", "time": 1602840835.0}, {"subreddit": "politics", "text": "It always makes me wonder, since so many people hate him. Who the hell voted for him?", "time": 1602840715.0}, {"subreddit": "politics", "text": "Does it make you feel differently about them? I used to think my neighbors  were good people. Now I’m questioning who these people really are. Family members too. It’s just sad. But also glad to see them for who they really are. It’s been a strange few years....", "time": 1602840291.0}, {"subreddit": "politics", "text": "Right. He talks about Biden’s America. No last time I checked, you created this sh*t show. This is trumps America.", "time": 1602838804.0}, {"subreddit": "politics", "text": "Spineless, trump boot licking cowards. That will be their legacy.", "time": 1602838363.0}, {"subreddit": "politics", "text": "One can hope. If he wins...", "time": 1602838267.0}, {"subreddit": "politics", "text": "These dinosaurs have got to go!!!", "time": 1602837062.0}, {"subreddit": "politics", "text": "I love dogs", "time": 1602834899.0}], "republican_score": 11, "democrat_score": 0}