{"name": "dward_45", "posts": [{"subreddit": "republicans", "text": "Sounds like you haven’t been to college.", "time": 1607117660.0}, {"subreddit": "republicans", "text": "Haha, I’m making a joke", "time": 1607056705.0}, {"subreddit": "republicans", "text": "Well I think you’re fake news!", "time": 1607035323.0}, {"subreddit": "republicans", "text": "What is she even talking about? Since when are girls who “spread their legs for the world” lauded as courageous? The majority of people will look down upon those women. \n\nI don’t give a shit if a man wears a dress. Find something else to talk about, men didn’t just start cross dressing yesterday and Harry Styles wasn’t the first male celebrity to dress like a girl. I think freaking out about stuff like that and acting like it’s the end of the world shoes how soft and fragile people like Candice Owens really are. Basically everything offends her.", "time": 1607020923.0}, {"subreddit": "republicans", "text": "You’ll have to explain to me how that analogy is related to voter fraud. \n\nIts more like we’re in a 1 mile race and I get to the half mile mark, declare victory and go to bed. Then wake up the next morning and act surprised that the race didn’t end when I said it did. Millions of people agree. Anybody who kept running after I declared victory cheated. I won the race, by a lot actually. And all of you are liars for going along with the facade that I actually lost the race. \n\nMaybe if we can change the rules so that after I declared victory, nobody else can move, then I’ll be the winner. Let’s try that.", "time": 1607015924.0}, {"subreddit": "republicans", "text": "He didn’t get cheated but they stacked the deck against him. Unfortunately for him that’s all allowed under the rules established by the party. Parties used to just nominate a candidate without primaries and let people vote in the general election. Now we have primaries but the parties set the rules, so they have some control over the outcome. \n\nThis year I think they made the right decision. There were 3-5 moderate candidates in the primary and Bernie Sanders 9! the far left (excluding Warren for simplicity sake). 60% of Democrats vote for moderates, but those votes are split among 5 candidates. The other 40% vote far left, but all those votes go to Bernie giving him the nomination. Is that fair? Bernie got the most votes, but more people voted against him than for him? More Democrats are ideologically moderate, their votes were just split among many candidates, so no one candidate reached the number needed to win. (same thing happened in the Republican primary, giving Trump the nomination)\n\nWell, what if we just picked the top moderate candidate and removed the other ones. Vote Biden if you’re moderate and Bernie if you’re “democratic socialist”. Whichever group turns out more will be the winner. Wouldn’t that give us an outcome more representative of our voting base?", "time": 1606923258.0}, {"subreddit": "republicans", "text": "I don’t like that so I’m gonna call it fake news.", "time": 1606923155.0}, {"subreddit": "republicans", "text": "Stop the count!", "time": 1606848451.0}, {"subreddit": "republicans", "text": "I mean he is right about some people, but I don’t see why you’re trolling on here, this isn’t a Trump subreddit. \n\nProbably because the Trump Reddit bans everyone", "time": 1606847335.0}, {"subreddit": "republicans", "text": "I love it", "time": 1606839649.0}, {"subreddit": "republicans", "text": "I would rather reason and not the influencing my leaders. That being said, religion is can be a good source of morality for some people, but don’t make it a focal point of policy making.", "time": 1606632786.0}], "republican_score": 11, "democrat_score": 0}