{"name": "pr1ap15m", "posts": [{"subreddit": "republicans", "text": "where’s the pics i came to see CNN nude, been wondering what was h see those fancy cloths for a while", "time": 1607132361.0}, {"subreddit": "politics", "text": "this rotting tortoise corpse in a suit need to go he’s an awful man who does awful things how can anyone vote for him", "time": 1607036666.0}, {"subreddit": "republicans", "text": "dreamers are dreaming about the chance to be american citizens. what’s more american that that, let them come and appreciate being here, and kick out the one who don’t and want to burn it to the ground", "time": 1606656505.0}, {"subreddit": "republicans", "text": "which minor problem we talking toilet paper shortage or full blown Lizard people raping and eating our babies. it’s hard to keep up these days with all the facts from grandpa’s parlor account", "time": 1606599302.0}, {"subreddit": "republicans", "text": "worst case senario people who spread misinformation and conspiracy, run out of things to make up. best case the train keeps rolling and people have a boogey man to blame, other than themselves for their station in life.", "time": 1606586566.0}, {"subreddit": "republicans", "text": "yeah sure bruh your so right", "time": 1606441990.0}, {"subreddit": "republicans", "text": "memes like this are poisonous and misleading no states forced nursing homes to take in sick. cuomo’s was at first misinterpreted however and originally making these facilities think they had no choice. causing 26k people to die and that is a shitty mis communication. but it’s not premeditated murder, same as trumps mishandling on a national scale isn’t criminal it’s just incompetent. stop politicizing the pandemic that’s the real evil", "time": 1606439755.0}, {"subreddit": "republicans", "text": "was only referring to this “scientific study” as evidence of mental illness. it was a false statement based on bad conjecture. and your statements are what’s called post hoc ergo propter hoc fallacy. my point was this is one of those things that is just alway going to have bias", "time": 1606423957.0}, {"subreddit": "republicans", "text": "i just hope the phd student figures this stuff out before they defend, RIP if not they get shredded", "time": 1606423405.0}, {"subreddit": "politics", "text": "how bout we get rid of mortgage debt, i would think that would help more people that eliminating college debt", "time": 1606412809.0}, {"subreddit": "republicans", "text": "liberal = spill your guts talk about your feelings\nconservative = no talking that’s weakness \nit is conjecture the questions that were analyzed don’t actually support this statement. what could be said is white liberals are more likely to have health insurance that provides mental health. conservatives are more likely to not see it as important", "time": 1606408914.0}, {"subreddit": "politics", "text": "he can’t pay for the bots anymore", "time": 1606353204.0}, {"subreddit": "republicans", "text": "don’t worry this sub satire not fact based", "time": 1606349051.0}, {"subreddit": "politics", "text": "still can’t believe he fools people with his messages of hate, i’m the only one who can save you, give me money BS", "time": 1606265868.0}, {"subreddit": "politics", "text": "so she is admitting that she started the pandemic", "time": 1606264257.0}, {"subreddit": "republicans", "text": "i was under the impression they took a lot of time off [senate calendar ](https://www.senate.gov/legislative/resources/pdf/2020_calendar.pdf)and playing golf. sorry i should have said i was being sarcastic people are losing jobs, homes and these ass holes are going about their daily lives. they all need to be held accountable everyones too worries about elections and parties. we should be asking where the fuck has our money been going", "time": 1606257913.0}, {"subreddit": "republicans", "text": "yea i can’t believe mitch and trump didn’t push through and prioritize another stimulus", "time": 1606250360.0}, {"subreddit": "politics", "text": "Rudy Giuliani has been a highlight of 2020", "time": 1606133324.0}], "republican_score": 12, "democrat_score": 0}