{"name": "SnooBooks5387", "posts": [{"subreddit": "republicans", "text": "'Yesterday we learned a forensics examination of a Ware County, GA Dominion Voting Systems machine found votes were switched from President Trump to Biden.'\n", "time": 1607126928.0}, {"subreddit": "republicans", "text": "What's Happening in US Election Matches What Happened in Venezuela, Expert Says\n", "time": 1607126542.0}, {"subreddit": "republicans", "text": "Diversity and Social Justice Are Big Business in Education, and You're Paying for it\n", "time": 1607114509.0}, {"subreddit": "republicans", "text": "It's even worse. ALL FIVE BIDEN SPIKES came after observers forced to leave and suitcases came out.\n", "time": 1607114290.0}, {"subreddit": "republicans", "text": "BREAKING: HILLARY CLINTON IN FULL PANIC MODE AFTER BILL BARR INDICTS 8 People For Illegally Funneling Millions In Foreign Money To Hillary’s Campaign in 2016.\n", "time": 1607112663.0}, {"subreddit": "republicans", "text": "Spot the Leftie\n", "time": 1607112188.0}, {"subreddit": "republicans", "text": "The FBI dispatched 15 FBI agents to investigate one \"noose\" that turned put to be a rope pull for a garage door and 0 (zero) Agents for all the election fraud in 6 swing states.\n", "time": 1607107590.0}, {"subreddit": "republicans", "text": "NV vote totals altered overnight, votes disappeared & reappeared\n", "time": 1607107410.0}, {"subreddit": "republicans", "text": "Gov Brian Kemp Orders Full Signature Audit of Georgia Results\n", "time": 1607107070.0}, {"subreddit": "republicans", "text": "Libs went from wailing, for four years, that a handful of Russians posting on Facebook swung the 2016 election to Donald Trump to now claiming that our elections are infallible.\n", "time": 1607106908.0}, {"subreddit": "republicans", "text": "Edison Analysis - BIDEN Takes 98% Of A 23,487 Vote Batch At 12:18 AM - At The Same Time Georgia Ballot Counter Was Filmed Allegedly Pulling Out Suitcases Of Ballots In Georgia\n", "time": 1607105582.0}, {"subreddit": "republicans", "text": "And now we know where the early morning spike in Georgia fraud ballots came from.\n", "time": 1607105518.0}, {"subreddit": "republicans", "text": "Evidence: Georgia Woman in Red Scanning the Same Ballots Over and Over and Over Again @44:00-53:00\n", "time": 1607105402.0}, {"subreddit": "republicans", "text": "Deep State Cover Up -- There were many members of the FBI, including senior management, involved in orchestrating or furthering the entire Russia hoax investigation.\n", "time": 1607105295.0}, {"subreddit": "republicans", "text": "Election Witness in ICU, Other Witnesses Had Tires Slashed, House Broken Into Twice\n", "time": 1607104706.0}, {"subreddit": "republicans", "text": "One Batch of 23,000 Ballots All For Biden Identified in Georgia That Were Fraudulent - More than Enough for Trump Win\n", "time": 1607103023.0}, {"subreddit": "republicans", "text": "Georgia Gov. Brian Kemp Calls For Signature Audit of Ballots Following Release of Bombshell ‘Ballot-Stuffing’ Video - American Greatness\n", "time": 1607102663.0}, {"subreddit": "republicans", "text": "Project Veritas Strips CNN Naked\n", "time": 1607102566.0}, {"subreddit": "republicans", "text": "This Election is Far From Over\n", "time": 1607102390.0}, {"subreddit": "republicans", "text": "If you watch the new Georgia video and you still don’t see voter fraud, you’re a fool\n", "time": 1607101996.0}, {"subreddit": "republicans", "text": "Sidney Powell’s Georgia Kraken Filing Began by Saying Dominion Flipped Votes from Biden to Trump\n", "time": 1607101393.0}, {"subreddit": "republicans", "text": "Trump: 'I Will VETO' Military Spending Bill Without Section 230 Termination\n", "time": 1607101306.0}, {"subreddit": "republicans", "text": "Arizona lawsuit challenges 300,000 ballots\n", "time": 1607028054.0}, {"subreddit": "republicans", "text": "Systemic network bias at CNN exposed in undercover Project Veritas exposé\n", "time": 1607027669.0}, {"subreddit": "republicans", "text": "Full Breakdown\n\n[https://social.quodverum.com/@REX/105308512557655793](https://social.quodverum.com/@REX/105308512557655793)", "time": 1606938325.0}, {"subreddit": "republicans", "text": " [SHARPIE  GATE: Was this why they forced republicans to use Sharpies in AZ? The  more ballots that can't be read by the machines, the more \"duplicate\"  ballots there will be. There could A LOT of these ballots.](https://thedonald.win/p/11Ql6MRO9W/sharpie-gate-was-this-why-they-f/c/)", "time": 1606937030.0}, {"subreddit": "politics", "text": " \n\nThis is a video interview of Articia Bomer.\n\n* [**https://www.youtube.com/watch?v=psGpIuNh\\_dU**](https://www.youtube.com/watch?v=psGpIuNh_dU)\n\nShe signed a sworn affidavit and provided testimony of events that occurred  at TCF Center in Detroit, Michigan on Nov 3rd and 4th during counting  of results for Wayne County.\n\nHer statement matches remarks of other witnesses including a sworn  affidavit by Dominion Voting Systems contractor Mellissa Carone (see  below)\n\n>She describes:  \n>  \n>\\-Hearing an announcement of 50 boxes at 4am: the Biden Ballot Dump  \n  \n>  \n>\\-Hearing that the Biden Ballot Dump was counted and processed in an impossibly short amount of time  \n  \n>  \n>\\-Witnessing officials TAMPERING with tabulators at the TCF Center!  \n  \n>  \n>\\-Ballot harvesting operations being done by a local Church  \n  \n>  \n>\\-Poll workers overriding the actual votes, and changing Trump votes to BIDEN!  \n  \n>  \n>\\-Poll workers REFUSING TO COUNT Trump votes!  \n  \n>  \n>\\-Poll workers bringing in luggage and boxes that could have contained illegal ballots  \n  \n>  \n>\\-Poll Workers using deceitful tactics and colluding with Democrats to try and EXPEL GOP Poll Challengers  \n  \n>  \n>\\-GOP Poll Challengers being EJECTED from observing the vote count  \n  \n>  \n>\\-GOP Poll Challengers were observing ILLEGAL BALLOTS and their objections were IGNORED  \n  \n>  \n>\\-Poll workers being obvious Democrat PARTISANS  \nSuspicious meetings of the poll workers  \n>  \n>\\-She describes a Detroit poll worker who used correction tape to rig the machines to generate errors that could be overridden by staff.\n\n**Mail-in ballot fraud**\n\nunsolicited mail-in ballots by the millions creates cover for large scale fraud\n\n* ballot harvesters 'collect' and pay voters for mail-in and absentee ballots ([1](https://www.youtube.com/watch?v=ZWK56l2VaLY)) ([2](https://www.youtube.com/watch?v=MV7oDl8yDZk)) ([3](https://www.youtube.com/watch?v=tAZfQ7CpdKk))\n* dead voters ([1](https://www.youtube.com/watch?v=osCBjTKxKWs))\n* duplicate mail-in ballots\n* voters requesting ballots that claim residence in a different state\n* USPS officials illegally backdating mail-in ballots ([1](https://www.youtube.com/watch?v=fS6xOuhsiJw)) ([2](https://www.youtube.com/watch?v=AR_XpJ287Iw)) ([3](https://www.youtube.com/watch?v=By7yNZsa8x0)) ([4](https://www.youtube.com/watch?v=J-D-2GOswwA))\n* USPS mailmen conspire to steal ballots ([1](https://www.youtube.com/watch?v=ImU5wZWnm00))\n* large numbers of suspicious mail-in ballots appearing in dead of night voting only for Biden, no down ballot votes  \n(Detroit, Philadelphia, Milwaukee, Atlanta)\n* completely  ignoring or removing requirements for signature verification and  postmark verification combined with accepting mail-in ballots after  election day\n\nCorrupt  election officials and party operatives can determine how many mail-in  ballots 'received' after election day are needed to offset live-in  person voting to change outcomes of an election. The larger the number  of unsolicited mail-in ballots, the larger the potential for  manufactured ballots and fraud.\n\n[A van with a large number of 'mail-in' votes  mysteriously appeared at TCF center in Detroit, Michigan on Nov 4, 2020 **at 4:00am**](https://www.youtube.com/watch?v=zUtTuekWb8Q).  A poll watcher notes it took three hours to inspect and count a small  number of mail-in ballots between 10:00pm- 1:00am earlier that night  when counting ceased. There was no counting between 1:00am - 4:00am.  Election workers and poll watchers left at 5:00am.\n\nPoll watcher Hima Kolanagireddy [reported similarly activity in a legal affidavit](https://www.youtube.com/watch?v=hKtnYZ8X8UE)\n\nDominion Voting Systems contractor and whistleblower Mellissa Carone's [legal affidavit](https://www.greatlakesjc.org/wp-content/uploads/Supplemental-Brief-Motion-for-TRO-Costantino.pdf) and witness account ([1](https://www.youtube.com/watch?v=1lFBQuq8udI)) ([2](https://www.youtube.com/watch?v=tDEUUK6yRBY)) ([3](https://www.youtube.com/watch?v=yCyluVHODJQ))\n\nThree witnesses isn't enough?  How about five more legal affidavit?\n\n* Braden Giacobazzi  \n[https://www.youtube.com/watch?v=yWC6OF7ZZww](https://www.youtube.com/watch?v=yWC6OF7ZZww)\n* Shane Trejo  \n[https://www.youtube.com/watch?v=dt6yF0Ra3tw](https://www.youtube.com/watch?v=dt6yF0Ra3tw)\n* Patrick Colbeck  \n[https://www.youtube.com/watch?v=w3hcC9oDH14](https://www.youtube.com/watch?v=w3hcC9oDH14)\n* Jose Aliaga  \n[https://www.youtube.com/watch?v=Pmv1DIDQhkI](https://www.youtube.com/watch?v=Pmv1DIDQhkI)\n* Ann Rudisill  \n[https://www.youtube.com/watch?v=-wBB8RyOlPg](https://www.youtube.com/watch?v=-wBB8RyOlPg)\n\nColbeck,  a former aerospace engineer, witnessed voting machines being networked  in the canvasing room at TCF center in Detroit. This should not happen.\n\nA  sworn affidavit has also been filed by former Assistant AG for  Michigan, Zachary Larsen, on the alleged fraud he observed in Detroit at  TCF Center in Wayne County on Nov 3rd and Nov 4th.\n\n* [https://twitter.com/bhweingarten/status/1325894530206412801](https://twitter.com/bhweingarten/status/1325894530206412801)  \n([archive](https://archive.is/lUPQ3))  \n**Photos**  \n[https://pbs.twimg.com/media/EmaF\\_XtXIAEZ3hL.png?name=orig](https://pbs.twimg.com/media/EmaF_XtXIAEZ3hL.png?name=orig)  \n([archive](https://archive.is/W79Iz/0bed4fa033f80ae6b5433f0ca457d223d0b0697c.png))  \n[https://pbs.twimg.com/media/EmaGAt3WMAAtqKz.jpg?name=orig](https://pbs.twimg.com/media/EmaGAt3WMAAtqKz.jpg?name=orig)  \n([archive](https://archive.is/0f8KE/5bea9f2986daa7b8e8806b53830b5b3dd86af461.jpg))  \n[https://pbs.twimg.com/media/EmaGBLeXYAAfFpg.jpg?name=orig](https://pbs.twimg.com/media/EmaGBLeXYAAfFpg.jpg?name=orig)  \n([archive](https://archive.is/qV8aH/c1c4d8a8865a6af751f0255260700757e653d1a1.jpg))  \n**Affidavit**  \n[https://www.greatlakesjc.org/wp-content/uploads/Complaint-Costantino-FINAL-With-Exhibits.pdf](https://www.greatlakesjc.org/wp-content/uploads/Complaint-Costantino-FINAL-With-Exhibits.pdf)  \n([archive](http://web.archive.org/web/20201110170849/https://www.greatlakesjc.org/wp-content/uploads/Complaint-Costantino-FINAL-With-Exhibits.pdf))", "time": 1606931158.0}, {"subreddit": "republicans", "text": "  \n\n# There is no evidence an election happened.\n\n**If you can't audit the whole process, how do you know an election happened?**\n\n&#x200B;\n\n* No chain of custody, how do you know an election happened?\n* No observers, how do you know an election happened?\n* No consistent following of the law, how do you know an election happened?\n* No audit of machines, how do you know an election happened?\n* No signature matches, how do you know an election happened?", "time": 1606853225.0}, {"subreddit": "republicans", "text": "  \n\nOne more time:\n\n[https://www.justice.gov/opa/pr/former-philadelphia-judge-elections-convicted-conspiring-violate-civil-rights-and-bribery](https://www.justice.gov/opa/pr/former-philadelphia-judge-elections-convicted-conspiring-violate-civil-rights-and-bribery)\n\nThis election judge was caught earlier this year around the the time  Trump and Barr started talking about what was going to happen during  this election.\n\nThe election judge was paid a few hundred to a few thousand dollars to engage in digital ballot stuffing.\n\nHe was to be sentenced in June but he keeps getting postponed (September, and now January) and sealed docs added.\n\nNote that the case is *conspiracy* to violate civil rights, by  definition there have to be other conspirators for it to be a  conspiracy. You can’t have a one man conspiracy.\n\nThe indictment mentioned “others known to the us attorney” but doesn’t name them and no one else was charged yet.\n\nThey nabbed 15 mobsters\n\n[https://www.justice.gov/usao-edpa/pr/fifteen-members-and-associates-philadelphia-mafia-indicted-federal-racketeering-and](https://www.justice.gov/usao-edpa/pr/fifteen-members-and-associates-philadelphia-mafia-indicted-federal-racketeering-and)\n\nNo mention of the election shit but they probably found a ton of  crimes on a fisa warrant. They’ve been listening to these guys all year.\n\nIt IS a mob job — at least the philly operation is a mob job.\n\nThe philly democrats ARE the mob.", "time": 1606749165.0}, {"subreddit": "republicans", "text": "According to sources, the number of [Dominion](https://conservativedailypost.com/tag/dominion/)  whistleblowers (including a Michigan contractor for the company) coming  forward indicate that about 38 million votes were switched away from  President Trump and given to Joe Biden.\n\n[Hal Turner wrote:](https://halturnerradioshow.com/index.php/en/news-page/news-nation/voting-software-company-whistleblowers-come-forward-claim-their-software-changed-38-million-votes-stole-election)\n\n***Three employees of the voting machine / software company “***[***Dominion***](https://conservativedailypost.com/tag/dominion/)***”  whose products were used in multiple U.S. States for the recent  election, have come forward and are blowing the whistle about OUTRIGHT  ELECTION THEFT perpetrated through their company’s voting software!***\n\n \n\nThe crux of their testimony: Software switched or simply erased more than 38 MILLION votes.\n\nAccording to Intelligence Community sources, Dominion software vote-switching was the Democrats first weapon of choice.\n\nMail-In voting was their second weapon of choice.\n\n Rudy Giuliani, the President’s Attorney says the three whistle blowers  have come forward and are willing to testify under oath as to what took  place.", "time": 1606240124.0}, {"subreddit": "republicans", "text": "Freedom you Troll.\n\nGo back to sucking off Fauci and pretending like putting dirty rags on kids faces \"protects\" them.", "time": 1605982394.0}, {"subreddit": "republicans", "text": "Ignore all the Fraud!!!!\n\nNo thanks.\n\n[www.Hereistheevidence.com](https://www.Hereistheevidence.com)", "time": 1605978902.0}, {"subreddit": "republicans", "text": " \n\n# Why Trump Will Likely Win a Second Term\n\n📷 \n\n***I want to stress in advance, that I DO NOT want this to be political***\n\n***And I’m certainly NOT saying I want a particular candidate to win.***\n\n***All  I am saying is that the election is a mess and from what I can tell, no  one in the media is actually outlining what’s to come based on the law.  Instead I’m seeing a lot of political opinion, being presented as fact,  when it isn’t.***\n\nThe media wants you to believe the election is over.\n\nBy law, it isn’t.\n\nUnless a candidate concedes, **the election remains in play until December 14th** **when states cast their electoral college votes**.\n\nSo,  unless President Trump concedes between now and then, Joe Biden hasn’t  won anything, no matter what the media tells you. Indeed, the media has  no say in this, anymore than they can decide what color the sky is;  they’re simply trying to get you angry so you’ll continue to watch their  awful shows so they can sell your eyeballs to advertisers.\n\nWith  that in mind,  we need to take a step back and assess how this election  is likely to play out based on the LAW, not public opinion or media  propaganda.\n\nBased on the law, it is highly possible **and in fact probable that Donald Trump will end up winning the 2020 Presidential election.**\n\nWhy?\n\nBecause the election is now in the courts. **And the courts have a clear precedent for how contested elections play out.**\n\nWhen  the courts get involved in an election, it becomes an issue of  evidence. Specifically, what a given court decides is compelling versus  non-compelling evidence, and how the court chooses to address the issue  of voter fraud if indeed there is compelling evidence.\n\nFor instance, if President Trump’s legal team goes to court and says, “*we want to have a vote audit in Michigan because there was voter fraud”* the first thing the court will ask them is, *“what evidence do you have to support this claim?\"*\n\nIf the President Trump’s legal team’s answer is *“we saw some numbers that looked suspicious,”* the court controls its urge to laugh, throws out the case, and that’s that.\n\nHowever, if the President’s legal team responds, *“we have sworn affidavits from 50 witnesses, video evidence, as well as three whistleblowers”* then it’s a completely different story.\n\nOnce evidence of fraud is introduced to the courts via a lawsuit, **the court, NOT the voters and certainly NOT the media, is in charge of the election.**\n\nThe  courts can demand a vote audit of every single vote counted in an  election. If, during the vote audit, actual fraud is discovered, the  court can rule that those votes are no longer valid, the formal vote  counts can change, and **it is possible that a given state ends up declaring a different winner.**\n\nEven if fraud is *not* discovered  by the audits, but there is a particular problem with vote cards (the  wrong type of ink was used, the hole punch didn’t go all the way through  the ballot as was the case in Florida in 2000, etc.), the courts can  deem those problematic votes as illegitimate.\n\nThis  again can mean the formal vote counts can change, and it is possible  that a given state ends up declaring a different winner.\n\nThis process is now underway in **Georgia, Pennsylvania, Nevada, Wisconsin, Michigan, and Arizona.**\n\nAny  one of those states could see Biden end up losing (remember, he only  won these states by 0.5% for most of them). That means that if Biden  loses even 10,000 votes due to fraud or some technicality (the ballots  arrived after the deadline), Trump could be declared the winner.\n\n**Again,  I am NOT saying I want this to happen. I am simply outlining how this  process works. If a court says “jump” you jump, no matter who you are.**\n\nSpeaking of which…\n\nTwo weeks ago, Supreme Court Justice Alito (as in the Supreme Court of the U.S., not of just one state) **ORDERED the State of Pennsylvania to segregate and count separately any ballots that arrived after 8PM on election night.**\n\nThis  is a legal order from the Supreme Court of the United States. If you  disobey it, you can go to prison. And because it’s a federal violation,  the lawsuit isn’t going to be “Joe Schmo vs. John Doe,” it’s “the United  States of America vs. Joe Schmo.”\n\nMy sources tell me that for Alito to order this without any comment from other justices suggests **the Supreme Court as a whole is supportive of his action.**\n\nSo, this is the Supreme Court of the United States effectively stating, *“we are now getting involved in this mess.”* That is a big deal.\n\nIf  you are looking for a reason as to why the media rushed into announcing  Joe Biden as the President Elect Saturday (the day after Alito’s  order), this is probably it.\n\nThe Democrats and their media allies (the media companies that lean left) realize that **once the courts get involved, the odds of Biden actually winning drop dramatically**.  So, they are attempting to mount as much pressure as possible for  President Trump to concede so that the election is finished before ever  entering a courtroom.\n\nRemember, the only way this election ends right now is if President Trump concedes.\n\nIf he doesn’t, but instead chooses to fight in court, then the process follows the path I outlined a little while ago, **where the courts decide which votes count and which ones don’t.**\n\nFor  an election in which multiple states were “won” by less than 0.5%, the  odds GREATLY improve for President Trump once these issues are  introduced in court. He only needs to have 10,000 or so ballots thrown  out in order to flip multiple states.\n\nAnd bear in mind, that if a given court accepts or rejects a given lawsuit, the situation doesn’t end there.\n\nIf  either party or candidate is dissatisfied with a lower court’s ruling,  they can appeal the ruling, which can result in the lawsuit moving up to  a higher court, eventually reaching the Supreme Court, which serves as  the ultimate arbiter of election law in the U.S.\n\nThis  was the case with the 2000 Presidential election, when the Supreme  Court ruled that vote cards from Florida that didn’t have clean hole  punches were NOT valid, which gave the state to George W. Bush and **resulted in Al Gore conceding the election on December 13th.**\n\n**And  the Supreme Court’s justices are currently 6-3 conservative to liberal.  Even if Roberts were to side with the liberals, the conservatives still  hold the 5-4 majority.**\n\nPut  simply, the ultimate arbiter in court rulings on elections favors  Trump. Provided he DOESN’T concede, the odds greatly favor him winning a  second term.\n\nThat’s what the law and the courts say. And they’re the ones that matter in this situation.", "time": 1605728382.0}, {"subreddit": "republicans", "text": "His incompetence is leading to a R governor next. \n\nHis greed will ensure it.", "time": 1605723032.0}], "republican_score": 33, "democrat_score": 0}