{"name": "Typical_Samaritan", "posts": [{"subreddit": "republicans", "text": "That's not really interesting. An error was discovered and corrected during an audit--or to borrow from the tweet: a \"forensic investigation\".\n\nDon't allow your cynicism to be so deep that the system working correctly is considered suspicious. This is what audits are for.", "time": 1607182930.0}, {"subreddit": "republicans", "text": "This user leans Progressive. \n\nThat being said, this was a human error. The human error resulted in a tabulation mismatch. The mismatch was reconciled with a paper and machine count during an audit.", "time": 1607181457.0}, {"subreddit": "politics", "text": "All of this is going right back into the economy and to the government through taxes. At this point, we're just dealing with some righteously evil people.", "time": 1607149934.0}, {"subreddit": "republicans", "text": "No. In fact, it is the opposite.\n\nHuman error caused a tabulation mismatch, which was resolved during an audit.", "time": 1607149799.0}, {"subreddit": "politics", "text": "There are two stages to this scheme.\n\nStage 1: all (insert people here) look alike.\n\nStage 2: individuals are committing voter fraud by using different IDs to vote multiple times.\n\nHow would a voter ID actually help if you can't be bothered to distinguish between individuals in an ethnic group?", "time": 1607115636.0}, {"subreddit": "republicans", "text": "Just don't listen to them in court. Because what they're saying court is very different than their public statements. In fact, sometimes they are the opposite of what they're claiming in public.", "time": 1606973321.0}, {"subreddit": "politics", "text": "I actually think this is indicative of Obama missing the point. Democrats have had the votes. They've had the majority. They've even had a mandate. They've also made very little use of anything Obama is talking about to significantly change anything with respect to policing in this country.  Whether there's misunderstanding over a slogan, or thinking that the slogan turns potential allies away at this point is moot. Obama simply doesn't understand activism. Nor does he understand pushing the envelope. He's a generally risk averse individual. Which is not in my mind a bad thing, it's just that the kind of politics he and mainstream Democrats bring is no longer sufficient to move things forward. \n\nJoe Biden has been in either the Senate or Executive for nearly 20% of the entire history of America's *existence*. Him, by himself. He has been a visible leaer in this country for 1 out of every 5 days this country has been a thing. They called him a Communist and a Socialist anyway, despite none of his history suggesting anything close. We're passed the point of Obama pointing out anything significant. The environment is simply too different.", "time": 1606942974.0}, {"subreddit": "politics", "text": "The Turkish agent  is telling the President to do something unAmerican. Who woulda' thunkit.", "time": 1606941161.0}, {"subreddit": "politics", "text": "So you want Democrats to lie about Progressives to make the very point that Progressives are making?", "time": 1606940273.0}, {"subreddit": "politics", "text": "Mitch MCConnell is paid by American taxpayers to tell us that we can't have any of it back to help us when we're in need. And his supporters think this is a good thing. He's evil and his supporters are stupid or evil.", "time": 1606927324.0}, {"subreddit": "politics", "text": "We need some interagency cooperation to ensure that whatever state level charges are possible are backed up with federal investigation resources.", "time": 1606876349.0}, {"subreddit": "republicans", "text": "A lot of the confusion around this election can be directly tied to the lies the Trump campaign, its legal team and their allies are fomenting in public. And I will maintain these are lies because they know they are not telling the truth: either when they go to court and say their allegations are not fraud related or they say in public that they are fighting fraud. They're lying to *someone*. And it's definitely not the courts.\n\nThis campaign wants their followers to accept a proposition *the campaign does not itself believe*. And that's frustrating, because for some reason people buy their public statements.\n\nAnd then not only do they go to court and *poorly* file their court filings, leaving many, if not most, of their filings dimissed without trial (and therefore not appealable), the complaints themselves are inconsequential *even if absolutely true*.", "time": 1606866091.0}, {"subreddit": "republicans", "text": "Maybe this time Rudy will remember which level of scrutiny he wants the court to apply.", "time": 1606857315.0}, {"subreddit": "politics", "text": "Without reading the article... is he at like 4% with Republicans or something?", "time": 1606749141.0}, {"subreddit": "politics", "text": "I don't have any evidence that Mary Trump is normal, except that she's an educated woman and communicates like one.\n\nBeyond that, we're dealing with a woman who was raised with and watched this man in all his dysfunction and bile, and waited only until it was profitable to let the public know about her firsthand experience with his racism and psychological issues. Sure, that might be normal in some way, somehow. But she's as opportunistic and fucked up as the rest of the family--just in her own way.", "time": 1606746132.0}, {"subreddit": "politics", "text": "Rudy Giuliani has a law degree as well... if you don't use it you lose it.", "time": 1606745668.0}, {"subreddit": "politics", "text": "I suspect that any particular sperm from those balls would have come out similar to Trump. While I'm not excusing his behavior--he's an adult, it's pretty clear he was raised in utter dysfunction.", "time": 1606745508.0}, {"subreddit": "politics", "text": "First, you've actually got to make it to trial...", "time": 1606695425.0}, {"subreddit": "politics", "text": "This totally rigged election whose outcome was and always has been inevitable also led to a runoff election. Somehow.", "time": 1606601693.0}, {"subreddit": "politics", "text": "I think we only have access to the Georgia filing specifically. But it's not particularly interesting. There are a lot of affidavits. One of the first ones used is about Smartmatics, and Hugo Chavez. You know, more of what she's said in public. But Dominion doesn't use Smartmatics software and the two companies are affiliated by industry only. That specific affidavit is equivalent to a lawyer complaining about Windows being in Apple computers.", "time": 1606428708.0}, {"subreddit": "politics", "text": "In a normally function DOJ, it wouldn't even be his call. They either will or will not.", "time": 1606317248.0}, {"subreddit": "politics", "text": "Biden should consider that a blessing. We can be confident that Trump has at best only the veneer of a superficial understanding of what's going on.", "time": 1606317143.0}, {"subreddit": "politics", "text": "While this is cool and all, and I'm glad it happened in response to Donald Trump, so long as the population increases, breaking this record is an inevitability.", "time": 1606238223.0}, {"subreddit": "politics", "text": "The headline makes it seem like the accusations have merit, but that the left is just failing where the right succeeds.", "time": 1606143849.0}, {"subreddit": "politics", "text": "The voters spoke four years ago too. He lost by \\~3 million votes then. For nearly every single election over the last 30 years, the people have voted not-for a Republican. They have voted for a Democrat. They are an ideologically irrelevant party hanging on by abusing the system to stay in power.", "time": 1606068076.0}, {"subreddit": "politics", "text": "I want to add that I read this. Don't worry about it, vaginas are pretty small too.", "time": 1606009693.0}, {"subreddit": "politics", "text": "Nor should we forget that his supporters were okay with forcibly separating families and imprisoning those children, and leaving them to be sexually abused.", "time": 1605887592.0}], "republican_score": 6, "democrat_score": 0}