{"name": "BudrickBundy", "posts": [{"subreddit": "republicans", "text": "Matt Drudge Logs Off: The Drudge Report has become a conformist shadow of its formerly bratty, oppositional self. Why?\n", "time": 1606362409.0}, {"subreddit": "republicans", "text": "Rubio calls Biden’s national security team ‘polite & orderly caretakers of America’s decline’\n", "time": 1606317646.0}, {"subreddit": "republicans", "text": "7 Ways the 2005 Carter-Baker Report Could Have Averted Problems With 2020 Election\n", "time": 1606221349.0}, {"subreddit": "republicans", "text": "Chris Christie calls the conduct of Trump's legal team a 'national embarrassment'\n", "time": 1606132434.0}, {"subreddit": "republicans", "text": "Adam Carolla: Why Barack Obama is a bigger narcissist than Trump\n", "time": 1605916967.0}, {"subreddit": "republicans", "text": "Fight the Joe Biden Administration, Not Biden’s Election\n", "time": 1605916945.0}, {"subreddit": "republicans", "text": "Skeptical of Voter Fraud in 2020? Here's Your Evidence.\n", "time": 1605892824.0}, {"subreddit": "republicans", "text": "Senior Trump official to Reuters: Yes, we're going to try to get state legislatures to execute a coup for us\n", "time": 1605836988.0}, {"subreddit": "republicans", "text": "In Nevada, A Corrupt Cash-For-Votes Scheme Is Hiding In Plain Sight\n", "time": 1605756315.0}, {"subreddit": "republicans", "text": "Report: Biden Considering Teachers’ Union Leaders for Ed Secretary\n", "time": 1605618417.0}, {"subreddit": "republicans", "text": "McConnell Excoriates Trump’s Reported Troop Drawdown in Scathing Senate Floor Remarks: Would ‘Delight the People Who Wish Us Harm’\n", "time": 1605580634.0}, {"subreddit": "republicans", "text": "The Grand New Party: Here’s What’s In Store For The Republican Party Without Trump At The Helm\n", "time": 1605542078.0}, {"subreddit": "republicans", "text": "Confirmed: Biden Cancer Initiative Spent on Salaries -- and Little Else\n", "time": 1605499250.0}, {"subreddit": "republicans", "text": "President Trump tweets Joe Biden ‘won’ election, claims it was rigged\n", "time": 1605450622.0}, {"subreddit": "republicans", "text": "Clay: Why I'm Voting For Donald Trump\n", "time": 1605379270.0}, {"subreddit": "republicans", "text": "‘Guess Who Wrote This’: Tim Allen Trolls Progressives With 172-Year-Old Quote From Karl Marx\n", "time": 1605329031.0}, {"subreddit": "republicans", "text": "**Again**, there haven't been any reasoned responses. Just a bunch of people displaying a total lack of understanding of basic civics.", "time": 1606663927.0}, {"subreddit": "republicans", "text": "When Trump claims to be a Christian and says his favorite book is the Bible his own supporters laugh. No one believes it. The press refers to Joe Biden as a \"devout Catholic\". That's the distinction! And at the end of the day, Trump was the best POTUS Christians have had in a long time. He isn't one himself, but he sees religious conservatives as some of his most important \"customers\" and did things for them.", "time": 1606662298.0}, {"subreddit": "republicans", "text": "Don't let it get you down. They went above and beyond because they thought Trump was literally Hitler. He was the best POTUS we've had in a long time but he still let us down on things like immigration.  I saw a 2019 interview of Ann Coulter on Frontline where she explained all that needed to be done to fulfill the immigration platform. He could have done almost all of it without Congress! Then there's the 2020 George Floyd riots. If a strongly worded tweet doesn't get the job done, send in the military! If CHAZ wasn't enough to justify invoking the Insurrection Act then neither was Fort Sumter!", "time": 1606662101.0}, {"subreddit": "republicans", "text": "There haven't been any reasoned responses to my comments here.", "time": 1606661530.0}, {"subreddit": "republicans", "text": "Being a government official who practices a religion does not automatically mean that the government official is establishing an official religion, nor does it mean that government official is prohibiting the free exercise of religion. Thing is, those who do not understand the first amendment and just make mindless statements like \"Church and state should always be separate\" in response to things like the OP are those who are in favor of prohibiting the free exercise of religion. Ironically, it is these people who would violate the first amendment!", "time": 1606659546.0}, {"subreddit": "republicans", "text": "That someone is you!", "time": 1606655573.0}, {"subreddit": "republicans", "text": "You do not understand the first amendment.", "time": 1606655209.0}, {"subreddit": "republicans", "text": "By your logic, we should abolish any laws against murder or theft. Go right ahead and read the Declaration of Independence. The most famous line is a reference to God! We have a constitutional framework with checks and balances. Your understanding of basic civics is very poor. Your comments are so bad that I'm thinking you must either have an IQ around 75 or you're some kind of troll who *wants* to come across as a moron.", "time": 1606627507.0}, {"subreddit": "republicans", "text": "Religion (or lack thereof) is a major part of who you are, and this affects policy. This does not go against the first amendment. In fact, it affirms it. Your views on this subject are much closer to those of Xi Jinping than they are to any person who is widely considered to be \"great\" American (take your pick).", "time": 1606626946.0}, {"subreddit": "republicans", "text": "The first amendment doesn't *give* anyone anything. Religion shapes who you are, your values will inform your decision. Period. This isn't the Soviet Union or China. Our leaders are allowed to have whatever values they want.", "time": 1606626603.0}, {"subreddit": "republicans", "text": "You obviously don't understand the first amendment.", "time": 1606626362.0}, {"subreddit": "republicans", "text": "Rubio's right about these Biden guys. China has now spent decades employing a strategy to weaken the US while catching up economically and technologically, and to ultimately supplant us as the sole global hegemon. Our leaders have been listening to their donors and others who saw China as a great way to outsource production so that their companies can report a bigger profit in the following quarter. China's been playing the long game. Trump's not the ideal person to stand up to China, but he was the **only** President who has done so since Nixon's opening up with them 50 years ago.\n\nPolitically, Rubio can only gain from this stance. There's **a lot** of anti-Communist Hispanics in FL and the white Trump base is also anti-China.", "time": 1606318425.0}, {"subreddit": "republicans", "text": "We're going to nuke China now? Are you a retard?", "time": 1605644359.0}, {"subreddit": "republicans", "text": "The PLA is the biggest army in the world today. China's been winning. They're ascendant and we're in decline. They'd wage asymmetrical war against us, not conventional war, both by necessity and for cultural reasons. \n\nChina has major advantages right now. Perhaps their biggest advantage is that they are patient.", "time": 1605632628.0}, {"subreddit": "republicans", "text": "McConnell argues that our troops are in a limited, but vital, support role. You can't leave a power vacuum. \n\nThis stuff is Ron Paul level isolationism, and Ron Paul is crazy! Isolationism like this only emboldens bad actors like the Chinese Communist Party or radical Muslims. Trump's FP has been centered on realism. Pulling out like this would tarnish his legacy.", "time": 1605632030.0}, {"subreddit": "republicans", "text": "McConnell is right here. This would be the same mistake the Obama made, which led to Obama being the \"founder of ISIS\".", "time": 1605631763.0}, {"subreddit": "republicans", "text": ">I was around paying attention to politics, just not here. I was on LittleGreenFootballs, Powerline, AceOfSpades, various wordpress and blogs by randos who are now influencers on Twitter. I cut my teeth on the 1996 election and really got into it during the 2000 election because I served under Bill Clinton and wanted to make sure that a democratic candidate never saw office again. Reddit at that time was a libertarian hive mind and much more tolerable.\n\nNonsense! Reddit was not around at the time! LGF is a mess.  \n\nI cut my teeth listening to Imus, Rush, and NPR, reading the mainstream sources, and debating politics *in person*. After the 2000 election I got into trolling the other side, mostly at the Democrat Underground website. \n\nThere's no perfect path forward for Trump. The **only** viable path I'm seeing seriously considered is an unfaithful elector scheme to keep the White House. So you take the WH back, what then? You'll be hated. POTUS will have no mandate, Democrats win the Senate and more House seats in 2022, and then a Socialist takes the presidency in 2024. Is that what you want? Because that's what a scheme to hand Trump the presidency through faithless electors will produce.\n\n**EDIT:** \n\nJust to make it clear. The only path forward for Trump is not a sure thing. The only thing it guarantees for us is a unified base, one unified against the media and in favor of Trump. Are you planning to pay $5.99 per month for Trump TV just so you can get your news  from an information bubble?  People say it's not just a great information bubble, but the best! No one has ever seen anything like it. Tremendous! That appears to be the end game. \n\nSo destroy what remaining confidence there is in the process, hand over the government to the radical left with majorities that may exceed what Obama had in 2010, and watch the electoral college get abolished among other things. The best thing for us to do right now is to MOVE ON. Trumpism is bigger than Trump. It took a Trump to get us here. Let him be the Goldwater to a future Reagan.", "time": 1605547314.0}, {"subreddit": "republicans", "text": "Unlike you I was around and paying attention to politics in 2000. No, I did not call it for Gore. We had some setbacks and it's not gonna happen. At this point those who are still hanging on are more like the Ron Paul cultists hanging onto hope. Trump's just being Trump. The movement is bigger than Trump is. At least it ought to be. We'll be fine. This is the weakest incoming POTUS since Ford, which could be better for us in the long run than a Trump 2020 win would have been. By my estimate it's looking like the GOP will have 213 seats in the House of Representin'. The Squad has declared \"war\" on Pelosi. Either Clyburn gets the Speakership or there's going to be chaos. Could we see a \"Tuesday Caucus\" Republican take the Speakership? It's possible!", "time": 1605545659.0}, {"subreddit": "republicans", "text": "Looks like the Democrat party down-vote brigade is hitting your post hard, son. Take my upvote!", "time": 1605378934.0}, {"subreddit": "republicans", "text": "Legitimate or not, he is going to be our President. 2022 is going to be a good year for us.", "time": 1605375057.0}, {"subreddit": "republicans", "text": "Tons of voter fraud discovered and exposed. IDK if it can be proven in court, but math proved that it's impossible for it to have NOT occurred. Hunter's laptop is still an issue. When was the last time we had an incoming POTUS with credible evidence about brushing incest and pedophilia in his own family under the rug like this? Never mind the pay for play corruption, which is disqualifying, this Hunter/Natalie stuff is very disgusting!", "time": 1605367056.0}, {"subreddit": "republicans", "text": "They've been doing these things for decades, Trump just made them go further than they normally go. I think the Epstein thing really spooked some of them. If he's going to let a big fish like Epstein go down like that, then he was serious about \"draining the swamp\". \n\nNow a lot of people know about the fraud and we can make serious pushes for some reforms that make it harder.  The Democrat party is convinced that the lesson of their losses in 2020 was that they weren't far-left enough! Expect more minorities to walk away from the Democrat party as this trend continues. The Democrats may be surprised that the number of people who think that it's OK for 5 year olds to change genders and to allow boys into the girl's locker room in middle school is limited to those who are in their little religious Cult. I'm not worried and you shouldn't be either!", "time": 1605366822.0}, {"subreddit": "republicans", "text": "Trump's not going to be President after Jan 20th, so it's not Trump forever. We do need to move on. He wasn't perfect, but he did a lot of great things for the country. The movement is a much bigger deal than the man is. Let Trump be the Goldwater to a future Reagan.", "time": 1605330926.0}, {"subreddit": "republicans", "text": "WI, MI, and NV also would have gone to Trump.", "time": 1605129515.0}], "republican_score": 40, "democrat_score": 0}