{"name": "NeverTyranny", "posts": [{"subreddit": "republicans", "text": "Marxism is a Self-Fulfilling Prophecy\n", "time": 1607207014.0}, {"subreddit": "republicans", "text": "Fraud\n", "time": 1606948208.0}, {"subreddit": "republicans", "text": "Finding Hills to Die On\n", "time": 1605738885.0}, {"subreddit": "republicans", "text": "The Sun Is Still Rising\n", "time": 1604747823.0}, {"subreddit": "republicans", "text": "Final Reminder: This Trump Guy is No Reagan\n", "time": 1604303068.0}, {"subreddit": "politics", "text": "It's absurd that this election has devolved into an actual discussion over whether it will hurt worse to jump out of a 15-story window or a 20-story window.  Both candidates have almost zero transparency and both are elitist statist New York Crooks.", "time": 1473875841.0}, {"subreddit": "politics", "text": "In the months since the wrap up of the national conventions, Hillary Clinton has carefully crafted an approach designed to unite Democrats behind her in their opposition to Donald Trump while openly courting disaffected Republicans.  She even took the unusual (For a Democrat) step of singling out the Alt-Right and contrasting their Identity Politics with those of traditional Conservatives instead of painting with the broad-brush typical to most Progressive pundits.  But her comment on the “deplorables” who make up “half” of Trump’s support has not only erased most of her gains, but has provided a rare rallying cry for a hitherto broken and squabbling conservative movement.  It’s true that the conservative movement has devolved into a dysfunctional mob of infighting and vitriol, but they still take notice and resist attempts to paint them all broadly as racists.  (I doubt this brief flash of united resistance will last through the month, let alone provide a motivating factor on election day, but there it is)", "time": 1473875640.0}, {"subreddit": "politics", "text": "There is a great amount of speculation lately over whether Hillary will drop out of the election (coming from those who lambasted the idea of Trump dropping out).  In all honesty, this should be the last thing that any Republican wants.  Since both Hillary and Trump are dreaded by one side of the electorate or the other, the campaign has devolved into a character smear-fest where each candidate attempts to convince us that the other is worse than themselves.  If Clinton dropped out, all it would take for Trump to collapse entirely is a Democratic candidate with a clean record of government service and willingness to speak substantively on the issues.", "time": 1473875575.0}, {"subreddit": "politics", "text": "Few think to look to John McCain’s presidential bid for ideas on how to run a successful campaign, but the argument can be made that many of his decisions were effective (barring a certain VP selection) and that he was simply doomed by the unpopular president who proceeded him and the historical nature of Obama’s presidency.  With this perspective in mind, both Trump and Clinton could learn a lot from McCain’s full health and finance disclosure in 2008.  McCain was old, but it’s hard to argue he lost because of his age…or his health. ", "time": 1473875525.0}, {"subreddit": "politics", "text": "Hillary Clinton has problems, big problems.  But, despite what many pundits want to be the main conversation, her problems are not about her health…her problems are related to her heightened sense of secrecy and her inability to be transparent in her dealings.  The way she handled her bout with Pneumonia is exactly the same mindset that has gotten her in trouble for her emails.  She has made millions of dollars and lived an affluent lifestyle because of the governmental positions she has held, and yet is extremely paranoid of revealing anything related to her private life, up to and including being obnoxiously secretive of her health history and email habits.  This election is Hillary Clinton’s to lose, and she’s making it a much closer contest then it would otherwise be because she can’t bring herself to be frank and honest with the people she wants to represent.", "time": 1473875034.0}, {"subreddit": "politics", "text": "Uh...okay, let me explain how this whole rights thing works. They are called natural rights, inherent to all mankind simply by the nature of their existence. The Constitution enumerates and protects many of these rights, and they are secured and protected by the sacrifice of soldiers and servicemen.", "time": 1473168053.0}, {"subreddit": "politics", "text": "Swing Away!\nTo the surprise of many, Trump is proving to be extremely popular in Mexico, thanks to the number of Pinatas made in his image.  \n", "time": 1472758743.0}, {"subreddit": "politics", "text": "Quote of the Day\n“If Reagan was the Great Communicator, who is Trump? The Great That Was Just A Joke Taken Out of Context And I Really Didn’t Mean It That Way Give Me A Break Dude?” – Jason Taylor\n", "time": 1471018806.0}, {"subreddit": "politics", "text": "Perfect example of the point of the article, thank you", "time": 1470939408.0}, {"subreddit": "politics", "text": "Because that's not what libertarianism is...like it or love it, it's the idea that individuals operate the best the less government interferes in their lives.  Meet that viewpoint head on, argue your side of the equation, instead of mischaracterizing and marginalizing.", "time": 1470380477.0}, {"subreddit": "politics", "text": "https://en.wikipedia.org/wiki/Libertarianism ", "time": 1470380328.0}, {"subreddit": "politics", "text": "Virtually zero? You must pick and choose which polls to hype and which ones to hide...", "time": 1470380227.0}, {"subreddit": "politics", "text": "You just keep punching away at that strawman there...let me know if you need a break and want an actual discussion", "time": 1470347649.0}, {"subreddit": "politics", "text": "The surest path to defeat in a football game is an offense that can’t hold on to the ball long enough to give the defense time off the field….maybe Coach Priebus should have listened to the fans calling for a sub-out of the showboat Quarterback who keeps fumbling the ball.", "time": 1470343333.0}, {"subreddit": "politics", "text": "Johnson and Weld provide an intriguing alternative to those unhappy with the binary choices of 2016, but Johnson needs the Sanders or Bust crowd AND the NeverTrumpers if he’s going to have a shot in November.  A little more talk about limited government and a little less stumping on social concerns can go a long way, Gary.", "time": 1470343135.0}, {"subreddit": "politics", "text": "Many are questioning whether it’s time for Republicans en masse to start jumping ship in order to salvage down-ballot elections…but they forget they burned the #FreeTheDelegates lifeboat already.", "time": 1470342884.0}, {"subreddit": "politics", "text": "Trump being given a Purple Heart and his ensuing typical foot-in-mouth comment seems fitting considering his bombastic approach to politics may have finally mortally wounded his campaign.", "time": 1470268946.0}, {"subreddit": "politics", "text": "Alright, repeat after me,\n\nHello, my name is Donald, I am a serious Candidate, not a mindless egotistical mud-slinging machine.\n\n(Hopefully Gingrich, Giuliani, Christie and crew having something else in mind for their attempt)\n", "time": 1470268841.0}, {"subreddit": "politics", "text": "Looks like some folks in the Trump campaign are starting to wonder why they work so hard if Trump is gonna do whatever the hell he wants to do anyway.", "time": 1470268758.0}, {"subreddit": "politics", "text": "It seems that Trump loves the smell of Fratricide in the morning, he thinks it smells like victory (arguments of his surrogates that all Republicans need to unite to defeat Hillary notwithstanding)\n", "time": 1470268205.0}, {"subreddit": "politics", "text": "The ChickenHawk Dance\n\nContortionists are bizarre in that they can sometimes freak you out, but you just can’t help watching what comes next.  This phenomenon perfectly explains how I feel watching Trump try to explain away his draft deferments and complete lack of knowledge in foreign affairs while trying to beat his chest like he’s Teddy Roosevelt fresh from charging up San Juan Hill.", "time": 1470207865.0}, {"subreddit": "politics", "text": "Its Rigged!!\n\nIt’s comforting to know that the only consistent campaign messaging that Trump can nail is the excuse he’ll use for defeat.", "time": 1470207662.0}, {"subreddit": "politics", "text": "For someone who takes every little slight so personally, Trump sure likes to throw lobs at his political enemies. I guess we can chalk it up to Trump’s growing Messiah complex that he’s convinced he can save us from Beelzebub in the flesh.", "time": 1470207543.0}, {"subreddit": "politics", "text": "Reince is Mad, Mad, Mad\n\nI guess if I had led a full-fledged effort to totally silence the last opportunity for the GOP to get rid of Donald Trump, browbeat and bullied the Republican Delegates to fall in line, and wore out my body and soul in a four-day-long plead marathon for unity in the face of Hillary Clinton, only to watch all my efforts go up in a puff of cheeto-colored smoke because the guy I prostrated myself before likes attacking fellow Republicans and Gold-star families more than Democrats…I’d be pretty mad too.", "time": 1470207474.0}, {"subreddit": "politics", "text": "Well, it didn’t take much time after the balloons dropped lazily on the Cleveland “Unity Party” that reality fell a lot harder on the GOP. Trump just couldn’t let go of Paul Ryan’s slow and tepid endorsement, and couldn’t resist the opportunity to throw the same phrase back in his face. One has to wonder if the whole convention experience was a joke to Donald Trump, if he just stood there laughing at all the hesitant endorsements and cries for unity as he marked off his next targets one by one.", "time": 1470207284.0}, {"subreddit": "politics", "text": "If Trump is serious about beating Hillary in November, one would think it would be an easy call to recognize the folly of continuing an ongoing war of words with parents of a fallen American soldier, especially one that has proceeded with such vicious rhetoric on his part.\n\nPerhaps, despite all of the things Trump has gotten away with thus far, it may finally be the realization that Trump cares more about his ego than the success of his campaign that will finally derail the anomaly of his rise in politics.", "time": 1470207236.0}, {"subreddit": "politics", "text": "Just like Trump was glad he never had to face another Debate after Rubio dropped out.", "time": 1468457839.0}, {"subreddit": "politics", "text": "So...I think it's telling that at the official low-point of Hillary Clinton's campaign it's still this close in the swing states.  ", "time": 1468442127.0}, {"subreddit": "politics", "text": "The Trump's only argument is the fear of Hillary...well it's growing very apparent that sticking with Trump is the action that most guarantees a Hillary presidency.", "time": 1467819371.0}, {"subreddit": "politics", "text": "I compared a special interest group with a special interest group, how is that an apple to an orange?", "time": 1467751008.0}, {"subreddit": "politics", "text": "I apologize, I didn't realize the 1st Amendment had been repealed", "time": 1467750787.0}, {"subreddit": "politics", "text": "A notionally free society then...", "time": 1467750710.0}, {"subreddit": "politics", "text": "Fair enough, but obviously this re-conception of anarchy wasn't what I was referring to in my comment.\n", "time": 1467750661.0}, {"subreddit": "politics", "text": "I just had a nightmare that the two main political parties decided to have a contest to see which one could scrounge up the most corrupt person from New York....", "time": 1467750129.0}, {"subreddit": "politics", "text": "My understanding of Anarchy, at least the theory, is that individuals can be voluntary participants in society with the absence of government.  The examples you cite seem surprisingly coercive from those who claim by Anarchists, and I am especially interested in how these societies impose these decisions on their people in the absence of government coercion.", "time": 1467749093.0}, {"subreddit": "politics", "text": "You are correct, the first voluntary intoxication is not a subversion of will. But when the intoxicant has run it's course, altered brain chemistry, and created physical and mental dependence, has not the free will then been subverted?  Is it not the eternal rule of freedom, that it can only be lost when given up willingly?  I suppose the question is really this: should we be free to choose not be free?", "time": 1467748512.0}], "republican_score": 5, "democrat_score": 0}