{"title": "Opinion and Proposition: To ensure a speedy recovery from the coronavirus, President Trump should resign from office", "score": 12, "id": "j4hnpo", "url": "https://www.reddit.com/r/democrats/comments/j4hnpo/opinion_and_proposition_to_ensure_a_speedy/", "num_comments": 21, "created": 1601770171.0, "selftext": "I read earlier today that [Twiter will start suspending users wishing for Donald Trump's death after being diagnosed with COVID.](https://variety.com/2020/digital/news/twitter-suspend-users-wishing-trump-dead-1234791263/)  I think this is valid, as COVID is a very dangerous disease that is devastating to a person's health and very painful, and could lead to death.  In fact, I encourage the opposite:  I wish Trump and other members of government including senators, representatives, cabinet members, and cabinet secretaries who are diagnosed with the novel coronavirus a speedy recovery and return to health.\n\nBut, running for office and running the government must be so incredibly stressful and exhausting, and complicated to do from a hospital bed.  On NPR yesterday, they said that Trump prefers receiving his security briefs in person, and being isolated in the hospital could complicate how the President receives his security briefings with his staff.\n\nBut I propose that President Trump need not worry about security briefs, and the other duties of president, by *resigning from office*.  Resigning from the Presidency will allow him to focus on getting better and healthy while he fights COVID.  He will need all of the strength that God can give him to battle his deadly disease.  Because, what's more important for President Trump?  That he die from COVID, or survive so that he could re-run for the presidency in 2024?  Or enjoying retirement after working so hard serving the country for nearly four years?\n\nI think that any other member of government that also contracts COVID should also resign so they can recover speedily.  And also to prevent other members of government from catching the disease and dying, or being bed-ridden for weeks, possibly months, affecting how our country functions!\n\nI'm not on Twitter or other social media besides Facebook, so please, tweet this message, post it on Instagram, or Snapchat, and all the other social medias:\n\n**\"I wish President Trump and other members of government a speedy recovering after contracting novel coronavirus, and resign from their offices so they can focus their energies on getting better\"**"}