{"title": "Democrats Can Flip State Legislatures in 7 States this November", "score": 8, "id": "j5j8wr", "url": "https://www.reddit.com/r/democrats/comments/j5j8wr/democrats_can_flip_state_legislatures_in_7_states/", "num_comments": 0, "created": 1601932752.0, "selftext": "Democrats the chance to flip 9 legislative bodies in [7](https://secure.actblue.com/donate/statelegisltures) states this year.\n\nThis year we could possibly flip both houses of the North Carolina General Assembly, both chambers of the Arizona state legislature, the Texas house, the Pennsylvania house, the Iowa house,  the Michigan house and the Minnesota senate.\n\nState legislatures are important. They are going to be our first line of defense against an ultra-conservative Supreme Court.  Additionally, in many of these states they'll be the ones drawing new congressional districts next year.\n\nA lot of states are already too gerrymandered for us to flip, even in the event of a wave election, this post is going to focus on the states we can flip and provide ActBlue links if you'd like to help flip those chambers.\n\nHere are the states:\n\n**North Carolina**\n\nNorth Carolina Democrats need to flip 6 seats in order to win back the state house, and 5 seats for the state senate.  This page supports 2 incumbents and 14 challengers competing for Republican-held seats in both chambers.\n\n[https://secure.actblue.com/donate/flipnorthcarolina](https://secure.actblue.com/donate/flipnorthcarolina)\n\n**Arizona**\n\nArizona Democrats need to flip 2 seats in order to win back the state house, and 3 seats to win back the state senate.  This page supports 8 challengers competing for Republican-held seats, 4 in each chamber.\n\n[https://secure.actblue.com/donate/fliparizona](https://secure.actblue.com/donate/fliparizona)\n\n**Texas**\n\nTexas Democrats need to flip 9 seats in order to win back the state house.  This page supports 1 incumbent and 11 challengers competing for Republican-held state house seats.\n\n[https://secure.actblue.com/donate/fliptexashouse](https://secure.actblue.com/donate/fliptexashouse)\n\n**Pennsylvania**\n\nPennsylvania Democrats need to flip 9 seats in order to win back the state house.  This page supports 12 challengers competing for Republican-held state house seats.\n\n[https://secure.actblue.com/donate/flippennsylvaniahouse](https://secure.actblue.com/donate/flippennsylvaniahouse)\n\n**Iowa**\n\nIowa Democrats need to flip 4 seats in order to win back the state house.  This page supports 1 incumbent and 8 challengers competing for Republican-held state house seats.\n\n[https://secure.actblue.com/donate/flipiowahouse](https://secure.actblue.com/donate/flipiowahouse)\n\n**Michigan**\n\nMichigan Democrats need to flip 4 seats in order to win back the state house.  This page supports 1 incumbent and 7 challengers competing for Republican-held state house seats.\n\n[https://secure.actblue.com/donate/takebackthemichiganhouse](https://secure.actblue.com/donate/takebackthemichiganhouse)\n\n**Minnesota**\n\nMinnesota Democrats need to flip 2 seats in order to win back the state senate.  This page supports 6 challengers competing for Republican-held state senate seats.\n\n[https://secure.actblue.com/donate/flipminnesotasenate](https://secure.actblue.com/donate/flipminnesotasenate)\n\n**All 7 states**\n\nFinally, here’s a page supporting the 40 most competitive races for state legislature split between these 7 states.\n\n[https://secure.actblue.com/donate/statelegisltures](https://secure.actblue.com/donate/statelegisltures)\n\nI chose the states and races in this post based on the state legislative ratings done by CNalysis.com. I'm in no way affiliated with that site, I just used their state-level ratings to try and determine what state legislatures we could flip in the run up to next year's redistricting."}