{"title": "Assignment for Trump to see what he learned in Walter Reed School", "score": 12, "id": "j5poyk", "url": "https://www.reddit.com/r/democrats/comments/j5poyk/assignment_for_trump_to_see_what_he_learned_in/", "num_comments": 1, "created": 1601953738.0, "selftext": "**Learning Intention:** To demonstrate mastery over the topics learned in school\n\n**Success Criteria:** I will complete the following questions regarding epidemiology/disease management and I will resign as president/drop out of the election.\n\n**Due Date:** 3 November, 2020\n\n&#x200B;\n\n**Assignment Part 1:** Epidemiology and Disease Management\n\n**Directions:** Answer the following questions on a word processing software and turn it in by the due date. Be sure to use MLA formatting.\n\n1. Is COVID-19 a hoax? Why or why not. Answer in complete sentences.\n2. How would wearing a mask affect the transmission of SARS-CoV-2? Give specific examples.\n3. Who is the director of National Institute of Allergy and Infectious Diseases since 1984? Should he be trusted more than the president? Support your answer.\n4. What are the adverse effects of injecting disinfectant into the bloodstream? Support your answer using the chemical properties of disinfectant.\n5. According to the principles of ethics, is it effective to blame another country instead of taking responsibility?\n6. The following graph shows COVID-19 cases in USA over time. How would the graph change if schools are forced to reopen? Explain your answer in terms of cause and effect.\n\nhttps://preview.redd.it/ik459vltqbr51.png?width=1200&format=png&auto=webp&s=dc7718fc649bfebccdba9808c2e1c4325d60e3d7\n\n7. Compare and contrast the medical care you received in Walter Reed Medical Center and the medical care the average American receives. There should be a minimum of 5 sentences highlighting the difference in care quality.\n\n&#x200B;\n\n**Assignment part 2:** Resignation and or drop out of election.\n\n**Directions:** In order to demonstrate that you understood your incompetence for president, resign as president or drop out of 2020 election.\n\n**Rubric:**\n\nPart 1: \\_\\_\\_/50\n\nPart 2: \\_\\_\\_/50\n\nTotal: \\_\\_\\_/100"}