{"title": "What has news become?", "score": 7, "id": "j6nlzw", "url": "https://www.reddit.com/r/democrats/comments/j6nlzw/what_has_news_become/", "num_comments": 1, "created": 1602090452.0, "selftext": "As I am sure all of you have noticed, but all of the channels I used to watch for my daily news about Syria, European Matters, What's going on in China, and every day world news has become nothing more than political theatre for Donald Trump. The part I find so puzzling is the channels that claim to hate the man have nothing else to do than talk about every time he sneezes or passes gas. Look at CNN. I used to respect you as a real news channel, but it doesn't matter what time of the day I click to your channel, It all has to do with Trump. Don't you remember that this is what got us in this mess in the first place. All of you anchors joked about \"How crazy it would be if this no chance candidate took the election\" and then it happened. It's because you broke the rules about equal air time. You were so mesmerized by all of his crazy antics that you couldn't help yourself but to report on every single one of them. You make him the GOP front runner by choosing to talk about him and only him. I believe poor Jeb Bush only got air time when you were lambasting him or laughing at him. Are you really so stupid that you don't see what you are doing. If you bring up Black Lives Matter, better hold your hat because Don Lemon is going to get on his moral high horse and talk directly to the President. Cuomo, I love you dude, but you are a main offender. What do you do? You tell use how dire the situation is, then you pan right to camera and talk directly to our president. When will you get it? He has tricked you into doing the only thing he wants you to do. Keep him in the new cycle. Here is an experiment you won't do, but would be the most effective thing you could do for the mission you all claim to be on. Don't talk about him. Report the news. You remember the news? The stuff that would happen that wasn't related to whatever crazy antics Donald Trump was up to. You fall for it like suckers every time. He grabs a flag weird, and you spend the majority of the day laughing at him, but he is still all you are talking about. And I swear on all things, If you do another of your \"Let's get real\" speeches with the president, I may stop watching CNN and MSNBC all together. All you do is feed this mans ego, and then I get to listen to Don Lemon or whatever stand in at the time it is talk directly to camera, even saying 'Mr. President..... You are a terrible president (in essence.) Why don't you act like a decent human being?\" News flash hot shot, He isn't listening or you are just feeding the beasts ego. He doesn't give a second thought to \"fake news\" Don Lemon or Andrew Cuomo. So why not do something better with your time. Every story doesn't have to be followed up by \"and the president did nothing.\" because that shows me that the entire story you just did was just to call him out. Seriously. Do you even realize you are doing it? It has been months on months on months of you regurgitating the same talking points over and over. What can this man do that won't surprise you at the point? Stop putting him on air. ITS ALL YOU EVER DO,  \"Trump didn't say this right thing as he left the white house today.\" We don't care anymore. It is expected. You wanna know the real exhaustion Americans are going through, Its of you tieing every single thread you can to his presidency. You will never win any award with this type of blatant BS. You are becoming a reverse Tucker Carlson. \"OOOO the president held a press briefing where he stormed off.\" Well duh, He does that. \"OOOOOO He won't denounce white supremacy.\" Have you forgotten who you are talking about. Keep treating every little thing his does as te worst offense that could ever have happened, and you'll be the ones responsible for his re-election just like you were in 2016. How much air time do you think he got in 2016 just based off of you reporting the crazy stuff he did? Do you think it was equal to Hilary, because the only time you brought her up was with scandal as well. You're news cycle shouldn't exist. It was made for 9/11 when we really didn't know what tomorrow would bring, but as I write this now, test me. Watch Don Lemon and Cuomo tonight. Remember my words when they go through all the ridiculous things they keep saying about Trump, and masks, and how he doesn't listen to the task force. Then make sure they pull in close with camera one as you tell the president \"the business.\" Where did your integrity go? Where did your since of pride go? I am a democrat and you are disgusting me. You give the Trump supporters all the fuel they need because he is literally all you talk about. You may pepper a story in for 5-10 minutes, but then it's the Trump show again.Please realize what you are doing because you are the problem. If his only stage was Fox News, He would fail dramatically, but you still give this creaton air time. Get your life together cable news.\n\n&#x200B;\n\nEdit: Frustration leads to typos"}