{"title": "Help! Trouble getting an absentee ballot? (NC)", "score": 5, "id": "j6yqay", "url": "https://www.reddit.com/r/democrats/comments/j6yqay/help_trouble_getting_an_absentee_ballot_nc/", "num_comments": 5, "created": 1602131298.0, "selftext": "Hi everyone, I need absentee ballot advice. My girlfriend is registered to vote in North Carolina in her home county, but she's been living with me in a different county in NC for about 8 months due to school/wifi. She tried three months ago to change her voter registration to reflect her school dorm address (we didn't know if my home address would be accepted but she still had a university dorm room in her name), and this did not work. She tried again, and it didn't work again, even though I successfully changed my address from my dorm to my home address on the first try. Eventually she just decided to change her address to her moms new address in her home county (which worked on the first try) to request an absentee ballot from her home county back in the beginning of September, and for a month now the tracker has just said it's \"in the mail\". Last week, she contacted a Board of Elections official in her county, and they said they'll send another ballot and void the first one. They said to call them if the ballot doesn't come in by Friday. Well, it's Wednesday now and still no ballot. We feel like time is running out and we just want her to be able to vote, but I don't know that I want to risk her vote on them sending a third ballot if the first two have not come in. I made a timeline below so the order of events is more clear:\n\nJune: I change my voter registration address from my dorm room address to my home address successfully. GF unsuccessfully tries to change her voter address from her home county to her dorm room address at university. Two weeks later, she tries again, it is still unsuccessful.\n\nJuly: GF changes her voter registration address to another address in the **same county (home county)** because her mom moved. This works on the first try.\n\nEarly September: We both request our absentee ballots. Mine comes within two weeks, hers does not come in. \n\nEarly October (last week): GF emails board of elections email for her county. Someone responds saying that they'll send another, and that the first one is void. They say if the other one doesn't come in by Friday (10/9), to give them a call. As of today (Weds 10/7) she still has not received a ballot.\n\n&#x200B;\n\nMy question is: If the second ballot doesn't come in by this Friday (10/9), is it too late to change her voter registration? She's lived with me at my home address ever since March (about 8 months), could she get in contact with someone from my county and change her voting address to my home address? Or is it too late for that? We're not able to travel up to her home county for her to vote in person, but if we could change her address to be my home address, then at the very least she could vote in person here.\n\nAlso if it matters, my county is a much more central county and her home county is up in the mountains. Also she's got a very Hispanic sounding last name, and I am very white, so we were wondering if this could have something to do with voter suppression or if it's just because USPS is janky right now :/\n\nPlease let me know if any of this isn't clear!"}