{"title": "We Didn't Start the Fire, Trump Edition (updated)", "score": 3, "id": "j830cm", "url": "https://www.reddit.com/r/democrats/comments/j830cm/we_didnt_start_the_fire_trump_edition_updated/", "num_comments": 1, "created": 1602292322.0, "selftext": "The last four years...may this nightmare be over soon!\n\n\nNew York con man, fake tv, draft dodger, Hannity;\n\nAll Lives Matter, birther bile, MAGA build a wall;\n\nTax kabuki, Stephen Bannon, elevator, Michael Flynn;\n\nNorth Korea, 'nice to see ya', Muslims must go home;\n\nRoger Stone, E-bomb, Steele dossier, con Assange;\n\nBrexit, the FBI, and the 'effin Twitter lies;\n\nGerrymander routine, RNC was obscene;\n\nMar-a-Lago, grab their pu**y, electoral sur-prise.\n\n\nChorus: We didn't start the fire, it was always burning, since the worlds been turning; we didn't start the fire, no we didn't light it, but we need to fight it.\n\n\nComrade Putin, Kiselev, Kushner, and (oh no) Kiev;\n\nComey fired, Muslim ban, oligarchs plot;\n\nRoy Moore, Michael Cohen, rising seas, Paris done;\n\nDA-CA kids failed, healthcare almost lost;\n\nEpstein's Gulfstream, Stormy and some sordid memes;\n\nStephen Miller, Jeff Sessions, acting heads, no questions;\n\nNATO, what a mess, Canada, foolish threats;\n\nCorruption, obstruction, collusion with the Russians!\n\n\n(Chorus)\n\n\nParkland, bumpstocks, Thousand Oaks, all just talk;\n\nFake news, crowd size, over 20,000 lies;\n\nKKK, Tiki torches, Nazi's storming Charlottesville;\n\nPuerto Rico under tides, opioids and suicides;\n\nDorian Sharpie, trade wars, Giuliani, Census forms;\n\nTax cuts, bankrolls, the GOP sold it's soul;\n\nMeToo, embassy, NAFTA and TPP;\n\nKids in cages, sh*tholes, ICE thugs on the payroll!\n\n\n(Chorus)\n\n\nKavanagh, Lindsey Graham, Supreme Court in frat boy hands;\n\nKim Un, Jinping, strongmen laughing at him;\n\nKurds betrayed in Syria, Mueller report mania;\n\nVindman, Sondland, Schiff the prosecution;\n\nMark, Jim, Moscow Mitch, all are lying sons of b*tch;\n\nImpeached, DOA; please forgive us, USA!\n\n\n(Chorus)\n\n\nQAnon, golf again, Russian bounty on our men;\n\nCOVID, \"a hoax\", ain't no tests, false hope;\n\nBarr, Pompeo, stock decline, grandma on the front line;\n\nQuarantine, no vaccine, hydroxychloroquine;\n\nA whole country, unemployed, two hundred thousand people died;\n\nGeorge Floyd, protests, Law and Order, loser vets;\n\nVoting circus, postal probe, RGB, and martial law;\n\nNever ending culture wars, I can't take it anymore!\n\n\n(Chorus Chorus Chorus)\n\n\n...music fades out...\n\n...then gets stronger again...\n\n\nOh please God, not again, got to vote to make this end!\n\nPoor man, tax fraud, deep in debt, who owed? \n\nBeggin' campaign, Lincoln times, Parscale booked for finance crimes;\n\nFed militias in white vans, Texas voter hatchet man;\n\nDebate broken, the Proud Boys, like the Devil, just all lies;\n\nHope Hicks, Trumps are sick, Medivac, limo shtick;\n\nThe Rose Garden Massacre, of course he's a COVID spreader;\n\nGonna start a civil war, We can't take it anymore!\n\n\n(Blood curdling scream)\n\n\n(Chorus, Chorus, Chorus)"}