{"title": "'It's Time to Fight Dirty: How Democrats Can Build A Lasting Majority In American Politics' by Prof David Faris is a book every Democrat needs to read", "score": 2, "id": "j8dvv0", "url": "https://www.reddit.com/r/democrats/comments/j8dvv0/its_time_to_fight_dirty_how_democrats_can_build_a/", "num_comments": 1, "created": 1602331561.0, "selftext": "> It’s time to do more than protest—it’s time to fix a broken system\n\n> The American electoral system is clearly falling apart—as evidenced by the 2016 presidential election. In It’s Time to Fight Dirty, David Faris offers accessible, actionable strategies for American institutional reform which don’t require a constitutional amendment, and would have a lasting impact on our future.\n\n> With equal amounts of playful irreverence and persuasive reasoning, Faris describes how the Constitution’s deep democratic flaws constantly put progressives at a disadvantage, and lays out strategies for “fighting dirty” though obstructionism and procedural warfare: establishing statehood for D.C. and Puerto Rico; breaking California into several states; creating a larger House of Representatives; passing a new voting rights act; and expanding the Supreme Court.\n\n> The Constitution may be the world’s most difficult document to amend, but David Faris argues that many of America’s democratic failures can be fixed within its rigid confines—and, at a time when the stakes have never been higher, he outlines a path for long-term, progressive change in the United States.\n\nThis is a book that I really think every Senate Democrat and Biden team member should read. If I had the money I would buy a few hundred copies and send them them to every Democratic Senator and the Biden campaign. Does someone want to setup a fundraiser?\n\nhttps://www.nbcnews.com/think/video/it-s-time-for-democrats-to-fight-dirty-1226072643531\n\nhttps://www.c-span.org/video/?443917-1/its-time-fight-dirty\n\nhttps://www.amazon.com/Its-Time-Fight-Dirty-Democrats/dp/1612196950\n\nhttps://www.mhpbooks.com/books/its-time-to-fight-dirty/\n\nhttps://blogs.roosevelt.edu/dfaris/its-time-to-fight-dirty/\n\nhttps://twitter.com/davidmfaris\n\nhttps://blogs.roosevelt.edu/dfaris/"}