{"title": "There are several \"statistical models\" that predict a Trump re-election. These models do not come from rabid Trump supporters and they correctly predicted his 2016 election.", "score": 7, "id": "j9hrwd", "url": "https://www.reddit.com/r/democrats/comments/j9hrwd/there_are_several_statistical_models_that_predict/", "num_comments": 2, "created": 1602495083.0, "selftext": "Psychology Today - [https://www.psychologytoday.com/us/blog/through-the-social-science-lens/202010/will-trump-be-re-elected](https://www.psychologytoday.com/us/blog/through-the-social-science-lens/202010/will-trump-be-re-elected)\n\nPew Research Center - [https://www.pewresearch.org/politics/2020/08/13/the-2020-trump-biden-matchup/](https://www.pewresearch.org/politics/2020/08/13/the-2020-trump-biden-matchup/)\n\nAnd this guy, Helmut Norpoth - [https://patch.com/new-york/threevillage/stony-brook-professor-predicts-president-trump-landslide-win](https://patch.com/new-york/threevillage/stony-brook-professor-predicts-president-trump-landslide-win)\n\nUntil this year, I was certain Trump was going to be re-elected because -- despite the disaster of Puerto Rico -- the country seemed to be going smoothly...on the surface.  But this year, something happened to the country that has been entirely ignored by the \"statistical models\" seen here.  That something, of course, was COVID-19.  The catastrophic loss of life, accompanied by the economic collapse, has changed the country considerably.  Possibly it has done so in a manner these \"statistical models\" have failed to predict.  My \\*hope\\* is the outrage over the 210,000+ lives lost -- tens of thousands of which would certainly have been prevented if the Trump administration had simply \\*done something\\* to respond to the pandemic and organize a proper defense -- will disrupt these \"statistical models\" and bring justice and at least some semblance of recovery to this country.\n\nBut don't simply dismiss these outright.  Are there any level-headed comments to be had on this?"}