{"title": "The Fresno GOP has attempted to hide their involvement to illegally collect ballots for the 2020 election", "score": 24, "id": "ja1fcg", "url": "https://www.reddit.com/r/democrats/comments/ja1fcg/the_fresno_gop_has_attempted_to_hide_their/", "num_comments": 0, "created": 1602571789.0, "selftext": "When reading an article from the Washington Post (https://www.washingtonpost.com/nation/2020/10/12/california-illegal-ballot-boxes/), I clicked on a link from the article*, which lead to the Fresno GOP's website. I was met with a message on fresnogop.org: \"It looks like nothing was found at this location. Maybe try a search?\". I noticed that the navigation bars in the header & footer did not contain anything related to ballot collection information, but I started exploring their site. I noticed that much of their site had been scrubbed of any reference to their participation in the illegal ballot collection, but they missed some of the references to \"Ballot Collection Box Locations\" in some parts of their website:\n\n- from https://www.fresnogop.org/, the header/footer link to section \"Ballot Collection Box Locations\"\n\n   - Appears on:\n\n     - About Us (about)\n     - Election Transparency Lost (current-issues)\n     - Endorsements & Propositions (prop-13)\n\n - DOES NOT Appear on:\n\n     - Home\n     - Ballot Collection Box Locations (ballot-collection-box-locations)\n     - Events (events)\n     - Electeds (connect-elected-officials)\n     - POTUS (president-trump)\n     - CAGOP (cagop)\n     - Donate (donate)\n     - Volunteer (volunteer)\n\n[* Washington Post Article Excerpt: \"But Republican leaders are encouraging voters to bring their completed ballots to unlisted sites equipped with the unofficial green boxes, at locations including smog checks and gas stations.\"; \"sites\" was linked to \"https://www.fresnogop.org/ballot-collection-box-locations/\"]\n\n\nEDIT: I meant to include this, but forgot, until now... This is the archived list on the Fresno GOP's website: https://web.archive.org/web/20201012035009/https://www.fresnogop.org/ballot-collection-box-locations/\n\n> Ballot Collection Box Locations\n> \n> CONSERVATIVE VOTER ALERT!\n> \n> President Trump is very concerned about the lack of security with mail in ballots. Don’t take a chance that your vote will not be counted. Once your ballot arrives in the mail, mark your ballot completely and then walk it in, as soon as possible, to one of the secure locations listed below. Make sure your vote counts!!\n> \n> 1. Central Valley Guns  –  1577 W. Front St., Selma  –  Tues. thru Sat. 10a.m. to 6:00 p.m.\n> 2. Clovis Smogs – 396 Clovis Ave., Clovis – Mon. thru Fri. 8 a.m. to 5 p.m. /Sat. 8 a.m. to 1p.m.\n> 3. Fitness Quest Health Club – 1601 10th St. Reedley – Mon., Wed., Fri. 8a.m. to 1p.m./ 5:30 p.m. to 9:00 p.m.\n/Tues. & Thurs. 5a.m. to 1p.m./5:30p.m. to 9p.m. / Sat. & Sun. 8a.m. to 12p.m.\n> 4. Fresno County Republican HQ’s. – 770 E. Shaw Ave., Fresno – Mon. thru Fri. 11a.m. to 5:30p.m./Sat. 1p.m. to 5p.m.\n> 5. PRK Arms – 1401 N. Clovis Ave., #101, Clovis – Tues. 10a.m. to 6p.m./Wed thru Fri.10a.m. to 5p.m. / Sat.10a.m. 3:45\n> 6. Sinclair Gas Station – 5605 E. Kings Canyon Ave., Fresno – Sun. thru Fri. 6a.m. to 9p.m\n> 7. Svensk Butik Gift Shop – 1465 Draper St., Kingsburg – Mon. thru Sat. 9a.m. to 5p.m.\n> 8. Tactical Practical – 4552 N. First St., Fresno – Mon. thru Sat. 10a.m. to 6p.m.\n> 9. The Firing Line – 1173 Dayton Ave., ##103A, Fresno – Mon. thru Sat. 10a.m. to 7p.m.\n> 10. The Range – 5151 N. Gates Ave., Fresno – Mon. thru Sat. 10a.m. to 8p.m.\n> 11. Turner’s Outdoorsman – 6264 N. Blackstone Ave., Fresno – Mon. thru Sat. 10a.m. to 6p.m.\n> 12. Uncle Sam’s Fire Arms – 4702 N. Blackstone, Fresno Tues. thru Fri. 10a.m. to 6p.m. / Sat. 9a.m. to 4p.m.\n\n\nEdit 2: I just re-visited the site. Seems like they finally got around to scrubbing their site completely. Good thing I completely scraped their site as proof of my facts."}