{"title": "How do you get Trump supporting family members to realize that Trump is not perfect?", "score": 9, "id": "jaxjdw", "url": "https://www.reddit.com/r/democrats/comments/jaxjdw/how_do_you_get_trump_supporting_family_members_to/", "num_comments": 6, "created": 1602696979.0, "selftext": "This man is the embodiment of the people I know: \n https://youtu.be/bAnG517uAP8\n\nI am a 17 year old girl and I live in a conservative town, and I am surrounded by mostly conservatives. I engage in a lot of discussions with family members and friends about politics. Most have stayed civil, although some have turned into a much older family member going on some angry rant about the lack of intelligence that carries through my generation. Now, obviously I can’t say much to that. My generation(Gen Z) has not had any real moments of non stupidity, but for now I can use the excuse that we are still a relatively young generation. But, aside from this I have found that older family members discount everything that I have to say. When we partake in political conversations I am meant to listen to them, but when I speak about anything it’s like their ears cease to exist. And this truly bothers me, because each time they get angry with me they make these sweeping statements that I am simply a stupid teen who listens to all of the liberal media because it is trendy. In those moments I can tell that not once did they actually try to hear me out. Not once did they possibly think that maybe I had something relevant and important to say, that could add to conversation at hand. I understand that at 17 I am on the precipice of adult hood. I have not experienced adult hood yet. I am still reliant on my parents in many ways, and this next year is going to be a struggle as I enter adulthood and become more independent. But, I don’t understand how being a teen total excludes me from the conversations. It seems that they believe thinking for yourself starts when you’re an adult. \n\nOverall, it somewhat angers me at times. It seems that they have continued to support Trump almost out of this spite of liberals. All I constantly hear is them throwing insults about liberals, and at this point it is embarrassing. I am very aware that liberals are not perfect. No groups is, but when a good majority of your political belief is built off of this notion of simply triggering liberals you become the immature one, not me or the other side.\n\nAnd it causes anxiety in some areas. Because I can see at times that the things they say are borderline racist if not racist. And the problem with me realizing this is that sometimes I evaluate myself, and I think, \"what if they are right? What if being liberal leaning has turned me into this, and that is why I view what they are saying as racist ?\". I think about this quite often, but that second guessing was taken away the day that a family friend began yelling at the screen n**er when one of his 2k21 players did not work properly or something(I don’t play video games). He repeated it over and over saying words like dumb n**er. I did not say anything because he gets very angry when he plays video games and I was not about to deal with that.\n\nBut Everything just worries me. To me it seems that things are regressing. Sometimes for comfort I revert back to these childish ideas of everything and everyone just being peaceful. I truly don’t understand why we cannot all just be kind. It is literally that simple. Just be kind. It’s saddening to see the people around me buy into these delusions and say the most hateful things."}