{"name": "__concerned", "posts": [{"subreddit": "politics", "text": "We've Been Headed Here Since Ronald Reagan Made His First Joke About 'The Government'\n", "time": 1607057318.0}, {"subreddit": "republicans", "text": "Bill Barr Did WHAT? How Is This Not The Biggest Story In The Country Right Now?\n", "time": 1605836263.0}, {"subreddit": "republicans", "text": "The Republican Party Is Dead. It’s the Trump Cult Now.\n", "time": 1605551065.0}, {"subreddit": "republicans", "text": "All the President’s Lies About the Coronavirus\n", "time": 1605473681.0}, {"subreddit": "republicans", "text": "Donations under $8K to Trump ‘election defense’ instead go to president, RNC\n", "time": 1605201694.0}, {"subreddit": "politics", "text": "Federal judge to force USPS&#x27;s DeJoy to explain mail voting problems\n", "time": 1604528837.0}, {"subreddit": "politics", "text": "Two more Texas AG senior aides fired after Ken Paxton accusations\n", "time": 1604370091.0}, {"subreddit": "politics", "text": "Trump Can’t Stop Talking About How He Plans to Steal the Election\n", "time": 1603932222.0}, {"subreddit": "politics", "text": "Six men charged in alleged plot to kidnap Michigan Gov. Gretchen Whitmer\n", "time": 1602174668.0}, {"subreddit": "politics", "text": "Alexander Vindman: Trump Is Putin’s ‘Useful Idiot’\n", "time": 1600100529.0}, {"subreddit": "politics", "text": "College Republicans Raise Money for Alleged Murderer Kyle Rittenhouse\n", "time": 1598889994.0}, {"subreddit": "politics", "text": "Steve Bannon, three others charged with fraud in border wall fundraising campaign\n", "time": 1597932301.0}, {"subreddit": "politics", "text": "Rewriting the limits of presidential powers\n", "time": 1597673792.0}, {"subreddit": "politics", "text": "Here’s Every Time Donald Trump And Ghislaine Maxwell Have Been Photographed Together\n", "time": 1595383243.0}, {"subreddit": "politics", "text": "Supreme Court Rules Trump Cannot Block Release of Financial Records\n", "time": 1594304749.0}, {"subreddit": "politics", "text": "Trump’s taxes may be released to grand jury, supreme court rules – live | US news\n", "time": 1594304677.0}, {"subreddit": "politics", "text": "Supreme Court rules New York prosecutor can get Trump's tax returns â\u0080\u0094 NBC News\n", "time": 1594304386.0}, {"subreddit": "politics", "text": "Deutsche Bank Settles Over Ignored Red Flags on Jeffrey Epstein\n", "time": 1594132623.0}, {"subreddit": "politics", "text": "Trump Fires U.S. Attorney Who Investigated His Associates\n", "time": 1592682758.0}, {"subreddit": "politics", "text": "Barr says at his request, Trump has removed Geoffrey Berman as U.S. attorney in Manhattan â\u0080\u0094 The Washington Post\n", "time": 1592682736.0}, {"subreddit": "politics", "text": "George Floyd’s family says Minneapolis officers should face murder charges amid national outcry\n", "time": 1590593451.0}, {"subreddit": "politics", "text": "Judge in Flynn case takes unusual step of allowing 3rd party briefs\n", "time": 1589331603.0}, {"subreddit": "politics", "text": "The sick joke of Donald Trump's presidency isn't funny any more | Richard Wolffe | Opinion\n", "time": 1584130466.0}, {"subreddit": "politics", "text": "Christopher Steele Whacks Mueller Report and ‘Bad Faith’ Team Trump\n", "time": 1583606521.0}, {"subreddit": "politics", "text": "Really looking forward to an untethered Dr. Fauci. I have to hope that things will improve after a very dark winter.", "time": 1607092994.0}, {"subreddit": "politics", "text": "Thank you for your service to America and your community.", "time": 1607058515.0}, {"subreddit": "republicans", "text": "But she makes an exception for a certain adulterer who porked a pornstar while his wife healed from pregnancy. But by God, this woman is principled!", "time": 1607056603.0}, {"subreddit": "republicans", "text": "Is this a real quote? Slavery was a part of American capitalism and it remains a part of global capitalism today. Very ignorant.", "time": 1606944024.0}, {"subreddit": "politics", "text": "This is why Trump's pardons need to challenged in court.", "time": 1606862838.0}, {"subreddit": "politics", "text": "It's not so much that he wasn't qualified, it's that he lied to the American people about a deadly pandemic that he contributed to exacerbating.", "time": 1606833140.0}, {"subreddit": "politics", "text": "bOtH sIdEs tho", "time": 1606744028.0}, {"subreddit": "republicans", "text": "I thought we shouldn't trust the Deep State?", "time": 1606743200.0}, {"subreddit": "republicans", "text": "They'll dream of building a future without another homicidal maniac as president.", "time": 1606683636.0}, {"subreddit": "republicans", "text": "rolf", "time": 1606001007.0}, {"subreddit": "republicans", "text": "Does the Republican Party have anything to offer other than low effort memes and Trump idolatry?", "time": 1605981087.0}, {"subreddit": "politics", "text": "\"I want you to do us a favor though.\"", "time": 1605797485.0}, {"subreddit": "politics", "text": "Of course, we know this already. However, it does underscore the malice aforethought.", "time": 1605797313.0}, {"subreddit": "republicans", "text": "The very first sentence of this \"article\" is a lie. Gore actually said the following during an interview: \"During my service in the United States Congress, I took the initiative in creating the Internet.”\n\nObviously, the wording is strange. In context, this was about policy he supported. Most relevant is his 1991 High-Performance Computing and Communications Act, which he had pushed for years before it was eventually signed by the elder Bush.\n\nIf the very first sentence of the opinion piece you share is a lie, it doesn't bode well for the rest of it; it should also cast doubt on the credibility of the author.", "time": 1605715580.0}, {"subreddit": "politics", "text": "Many Republican governors are doing an awful if not evil job with it. Some notable exceptions are Phil Scott, DeWine, and Hogan.", "time": 1605677947.0}, {"subreddit": "republicans", "text": "1. Trump maliciously bungles federal handling of the pandemic.\n2. Pandemic explodes, necessarily upping demand for mail-in ballots.\n3. Trump sabotages the US Postal Service.\n4. Chaos.\n5. Trump claims the chaos he created is reason enough to doubt the integrity of the election.", "time": 1605677536.0}, {"subreddit": "republicans", "text": "What a bizarre string of words. Get some sleep and try again.", "time": 1605474764.0}, {"subreddit": "republicans", "text": "Did you read the post? There is no mention of it. For the record, his use of the word \"hoax\" was, as ever was his intent, to downplay concern over the virus.", "time": 1605474635.0}, {"subreddit": "republicans", "text": "I won't delve into every reason why your comment is disengenuous. The most important reason is that the claim that \"everyone knew about covid19 and how contagious it is\" is plainly wrong. Moreover, it is telling that you refuse to assign blame to leaders; it's as if you believe that leaders have no power to ... lead. Bizarre.", "time": 1605474075.0}, {"subreddit": "republicans", "text": "You've yet to point out a specific point that you disagree with on the basis of fact, because you are a propagandist. You simply aren't interested in the truth; I sincerely hope lurkers will see through it.", "time": 1605473839.0}, {"subreddit": "republicans", "text": "I have already stated that China's actions does not preclude the reality that the president chose self preservation over national protection.\n\nStop deflecting.", "time": 1605376502.0}, {"subreddit": "republicans", "text": "My god, how pathetic do you have to be to stand by a failed leader whose actions have directly caused untold suffering? I have already provided details, but they are ignored by cultists like you.", "time": 1605376410.0}, {"subreddit": "republicans", "text": "Even if your wildest conspiracy theories were true, it would not preclude that Trump is responsible for the depth of and breadth of damage.\n\nTrump knew in November and chose to lie to America for months. Trump chose to downplay the danger publically while privately admitting the serverity of the disease.\n\nNo lies from me, just cold hard facts. Doesn't matter what Pelosi or any of his political opponents said, bottom line is that Trump betrayed the nation for personal gain.\n\nI may never understand why people like you exist, but I hope that people learn the truth of why we are doing worse than any other country on Earth.", "time": 1605308176.0}, {"subreddit": "republicans", "text": "\"Yes, because if Hillary had been in charge no one would have died.\"\n\nSeen this refrain a million times; be honest or come up with fresh deflections. Trump is the president. His government is why Americans are suffering to such great extent.\n\nPlease note that I honestly don't care if you don't care; it just means you're hopeless. My hope is that someone under the Republican spell will see this exchange and wake the fuck up.", "time": 1605301870.0}, {"subreddit": "republicans", "text": "This makes sense if you live outside of reality, or a mile under the Moon's surface.\n\nTrump's avarice and ego has caused the death of some 243K of my compatriots; and, that ain't the half of it.\n\nTrump lost by over 5 million popular votes, because people are sick of his treachery.", "time": 1605298152.0}, {"subreddit": "republicans", "text": "> All I said was I wanted to know that the election was done right, why are you so against that?\n\nOh please, unless you've recently awoken from four years of sleep, it's quite clear that you are being disengenous. Seriously, I see through your sophistry as one sees through a freshly washed window.\n\nFor the genuinely curious, here is what has happened in America:\n* First three years: Trump administration weakens scientific institutions by filling leadership positions with cronies, purging scientists, and perverting missions.\n* November 2019: Trump receieves Intel on burgeoning pandemic\n* January, February, March 2019: Trump and his Republican party lie to the American people about the lethal threat of sarscov2\n* March 2019: Trump institutes too-late, partial travel bans\n* Trump delayed usage of the Defense Product Act\n* Trump accuses doctors of lying about hospital conditions\n* Trump refused to coordinate distribution of critical materials among the states, instead leaving them to fight each other\n* Trump takes no responsibility whatsoever.\n\nI could go on. For all this and more, at least 237K of my compatriots are dead. There's a reason we are fairing worse than any nation on this Earth: it's the politicization of a pandemic by the Trump administration and the Republican party. If you're an actual conservative reading this, then you hopefully already recognize that White House propaganda cannot defeat the reality of our collective misery.", "time": 1605235684.0}, {"subreddit": "republicans", "text": "What a joke. The only cheating taking place is right out in the open: it's known as voter suppression or theft of franchise. Ever since SCOTUS neutered preclearance from 1965 VRA, the states that couldn't be trusted when buck wild with violating the Will of the People.\n\nSpare us the concern trolling.", "time": 1605217968.0}, {"subreddit": "republicans", "text": "The reason he didn't was to distract from the millions of taxpayer dollars funnelled into his properties.", "time": 1605211123.0}, {"subreddit": "republicans", "text": "Trump Devotion Syndrome", "time": 1605211082.0}, {"subreddit": "republicans", "text": "For the Americans swinging buy, the above is pure propaganda. For the record, Trump funnelled millions more than his salary into his properties. Don't believe the hype.", "time": 1605211036.0}, {"subreddit": "republicans", "text": "Ok buddy", "time": 1605210965.0}, {"subreddit": "republicans", "text": "This man is unhinged from reality.", "time": 1605202292.0}, {"subreddit": "republicans", "text": "Does anyone even try here?", "time": 1605202139.0}, {"subreddit": "republicans", "text": "The sentiment is valid. The \"legally cast ballots\" refrain is merely a rhetorical tool meant to cast doubt on the integrity of the election.", "time": 1605202091.0}, {"subreddit": "politics", "text": "Wawa was the place to go in PA. Used to live in VA and was Sheetz there.", "time": 1605200342.0}, {"subreddit": "politics", "text": "Facts Don't Care About Your Feelings™", "time": 1605156973.0}, {"subreddit": "politics", "text": "Thanks.", "time": 1605156738.0}, {"subreddit": "politics", "text": "More importantly, Phizer has not published their data for peer review yet. Also, some important observations:\n\n>Here’s what we know so far: According to a press  release from Pfizer, the phase 3 clinical trial of its vaccine candidate  is partially complete, with 38,955 of the 43,538 participants having  received two injections of the candidate or a placebo. So far, 94 of  those participants have developed Covid-19; the Washington Post [reports](https://www.washingtonpost.com/health/2020/11/09/pfizer-coronavirus-vaccine-effective/)  that fewer than nine of those cases were in people who had received the  actual injection, which is where the 90% efficacy figure comes from.  \n>  \n>But to a public health organization like the US Centers for Disease Control and Prevention (CDC), *efficacy* and *effectiveness* [mean two different things](https://www.cdc.gov/csels/dsepd/ss1978/lesson3/section6.html).  “Efficacy” is what is demonstrated, to varying degrees, by a vaccine in  a randomized trial like Pfizer’s. The same vaccine’s “effectiveness*”* is  based on observational studies, once the shot is deployed in the real  world. A vaccine’s effectiveness may not be the same as its efficacy.\n\n[https://qz.com/1930285/what-does-90-percent-effective-mean-for-pfizers-covid-19-vaccine/](https://qz.com/1930285/what-does-90-percent-effective-mean-for-pfizers-covid-19-vaccine/)", "time": 1604987178.0}, {"subreddit": "politics", "text": "yet, he chose not to fight it.", "time": 1604986823.0}, {"subreddit": "politics", "text": "Is it just me, or does Dr. Bright look like NewHour's William Brangham with gray hair?", "time": 1604986717.0}, {"subreddit": "politics", "text": "Bernie for Labor Secretary!", "time": 1604782506.0}, {"subreddit": "politics", "text": "Thank you! IDK why, but the media seems afraid to acknowledge this. We're, white, we're brown, and we're black. It's somewhat slippery of a term, but I suppose all racial and ethnic terms are.", "time": 1604680496.0}, {"subreddit": "politics", "text": "Why isn't he in jail? Is it because he's rich?", "time": 1604624330.0}, {"subreddit": "politics", "text": "Thanks for the reality check 👍🏼", "time": 1604589037.0}, {"subreddit": "politics", "text": "Who is organizing these protests? Are the organizers even American?", "time": 1604588900.0}], "republican_score": 30, "democrat_score": 0}