{"name": "becauseianmademe", "posts": [{"subreddit": "republicans", "text": "Everyone republican is racist!!!\n", "time": 1605406832.0}, {"subreddit": "republicans", "text": "To be honest, most conservative people have stopped watching Fox news.  Both are just as one sided.  We don’t want that.  Conservatives want all of the facts and we want to draw our own conclusions.  When a new argument is presented, we tend to research the source.  \n\nLiberal people tend to be title readers.  Not all, but definitely the vast majority.  Look at r/politics, the article will say something like “video debunked” and the comments below are like “Trump and Guiliani are pieces of shit!” followed by “yeah, good one man!”   Not one person on there would dare say “which source do you think is telling the truth?”  You don’t care who’s telling the truth.  You inherently believe your dishonest sources.  Its pathetic.", "time": 1607153149.0}, {"subreddit": "republicans", "text": "I feel like this is flipped.  “Fiscally conservative” is mostly what you are calling republican.  \n\nThe voting issues you have listed as conservative are general viewpoints the republican party decided to side with to gain different demographics of voters.  \n\nI think you are fiscally conservative.", "time": 1607047899.0}, {"subreddit": "republicans", "text": "The “evidence” in that video is all bs.  If you thought that was factual, you might be brainwashed.  This is a second hand source, but it gives good visuals.  The debt has been steadily growing for decades.  A Republican or democrat president has not effected this.  \n\nhttps://www.visualcapitalist.com/americas-debt-27-trillion-and-counting/", "time": 1607044337.0}, {"subreddit": "republicans", "text": "Vote Georgia!  Use your voice!", "time": 1607009892.0}, {"subreddit": "republicans", "text": "Why is this video on the republican sub?  Its a whiny democrat with 0 evidence of his claims", "time": 1607009638.0}, {"subreddit": "republicans", "text": "That guy’s a genius!!  He almost had a single argument by the end of the video", "time": 1606972705.0}, {"subreddit": "republicans", "text": "Youtube should flag this.  Joe Biden would never say these anything racist....", "time": 1606957128.0}, {"subreddit": "republicans", "text": "Sounds like democrat propaganda to me.  Republicans should most definitely vote.  They should show up in record numbers and voice their opinions.", "time": 1606938238.0}, {"subreddit": "republicans", "text": "With all of the controversy right now, they should make this in person only.  Just cut the bs", "time": 1606934956.0}, {"subreddit": "republicans", "text": "You are also correct, the rich should share the wealth.  They should give people the opportunity to earn some of their hard earned money.  They should provide high wages and good benefits to their hard working employees.  They should also donate to people that can not work for specific reasons.  They should not freely give their hard earned money to wherever the government wants to throw it away.  \n\nOn the other hand, people have the right to vote for whoever they want.  Some choices just make more sense than others.", "time": 1606858754.0}, {"subreddit": "republicans", "text": "Lol!  The election will always be “held hostage” by something.  Right now its the electoral college.  Learn how to use it rather than fighting against it.  \n\nAlso watch the flip throughout history in this video.  We need stronger candidates that represent our nation and all of its people.  It has happened a few times in the past \n\nhttps://m.youtube.com/watch?v=8PZNP1KUwuM", "time": 1606843772.0}, {"subreddit": "republicans", "text": "I said educate yourself.  But if i must...\n\nIn the first few elections, the US noticed an issue with the balance of power.  They noticed the dense cities tended to have a very different perspective than the rural states.  Both served important roles and needed to remain unified as more than just trade partners.  Also being unified made them a stronger force for opposing threats.  Even though most of the cash crops were farmed in the rural southern states, they were underrepresented in policy.  States like RI also had no voice in the US.  This country was founded on everyone having a voice, but this was not the case.  Dense populations have different needs than rural, but both need equal representation to keep the balance (trade, power, policy, etc.). Up to the civil war, dense population states wanted more power because they had more people.  They tried to use this to leverage the southern states to change their policies.  The tension and lack of representation lead to the south attempting to succeed from the US.  It’s pretty obvious today how local community/grass roots propaganda play into how each person votes.  If we remove the electoral college and hand the power to the dense populations, it will eventually severely damage our economy and possibly lead to a 2nd civil war.  Dense populations like California and New York will make all of the rules.  The under representation will lead to tension.  The entire middle will attempt to succeed from the US.  You say no big deal, the US military will stop that.  We found in the first civil war that southern soldiers fought for the south.  Theres a lot of holes in my giant 1 paragraph summary.  Please use this as a start to educate yourself.", "time": 1606774090.0}, {"subreddit": "politics", "text": "Finally.  He could use some of that", "time": 1606772608.0}, {"subreddit": "republicans", "text": "My kids are too young.  They are very happy playing with kids of all colors, they don’t see a difference.  \n\nWe will teach them to understand that not all evidence is presented in the first news article.  The news is almost entirely opinion based.  If they are interested in a movement, they will be taught to have enough patience to watch the entire story unfold before reacting.  They will be taught to dive deep into researching controversial topics before voicing their opinions.  Protests are important to keep our political system in check.  They will be taught to study and understand what they will be protesting *in college* and how to do it within the law.  My kids are not sheep.", "time": 1606757654.0}, {"subreddit": "republicans", "text": "What happened in Northern Alaska?  Or is it just that frozen?  Lol", "time": 1606755905.0}, {"subreddit": "republicans", "text": "That’s exactly what New York and Pennsylvania said in the 1800’s.  Please educate yourself.", "time": 1606755853.0}, {"subreddit": "republicans", "text": "Nightmares of the Clinton administration...That was terrible.  4 more years of dreaming and waiting for a president that looks out for his/her citizens.  4 years of praying that Kamala doesn’t kill off poor old Joe and bend us over.  3 1/2 years of peaceful nights without riots from enraged incompetent liberals.", "time": 1606718620.0}, {"subreddit": "republicans", "text": "So now i have ethics?  Your arguments are all over the place.", "time": 1606685146.0}, {"subreddit": "republicans", "text": "That policy is called “work ethic.”  \n\nI have plenty of compassion for those that cannot help themselves.  We are discussing people who entered a debt contract on their own, got the education they were promised, and are not willing to pay for it.  This is an unfair deal for the USA.  No handouts for bad decisions.", "time": 1606681504.0}, {"subreddit": "republicans", "text": "If someone was making a good wage and had all debt paid, why would they vote for liberal policies?  That is *absolutely* counterintuitive", "time": 1606667083.0}, {"subreddit": "republicans", "text": "The difference is: *generally* conservatives are more likely to take responsibility for their debt.  They are more willing to work hard and pay for what they owe.", "time": 1606614229.0}, {"subreddit": "republicans", "text": "Leave this poor old man alone!! He has dementia for heavens sake!", "time": 1606542482.0}, {"subreddit": "republicans", "text": "Tbh- String theory seems like a made up bunch of bs to make certain people sound smarter than they are.  Have you studied it?   🤷‍♂️", "time": 1606542436.0}, {"subreddit": "republicans", "text": "He is the strongest candidate.  Meaning he is not afraid to stand up to other global powers - and they know it.  Not only are we safer with him as president, but we are reversing some of the trade deficit.  We are keeping jobs in America - which should be the number one priority for the leader of any nation.  He says very stupid comments publicly, but his actions are all very rational.  His actions are similar to those of Teddy Roosevelt - insane, but respectable.  \n\nI think the most appealing point is no one can buy Donald Trump.  He’s going to do what he feels is right for our country.  Most everything he has done (not said) aligns with the direction I feel our country needs to be moving.", "time": 1606328095.0}], "republican_score": 24, "democrat_score": 0}