{"name": "jvoom", "posts": [{"subreddit": "democrats", "text": "That is amazing.", "time": 1607096420.0}, {"subreddit": "politics", "text": "I’m as liberal as they come and obviously this is all nonsense. But she’s suddenly my hero.", "time": 1607054370.0}, {"subreddit": "republicans", "text": "Oh man. Burn. I don’t know how to handle your witty retort.", "time": 1606858502.0}, {"subreddit": "republicans", "text": "Woosh. The FBI thing went no where fast!  Look at Bill Barr no fraud that could change election.", "time": 1606852634.0}, {"subreddit": "republicans", "text": "Interesting. In May, I contracted covid-19. I’m in my late 30s, for years I’ve run 5-6 times a week, including multiple marathons per year and a sub 20 minute 5k time. Nothing super impressive, but I was fit. 13 days of fever at 103 or higher, I eventually recovered mostly, but now it’s still hard to breath. My running has considerable suffered. \n\nThere is a virus.", "time": 1606841017.0}, {"subreddit": "republicans", "text": "If  10,000 affidavits saying they saw fraudulent votes cast actually existed, people would take it seriously. But none of the affidavits say that. Instead, they take mundane things or complete misunderstanding of the process and say “whelp, must be fraud”. \n\nThe courts are soundly rejecting this “evidence” because it’s conclusory. It’s not the saw the guy shoot someone like you try to analogize it with. It’s just not.", "time": 1606830105.0}, {"subreddit": "republicans", "text": "Whether either happened or not. \n\nIn the Michael Brown case you don’t believe the 22 eyewitnesses who say differently. \n\nBut for the election, you believe all the witnesses without a doubt?\n\nWhy is that? The election stories have all been either proven to be a lie also or are just gigantic leaps to conclusions that they have no basis in reality in the first instance.", "time": 1606827888.0}, {"subreddit": "republicans", "text": "Good luck with that. \n\nThey keep using Colonol Phil Waldron as an expert. He’s been introduced as a statistician and a cyber security expert. In the real world, he was a combat officer than now owns a distillery. He is not a cybersecurity expert or a statistician. In the real world, his opinions on these issues are worthless. \n\nHe also claimed some stuff about Chavez. That even if it happened (it didn’t, but I’ll give you the benefit of the doubt here), what does it have to do with November 3?  Something happening years ago in another country does not mean it happened here. Proof requires much more than that. \n\nThis is getting more and more anti-American. First refuse to listen to the vote. Then the courts. You might as well rip up the constitution.", "time": 1606795342.0}, {"subreddit": "republicans", "text": "Your view is super close minded. Because you didn’t see people in your bubble enthused for Biben makes it not so?  Also, that feeling you have doesn’t make any of this unfair or fraudulent at all.", "time": 1606786975.0}, {"subreddit": "republicans", "text": "Wait, what? You suggest people moving to a different county to make county population equitable would for some reason make this “fair”?", "time": 1606786903.0}, {"subreddit": "republicans", "text": "I don’t need the Pennsylvania hearing broken down for me. I’m an attorney that has practiced for 15 years. Their little play date has no legal significance whatsoever and an overwhelming majority of their own party in the House ignored it. \n\nInstead, I’ll focus on the claims made in court. The place where we do these things according to the constitution. \n\nThe affidavits in all of the cases are utter garbage. In Michigan they make up counties that don’t exist. The so called expert witness have literally zero chance of ever being qualified as an expert.  All of the affidavits are purely conclusory. Saying I saw “X” so that means there must be fraud satisfies no standards of proof. Instead, there must be an actual showing that votes were cast fraudulently. \n\nI know a lot of people want to play lawyer and judge here. But there is no proof. None. Your failure to understand that is, in fact, your problem.", "time": 1606786794.0}, {"subreddit": "republicans", "text": "Literally nothing.", "time": 1606781013.0}, {"subreddit": "republicans", "text": "That happened after the government took their land to get the oil, right? But they are the grifters?", "time": 1606781001.0}, {"subreddit": "republicans", "text": "Literally everything has been politicized lately. A guy couldn’t take a knee for something he believed in without causing a national story. Not surprisingly, politicizing literally everything drove people to participate in politics.", "time": 1606780949.0}, {"subreddit": "republicans", "text": "More people voted than registered. Lie. \n\nMore people voted than live in counties. Lie. \n\nFraud happened. Lie. \n\nBut the burden of proof is on the person making the claims of fraud or illegitimacy. I get that you don’t know how to debate or argue, but that’s your problem, not anyone else’s.", "time": 1606780871.0}, {"subreddit": "republicans", "text": "Well, state legislators are not fact finders. So what’s the purpose of this hearing besides an announcement that their collective feeling were hurt? There’s no legal vehicle for the legislature to change the results.", "time": 1606780759.0}, {"subreddit": "republicans", "text": "Resolutions are effectively legally meaningless in this instance. It’s essentially a statement saying “this is how we feel”. Their draft resolutions I’ve read also admit that they can’t appoint electors. \n\nThey had to go resolution route because they wouldn’t pass legislation. But even if they somehow did, it would be vetoed. \n\nThis is nothing more than a ploy. It’s comical that they think they can challenge the presidential election but nothing else on the same ballots. If they invalidated the entire ballot, effectively the PA house and senate would cease to exist.", "time": 1606661222.0}, {"subreddit": "politics", "text": "This is 2020.", "time": 1606590139.0}], "republican_score": 15, "democrat_score": 1}