{"name": "hreindyr", "posts": [{"subreddit": "politics", "text": "\"I’m going to do my best to keep it together because it is all. Gone. Too. Far. All of it!\" GA official slams GOP and trump.\n", "time": 1606868524.0}, {"subreddit": "politics", "text": "Capitalism can crack climate change. But only if it takes risks\n", "time": 1534424284.0}, {"subreddit": "politics", "text": "General Wesley Clark: Wars Were Planned - Seven Countries In Five Years (X-post from Videos)\n", "time": 1377692111.0}, {"subreddit": "republicans", "text": "I can't believe how many candidates voted twice.", "time": 1606949309.0}, {"subreddit": "republicans", "text": "Traitor", "time": 1606022415.0}, {"subreddit": "republicans", "text": "The GOP won't get it unless we show them we mean business. This is how nations fall. It is a call to arms.", "time": 1606021821.0}, {"subreddit": "politics", "text": "Congratulations from Iceland!!", "time": 1604768831.0}, {"subreddit": "politics", "text": "Right on! The problem is when people get so bought into an ideology that threre is no conversation to be had. There are many angles to be discussed and reasonable people criticising from all angles is what makes a society function. But I get tired trying to build a better society for everyone when people don’t want to participate. I pay my taxes proud. I have done a good thing. I have paid for a teacher, a doctor, or treatment for somebodies cancer.", "time": 1594422732.0}, {"subreddit": "politics", "text": "The whole concept of a society is socialistic by definition. Together we build something bigger than we can do alone. Taxes fund common service like police, firefighters, military and roads. In more socialist countries than the US like *all of Europe*, taxes also fund education, water & sewage, garbage collection, public transportation, electric infrastructure, postal services and healthcare. That has nothing to do with Stalin or Mao. It is just common sense no matter where you lie on the political spectrum in Europe. Unless, of course, you listen to American right wing media. I have been many times to Miami, and I am quite taken aback how the older generation of Cubans is hard core conservative. I find it very strange. But then again, the poor rural whites vote against the very healthcare they desperately need. Even from their MedicAid wheelchairs.", "time": 1594391748.0}, {"subreddit": "politics", "text": "You are joking right? It's not the same rally. lol.", "time": 1592784722.0}, {"subreddit": "politics", "text": "The guy even held the book upside-down.", "time": 1591733068.0}, {"subreddit": "politics", "text": "I also think this has a lot to do with the rural vs. city division. The small towns mourn the brain drain which takes their educated best and brightest to the cities for opportunities that their towns simply cannot have. Hence the cities are often viewed with hostility and are talked about as some liberal hell-holes. This also makes higher education frowned upon as it increases the risk of that flight. Source: Friends from small towns.", "time": 1588736886.0}, {"subreddit": "politics", "text": "> Well, I’m sorry that your parents didn’t care about your education enough to try to live in a good school district,\n\nIn the US, public schools often get a majority of their funding through local property taxes. This means that the more affluent neighbourhoods have better funded schools. Poorer parents cannot just simply *choose* a better school district.", "time": 1588736145.0}], "republican_score": 3, "democrat_score": 0}