{"name": "chainfires", "posts": [{"subreddit": "republicans", "text": "Please continue to be a wanker, its very entertaining. Dont forget to wipe the liberal c-u-m off your smirk.", "time": 1607147873.0}, {"subreddit": "republicans", "text": "Are you really this dense? All Americans regardless of their political leanings should be interested and demand free and fair elections. \n\nOf course when the candidate you want wins, you don't care, you will do the exact same thing if the result was not what you wanted. Liberals are such hypocrites.", "time": 1607141617.0}, {"subreddit": "republicans", "text": "The coverup and denials have already started. How PolitiFact can claim none of it true is insane:\n\n[https://www.politifact.com/factchecks/2020/dec/04/facebook-posts/no-georgia-election-workers-didnt-kick-out-observe/](https://www.politifact.com/factchecks/2020/dec/04/facebook-posts/no-georgia-election-workers-didnt-kick-out-observe/)", "time": 1607141464.0}, {"subreddit": "republicans", "text": "AZ here too.  I  too am ready.\n\n&#x200B;\n\nLong Live The Republic !", "time": 1607141098.0}, {"subreddit": "republicans", "text": "Not much of a surprise. Brainwash them early and reinforce that your feelings are what matter, not logic and common sense and you got a Demoncrat voter for life.", "time": 1607140603.0}, {"subreddit": "republicans", "text": "Its more than that.\n\n&#x200B;\n\n For AZ the margin is only about 10,400 at the moment.  \n\n\nTwo easy ways to get rid of that margin and Trump would easily win:  \n\n\n(a) Investigate the cash for votes on the reservations:  \n[https://epochtimes.today/illegal-money-for-votes-raffles-conducted-in-several-states-in-2020-election/](https://epochtimes.today/illegal-money-for-votes-raffles-conducted-in-several-states-in-2020-election/)\n\nThat's several thousands of votes right there. Last I checked its illegal to offer anything of value for a vote, like money or gift or anything at all.  \n\n\n(b) Around 14,000 people voted with \"federal only\" votes.  \nThese  are votes where they cant prove citizenship but are allowed to vote.  They are supposed to be audited and send in ID but I bet they were not.", "time": 1606989129.0}, {"subreddit": "republicans", "text": "Excellent. Hopefully soon we will see if the Republicans actually do something about it.\n\nIf they do nothing and just talk, the Republic is lost. 88% of Republicans voters believe the election was stolen. If this isn't fixed AZ will never have a Republican governor again.", "time": 1606988856.0}, {"subreddit": "republicans", "text": "Thats not much of an argument for no fraud.\n\n&#x200B;\n\nIf you had a car and you parked that car and then went into a store, when you came back out your car was missing. So you assume your car was stolen, you call the police etc but there is no evidence your car was stolen. So was the car stolen or you just cant see your car?\n\nSame idea with voter fraud.", "time": 1606988598.0}, {"subreddit": "republicans", "text": "Never. Democrats are such narcissists  that they can do no wrong and everything is someone else's fault.", "time": 1606902318.0}, {"subreddit": "republicans", "text": "Of course it is. Biden chooses people based on diversity for the sake of diversity, not merit like Conservatives or Republicans.", "time": 1606902150.0}, {"subreddit": "republicans", "text": "If Biden is under investigation by the feds can he still be sworn in?", "time": 1606901951.0}], "republican_score": 11, "democrat_score": 0}