{"name": "ChildCrippler69", "posts": [{"subreddit": "republicans", "text": "Liberal Nicknames\n", "time": 1605054466.0}, {"subreddit": "republicans", "text": "I can't access the site, please tell me this is real", "time": 1607107691.0}, {"subreddit": "republicans", "text": "Funny how we have shit like this and the left just goes \"debunked\" and everyone believes it's fake", "time": 1607092381.0}, {"subreddit": "republicans", "text": "This is why I bought my gun, I'm ready", "time": 1607091138.0}, {"subreddit": "republicans", "text": "Thanks", "time": 1607089686.0}, {"subreddit": "republicans", "text": "Just read a leftist article about this, trying to debunk his claims because he had ghosthunting videos on his YT channel. They really will try anything to disprove fraud.", "time": 1607016918.0}, {"subreddit": "republicans", "text": "Based", "time": 1607016232.0}, {"subreddit": "republicans", "text": "I can't get to the site, is this satire? Because I don't see any other sources supporting this", "time": 1607007892.0}, {"subreddit": "republicans", "text": "You understand that Biden was part of the Parris Climate Accords and the Iran Nuclear deal right? And that the US has been decreasing it's effect on climate change over the past few years. We've got to worry about the 100 corporations along with India and China, who are responsible for a big chunk of pollution. And yeah, I prefer Trump over the Pelosi/Harris combo. #1 Pelosi is a fucking child in an 80 yr old's body who would rather let the American people suffer without financial aid  because signing another stimulus check package would make Trump look good. Honestly fuck that piece of shit excuse of a human being, I don't care who you are or what party you belong to, if you're a politician, you put the American people above your fucking feelings. And #2 Harris is racist against her own goddamned race, not to mention that she would bring more division of the American people because of the current state of things here with the things she supports and wants to enact.", "time": 1606924338.0}, {"subreddit": "republicans", "text": "No, I do care about the planet and I don't believe in clean coal. Biden is an idiot and already proved that when he was VP. He won't do anything good for the Earth and he will also probably be removed from office in a few months by the Pelosi and Harris power couple.", "time": 1606922431.0}, {"subreddit": "republicans", "text": "You obviously didn't read the article", "time": 1606921996.0}, {"subreddit": "republicans", "text": "Imagine listening to the media, and you saying \"without the media telling us to\" implies that you are incapable of having your own thoughts. Good luck with blindly following politicians that don't give a fuck about what you believe in. They just use you for your votes.", "time": 1606755565.0}, {"subreddit": "republicans", "text": "These are the facts that the media and the left want us to ignore", "time": 1606752392.0}], "republican_score": 13, "democrat_score": 0}