{"name": "o_O-JBL", "posts": [{"subreddit": "republicans", "text": "🔴 LIVE: President Donald Trump Rally LIVE in Valdosta, GA\n", "time": 1607213773.0}, {"subreddit": "republicans", "text": "There’s no participation trophies in real life. Actually get something done Kemp!\n", "time": 1607205238.0}, {"subreddit": "republicans", "text": "VIDEO EVIDENCE: Caught Red Handed, TRUMP WON Georgia | Rudy Giuliani 12/05/20\n", "time": 1607202380.0}, {"subreddit": "republicans", "text": "🔴 LIVE: Vice President Mike Pence Defend The Majority Rally in Savannah, GA 12/4/20 6:30 PM EST\n", "time": 1607124985.0}, {"subreddit": "republicans", "text": "🔴 LIVE: Trump Legal Team Presents CLEAR Evidence of Fraud Before Georgia Senate Committee 12/3/20\n", "time": 1607028406.0}, {"subreddit": "republicans", "text": "Reporter Asks Trump If He Still Trusts AG Barr — His Answer Says It All\n", "time": 1607028309.0}, {"subreddit": "republicans", "text": "Where are the bureau’s priorities 🤔 Are they where we pay them to be?\n", "time": 1606952607.0}, {"subreddit": "republicans", "text": "🔴 LIVE: Georgia Senate Government Oversight Committee Meeting on Election Fraud | 12/2/20 6:20 PM\n", "time": 1606952097.0}, {"subreddit": "republicans", "text": "It’s those who acknowledge that the media is after Trump that are deranged... not the media who actually is after Trump. Right...\n", "time": 1606884229.0}, {"subreddit": "republicans", "text": "What evidence of voter fraud?! 🥴\n", "time": 1606852513.0}, {"subreddit": "republicans", "text": "Reminder: Biden lost 212 more counties than Obama did in 2012 (477 to 689), in addition to virtually every other metric measurable. Biden didn’t win this election.\n", "time": 1606793471.0}, {"subreddit": "republicans", "text": "Oh yeah she knows as well as the rest of us do.\n", "time": 1606685726.0}, {"subreddit": "republicans", "text": "Jenna Ellis gives an update on Team Trump’s legal fight against election corruption | Saturday 11/28\n", "time": 1606604395.0}, {"subreddit": "republicans", "text": "It doesn’t, but neither does this meme. It’s a random point that the commenter had added to this to somehow discredit the fact that people are moving out of blue states and moving into red states. \n\nPoverty levels have nothing to do with this meme or what the meme states. It’s been interjected and has no bearing on the conversation.", "time": 1606679545.0}, {"subreddit": "republicans", "text": "Did you miss the entire disclaimer that’s put on every post and the subreddit rules?\n\nThis is a liberal shit post. Mods should ban this guy for trolling.\n\nAlso so funny for being up to date on Pa happenings that you’re spreading news about it that you’d manage to miss [this news regarding PA. ](https://www.reddit.com/r/TheTrumpZone/comments/k2rxn7/ellis_on_how_the_pa_house_and_senate_will/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) Easily the biggest news to come out of PA lately regarding the election. \n\nI stand firmly by my you’re an uninformed liberal shit posting comment.", "time": 1606610270.0}], "republican_score": 15, "democrat_score": 0}