{"name": "Minute_Bad_1619", "posts": [{"subreddit": "republicans", "text": "Pennsylvania judge tosses Trump campaign lawsuit\n", "time": 1606154008.0}, {"subreddit": "republicans", "text": "How does this make you feel?\n", "time": 1604338473.0}, {"subreddit": "republicans", "text": "No, it doesn't. What is radical is calling Yellen radical. \n\nBiden is going to do very little in general and at best he is a left-leaning republican.   \nBut if you really want to live 4 more years believing that Biden will bring the end of the world, suit yourself.   \n\n\nBTW, do you remember when Obama destroyed the country, took away your guns, denied your family health coverage, set up death panels, and all of that stuff he never did? Yeah neither do I. You are being brainwashed to believe that everyone that doesn't agree with you 100% of the time is the next antichrist. This is very sad to see. \n\n  \nGet back to reality where the rest of us live.", "time": 1607098918.0}, {"subreddit": "republicans", "text": "This seems like the same quality post as a preacher screaming about the sins of homosexuality only to be caught a week later with two same-sex prostitutes and a midget in a hotel room covered in cocaine lines.", "time": 1607098685.0}, {"subreddit": "republicans", "text": "That video isn't evidence. It is more claims. Claims require evidence, the Trump team has yet to provide evidence sufficient enough to meet their claims; according to the courts. It is open and shut, unless you think that federal judges elected by Trump are conspiring to see he isn't elected.", "time": 1606752806.0}, {"subreddit": "republicans", "text": "So you would buy and Audi but be happy receiving a Sentra? \nAs for my bills, my student loans have been paid off for a decade, if you'd like to know I also don't have a credit card debt and my multifamily house pays for itself. \n\nI'm all assets, no liabilities in my house.", "time": 1606752695.0}, {"subreddit": "republicans", "text": "If someone sells you an Audi and the deliver you a Sentra, should you get your money back?", "time": 1606143666.0}, {"subreddit": "republicans", "text": "Though this is a correct statement the actual situation is somewhat different for some loans. \n\nThere are many examples where someone took out a loan for quality education but did not receive one. In that case, usually with private for-profit schools, it should be the responsibility of the corporation that runs the school to pay back the loan because they misrepresented the education they provide.   \n\n\n\"Normally,\" the department of education would be that party to level a lawsuit against the school. This has not been the case for 4 years.   \nI have had loans discharged because the school has lost lawsuits for misrepresenting themselves to students.   \n\n\nTo me, this sounds perfectly reasonable.   \n\n\nSo though the OP is correct, there are always different situations to consider. This meme doesn't do that and it puts forward a narrative that isn't exactly accurate to the reality of the situation. But you can only say so much in a meme.", "time": 1605902006.0}, {"subreddit": "republicans", "text": "We are a small sampling of course but neither can I.", "time": 1605901511.0}, {"subreddit": "republicans", "text": "Truth", "time": 1605715667.0}, {"subreddit": "republicans", "text": "Truth", "time": 1605715660.0}, {"subreddit": "republicans", "text": "Sure, if there was evidence. But this isn't a case of evidence, this is a case of claims. The problem is that claims require evidence and judges are literally saying, \"that is hearsay\" and this is a waste of our time.", "time": 1605709019.0}, {"subreddit": "republicans", "text": "hahaha Right!?! \n\nEven the opponent knows the evidence isn't there and is doing nothing to prevent the cases from going to court. The courts alone are deciding that the cases have no merit.", "time": 1605708951.0}, {"subreddit": "republicans", "text": "The same people that are saying there is plenty of evidence believe in god with no evidence, disbelieve climate change with great evidence, and are content to ignore any evidence to the contrary of their already held position. \n\nThere is hearsay in almost all of the cases, and nothing more. It is literally the worst kind of evidence possible.", "time": 1605708852.0}, {"subreddit": "republicans", "text": "I'm not getting my news from CNN. I follow specific journalists that over the years have proven themselves to be creditable. News organizations aren't my cup of tea. \n\nHaving said that, you are trading one source of uncreditable information for another source of uncreditable which is even more embarrassing than the first. Half the stuff coming out of Trump supporters mouth about this election are things for which there is \"no evidence.\" This is a problem. Not bad evidence, not questionable evidence, but no evidence. The only thing coming to the table are claims about wrong doing.  \n\nRepublican's shouldn't have this problem but Trump has brought a lot of uneducated, no critically thinking people into the party. He has been worse for the party than any other president in U.S. history and that is why many republicans voted for Biden. \n\nFor my part I don't support either of them, but this idea that Trump won the election is absolutely insane!", "time": 1605618408.0}, {"subreddit": "republicans", "text": "See my previous comment.", "time": 1605558262.0}, {"subreddit": "republicans", "text": "Look up the owners of this new source. Do you own research.", "time": 1605558245.0}, {"subreddit": "republicans", "text": "You all are getting your news from radical religious zealots, not news organizations. This is why you look so ridiculous as of late.", "time": 1605540481.0}, {"subreddit": "republicans", "text": "I think so. Mandatory logical thinking and logical argumentation class for anyone that wants to join the sub.", "time": 1605540385.0}, {"subreddit": "republicans", "text": "pointless comment.", "time": 1605295146.0}, {"subreddit": "republicans", "text": "Twitter is definitely my preferred news source. *sarcasm* \nPost a link to the proof, I'd be happy to see it because so far this subreddit has provided one piece of 'evidence' for a single vote. A vote that is clearly documented to be clerical error.", "time": 1605273746.0}, {"subreddit": "republicans", "text": "JPDUBBS has a point here. If you are making a claim that there was election fraud it is your responsibility to meet the burden of proof.", "time": 1605209657.0}, {"subreddit": "republicans", "text": "Magical thinking. I'm a McCain Republican moron.", "time": 1605209015.0}, {"subreddit": "republicans", "text": "America spreads  more misinformation than any other country.", "time": 1605202061.0}, {"subreddit": "republicans", "text": "Parler is just a CIA plant page to get all of the terrorists and antiamericans in one place. They are easier to monitor that way.", "time": 1605201689.0}, {"subreddit": "republicans", "text": "Great, I've seen one.", "time": 1605200682.0}, {"subreddit": "republicans", "text": "If they are post marked before the election or on election day that vote is being cast on election day. If a state has a different rule for that, allowing votes to be cast after election day, states have that authority.", "time": 1605200672.0}, {"subreddit": "republicans", "text": "> Pennsylvania state law says no ballots after election day are to be counted. Their Supreme Court over turned that despite it being legislated \n\nThat is too bad, but not illegal.", "time": 1605200609.0}, {"subreddit": "republicans", "text": "> graduated income tax\n\nThat is not socialism by any of the academic terms. You are using the wrong word.", "time": 1605200581.0}, {"subreddit": "republicans", "text": "Where is that proof?", "time": 1605200500.0}, {"subreddit": "republicans", "text": "Okay this seems to be pretty well documented. But according to everyone involved this vote is for his son and incorrectly assigned to his father. \n\nSo even if we take away this one vote, Trump still loses. You have 9,999 votes to account for.", "time": 1605126106.0}, {"subreddit": "republicans", "text": "Election day isn't the day the votes stop being counted it is the day votes start being counted. I don't know why people continue to make this silly claim about election day. \n\n\"There’s reason to believe these ballots from after Election Day are faked. Ballots should not have been counted if they came after Election Day.\"\n\nIf they are not fake ballets will you accept them being counted? \nEvery state has different rules about when mail in ballots can be counted and for how long. There is no reason that PA couldn't count the votes if they were post dated. This is very clearly defined.", "time": 1605125766.0}, {"subreddit": "republicans", "text": "Sure and that makes sense. But statistically, Trump doesn't have the votes to win, so I don't see the point of pretending Trump won the election. We lost this one folks, we will have another chance in 4 years.", "time": 1605124838.0}, {"subreddit": "republicans", "text": "Here is one of Trumps lawsuits from PA. Read it and come back and let's discuss it. https://beta.documentcloud.org/documents/20403506-trump-campaign-kathy-boockvar-pennsylvania-election-federal-lawsuit", "time": 1605124609.0}, {"subreddit": "republicans", "text": "So what you are saying is that you aren't going to answer my question?\n\nWhy isn't Trump's legal team showing evidence for the fraud you are talking about here?", "time": 1605124568.0}, {"subreddit": "republicans", "text": "I wrote a lot, which comment are you talking about specifically?", "time": 1605124536.0}, {"subreddit": "republicans", "text": "Yes, I agree. But mail in ballots are not illegal so I don't see the point you are trying to make. People legally vote by mail in ballots and they have done so for a very long time. What is your point?", "time": 1605124161.0}, {"subreddit": "republicans", "text": "Great that is a claim, where is the evidence?", "time": 1605124110.0}, {"subreddit": "republicans", "text": "Then show me some blatantly obvious evidence because Trump's lawyers aren't bringing any of these fraud claims that I have been hearing about to court.", "time": 1605123913.0}, {"subreddit": "republicans", "text": "Based on what?", "time": 1605123842.0}, {"subreddit": "republicans", "text": "How do you figure?", "time": 1605123829.0}, {"subreddit": "republicans", "text": "So what you are saying is that you aren't going to answer my question? \n\nWhy isn't Trump's legal team showing evidence for the fraud you are talking about here?", "time": 1605123818.0}, {"subreddit": "republicans", "text": "Yes there is a difference between a few hundred and millions but there has never been a \"few hundred\" mail in ballots in an American election unless we go way back in history.\nSure we had more mail in ballots this time, of course, but that has very little to do with why Trump likely doesn't have the votes to win the Presidency.", "time": 1605122099.0}, {"subreddit": "republicans", "text": "Oh, you have evidence that Biden cheated? Have you shared it with Trump's lawyers?", "time": 1605121699.0}, {"subreddit": "republicans", "text": "Generally speaking housing codes are reasonable in my experience.", "time": 1605121602.0}, {"subreddit": "republicans", "text": "Me saying it is statistically likely that Trump can't win isn't gullibility. There are not enough votes left to count for Trump to win. Simple and clear. \n\nTrump is doing lawsuits but not on any of the claims of fraud you are making... why?", "time": 1605120563.0}, {"subreddit": "republicans", "text": "\"And, hows is it fair that people were still sending in votes even after election day?\"\n\nBecause election day is when the election starts, not when it ends. Different states have different rules about how elections happen. Look at any other election in history and you will find the same thing. This is not strange. \n\n\"How is it fair that people all over Twitter found evidence that over 10,000 thousand dead people voted for Biden?\" Because \"people on twitter\" can make anything up they want to. If the Trump campaign had evidence of this why wouldn't they include it in their lawsuit? What since does that make? \n\n\"The polls had already closed.\" Polls closing doesn't means votes are no longer counted. Again look at history, this is not strange. \n\n\"People all over Twitter also found evidence that people younger than 18 were voting?\" Don't trust people on twitter. For what reason would the Trump campaign not include this \"evidence\" in their legal filings? \n\n\"Does any of that sound fair to you?\" It sounds unfortunate that people really believe the things you are saying here. It doesn't stand up to history and it fails the test of reasonable beliefs. \n\nTell me. If you were the Trump campaign and you had information about 10,000 dead voters and people under 18 voting, wouldn't you include it in your legal filings?", "time": 1605120404.0}, {"subreddit": "republicans", "text": "I'm not saying he is the president elect. I'm saying it is unlikely that Trump will have enough votes to win the election.", "time": 1605120135.0}, {"subreddit": "republicans", "text": "Define socialist for me, please.", "time": 1605119776.0}, {"subreddit": "republicans", "text": "New single family homes don't really represent the rental market.", "time": 1605118357.0}, {"subreddit": "republicans", "text": "Oh this is about new construction. That might be true, but having standards for new construction doesn't seem like a problem IMO.", "time": 1605118173.0}, {"subreddit": "republicans", "text": "Every election has had mail in ballots. We've been mailing in ballots since the founding of the country.", "time": 1605118140.0}, {"subreddit": "republicans", "text": "I don't believe there are official results from any states right now. \n\n[https://ballotpedia.org/Election\\_results\\_certification\\_dates,\\_2020](https://ballotpedia.org/Election_results_certification_dates,_2020)", "time": 1605117737.0}, {"subreddit": "republicans", "text": "I doubt very much that is even possible.", "time": 1605117650.0}, {"subreddit": "republicans", "text": "All states haven't certified their election yets. What are you talking about.", "time": 1605117517.0}, {"subreddit": "republicans", "text": "Yes but he wasn't certified by enough states to become the president for a second term so it really doesn't matter what those states did.", "time": 1605117492.0}, {"subreddit": "republicans", "text": "Yes because statistics is a thing. Trump cannot get enough votes to win. It is that simple. \nThese fraud claims about 10,000 dead people voting are unsubstantiated. If they were real fraud claims the Trump campaign would be putting those claims in their lawsuits, they are not. Ask yourself, why? \n\nThe Trump campaign is trying to have 10,000 votes dismissed because they are saying those people don't live in Nevada anymore. But based on the information the campaign and their lawyers have submitted I am skeptical that it will amount to anything. Bad evidence speaks for itself. \n\nThis fraud stuff is just crazy people being crazy and even more crazy people believing stories without sufficient reason to do so. This gullibility is why everyone should be required to take a semester on logical reasoning every year of high school. \n\nOr to put it simply; ya'll crazy.", "time": 1605117330.0}, {"subreddit": "republicans", "text": "Here is a good example of someone that can't accept it.", "time": 1605116942.0}, {"subreddit": "republicans", "text": "Yes this is true, but it is possible at this point to determine who the winner is statistically. This election is lost for Trump.", "time": 1605116923.0}, {"subreddit": "republicans", "text": "What on earth are you talking about? What government regulations specifically?", "time": 1605116858.0}, {"subreddit": "republicans", "text": "As someone that owns rental property, the government can't do anything to lower rent prices.   \n\n\nHere are a couple of things worth considering.   \n\n\n* People that leave a city to live in a rural area are generally unskilled labor that can't afford to reside in the city. City wages tend to be higher than rural wages and one's ability to make more money in general increases in cities. So the people leaving \"democratic\" city (this is a silly statement on its own as in most cities people are more liberal) are people that don't have the skills to generate income in cities. They are not able to compete with most workers to generate more income. \n* The price of rentals is based on what people are willing to pay. The only reason that on one side of a city I can rent an apartment for $2000 a month and on the other side of the city I can only rent an apartment for $800 only has to do with what people are willing to pay. \n   * In a more affluent part of town, I can charge more because the people living in those areas are skilled laborers. \n   * In a less affluent part of town, I can't charge as much because unskilled laborers don't earn enough money to live in the apartment at $2000 a month. \n   * The market decides what I can rent an apartment for, not me, and not the government.\n* Some reasons someone in a blue state would leave it is unbelievable inexpensive retirement real estate in red states, that they are unskilled and can't compete financially or they have 'made their money' in the blue state and want to have a slower type of lifestyle. Less work, less money, but with a home they can buy outright with the money they earned in the blue states. \n* Even under Trump blue states have had a higher wage growth than red states.\n* Generally speaking we folks in the blue states never even think about red states and we are not talking about a mass exodus here. There are some people that want to move out of blue states but it isn't like we are rushing to leave. My job in my blue state pays me around $70,000 more a year than I can make in any red state I looked my job role up in. It would be stupid for me to leave. Here are some reasons why\n   * I make more money\n   * My houses are worth more here for the same square footage in a rural area\n   * I am closer to the best hospitals in the country\n   * Rapidly growing technology sectors\n   * Most of the manufacturing sectors\n   * Access to better schools and or better outcomes for children attending schools depending on affluents.\n   * My tenants make more money so I can charge more for rent\n   * A lower teen pregnancy rate (again better outcomes)", "time": 1605116835.0}, {"subreddit": "politics", "text": "[https://www.youtube.com/watch?v=wezSi5RLkRg](https://www.youtube.com/watch?v=wezSi5RLkRg)", "time": 1605043742.0}, {"subreddit": "republicans", "text": "He already won it is just that a lot of very sad people won't accept it.", "time": 1605043317.0}, {"subreddit": "republicans", "text": "That has nothing to do with what I am talking about.", "time": 1605043078.0}, {"subreddit": "republicans", "text": "Yes indeed", "time": 1604686641.0}, {"subreddit": "republicans", "text": "I came across this today as I looked at the wikipedia page as well so I thought I would pass it along. \n\nIn Marxist theory, a new democratic society will arise through the organized actions of an international working class enfranchising the entire population and freeing up humans to act without being bound by the labour market.", "time": 1604686461.0}, {"subreddit": "politics", "text": "And Arizona republicans.", "time": 1604683183.0}, {"subreddit": "republicans", "text": "This seems like a strange activity in general. He is basically saying, \"I don't like these votes, throw out these votes.\" How unamerican.", "time": 1604682597.0}, {"subreddit": "republicans", "text": "That would be inaccurate. Marx actually wanted a workers party in Germany (1850) to the point that Marx supported a workers party running for election in Germany after the revolution.\n\nBut I think that Marx more preferred a one person one vote type of system. Because in this system the workers are always represented and even in a situation where you have what Marx called \"petty-bourgeois democrats, (meaning the dominate political parties\" that the people should vote for their party, even if they can't win, and not we swayed by the doom and gloom of the dominate parties of the nation. That sounds like modern times doesn't it? \n\nThere are a lot of good commentaries on Marx. Marx itself is pretty dense, but the commentaries on the topic are rather interesting. I recommend you find one written by a established profession academic and read it. It is surprising how many people know very little about Marx, or socialism in general. \n\nEconomically there can be problems with socialism. I won't argue that. My hole point here is that mostly when people are talking about socialist countries, these countries aren't even socialist and it is important to make a distinction between them. \n\nAlso I want to say that the other day I was at work and during break someone made a comment like, \"Democrats want us to be like Cuba.\" So naturally I started asking questions. \n\nThis person, one of our less educated workers, new the words socialism and Cuba, but it turned out he knew very little about Socialism and the country of Cuba. Both of which are pretty interesting topics. He didn't know how food distribution works in Cuba, he didn't know that Cuba has two currencies but that the current unofficial currency is the U.S. dollar. He didn't anything other than \"You can fly there from Miami\"\n\nBy the end of this conversation I felt really bad for this guy. He was making claims but didn't have the most basic information about either of the topics he was talking about. \n\nHe couldn't name a socialist leader nor did he know the capital of Cuba. \n\nSo this is all I am trying to do. I'm not trying to say the republicans are right, the democrats are right, socialism is best, capitalism is best. I'm only trying to show that it is better to say, \"I don't know,\" then to put forward something as fact that I don't know to be fact. That is all.", "time": 1604588556.0}, {"subreddit": "republicans", "text": "I didn't say that.", "time": 1604587478.0}, {"subreddit": "republicans", "text": "Dictatorship of the proletariat refers to an interim governmental system established by the working class, i.g. the people. As you likely know it is more complex than you make it seem in this post. \n\nIt is well understood that what Marx is talking about when he uses this term is the process of the people taking control from the bourgeois for a period of time such that freedom and democracy are gained through the abolition of wealthy ruling class. The term dictatorship in this regard isn't what you are thinking of when you think of dictatorship. \n\nAn example of this type of dictatorship would be something like the following. \nLet's say you have a corporation that is made up mostly wealthy stock holders. If the people rise up an take control of the the corporation and move it from publicly traded (stockholder controlled) to employee owned this process would be the dictatorship of the proletariat. \nAfter the dictatorship established the company as employee owned then the people (employees) would get access to a vote for all decisions related to the corporation, instead of the stockholders; i.g. democracy. \nSo if a dictatorship takes control but doesn't relinquish that control back to the people, this is not socialism in Marxian theory.", "time": 1604504281.0}, {"subreddit": "republicans", "text": "So you will admit then that \"whenever where ever\" socialism doesn't fail?", "time": 1604503364.0}, {"subreddit": "republicans", "text": "It is telling that you have abandoned the conversation in the previous messages and instead are now focusing on a claim about honesty.Me saying that Trump has an honesty problem isn't the same as me saying no one else in government does. I didn't say no one else in government does. I also didn't say that I trust my government or give any indication of my level of trust in my government. This is something you have inferred without asking.\n\nIf you had asked, I would have said some like this. It isn't a citizen's job to trust their government. It is their government's job to legitimize itself as an authority to the citizenry. No citizen should inherently trust their government and the relationship between the people and the government should remain adversarial for the benefit of the people and at the expense of the government.  \n\n\nI'm curious if you would be interested in taking conversations like this to a youtube channel? I think a lot of people could benefit from us having conversations like this.", "time": 1604502878.0}, {"subreddit": "politics", "text": "No, I didn't say anything about police. \nIf someone is accused of a crime then there is a process to determine their guilt. But that process doesn't start with, \"you are guilt prove your not.\" I can't imagine anyone wanting to live in a society that had a justice system like that.", "time": 1604494728.0}, {"subreddit": "republicans", "text": "You will need to formulate a better question than this. It is too broad. Could you be more specific please?", "time": 1604494631.0}, {"subreddit": "republicans", "text": "\"Marx never said he supported democracy.\"\n\nNo Marx's scholar would agree with you. Democracy is the literal linchpin of Marxian theory. Marx's disagreements had to do with capitalism not democracy. You have no idea what you are talking about here and you should probably read more. \n\n\"Democratic socialist countries have been ran by liberal parties for years. These parties introduced market reforms that in some cases are more free market than in America, like school vouchers (competition in primary schools) and privatization of some pension funds.\" \n\nSo are you saying that these Democratic socialists countries are doing well?", "time": 1604494473.0}, {"subreddit": "republicans", "text": "\" Throughout the 20th century, [socialism has caused mass poverty](https://www.hoover.org/research/socialism-has-failed-period) wherever and whenever it has been implemented.\"\n\nThis is inaccurate. There are valid examples of successful Democratic socialist countries. So not \"wherever and whenever\" just in cases where you have dictatorship wrapped in socialism. Those countries have a high rate of failure; think of Venezuala or Cuba. But I'm not convinced these are socialist countries.\n\nSince the author doesn't actually describe which definition of socialism is being used I'll use a definition here based on how I understand socialism. Marx's theory of socialism implies a democratic society first. So using his ideas on socialism I would say that any dictatorship wrapped in socialism isn't a socialist society; it is a dictatorship with social programs, i.g. not a socialist society.\n\nIf we take the dictatorships off of the list of failed socialist countries we are left with a lot of countries doing pretty well given their geographical location and surrounding economies.\n\nIf someone is going to write an article about socialism but they are not going to articulate what they mean by the word, understanding that there are many interpretations of the term, that is a red flag. If they are also going to make blanket statements like this article does in the first sentence that aren't grounded in facts that is another red flag.\n\n\"I will not let you manipulate my mind with bad writing and poor logic.\" It is like a mantra to me.", "time": 1604350697.0}, {"subreddit": "politics", "text": "That is literally the way the law works. Someone is only guilty of a crime if they are found guilty of a crime. You can only be guilty of a crime if you have been found to have violated a law. Only a judge can determine if you have violated a law. It is called the U.S. Justice System.", "time": 1604349465.0}, {"subreddit": "republicans", "text": "\"Truly only one thing to understand and take away from what you said but ill address a few of them before I grt to that.\n\nYou work in IT. So you say. Knowing the internet I'm betting you might have an email account amd you think that makes you an IT expert. Then again if you are that's all it makes you. It doesn't make you an expert on any covid data.\" \n\nActually no that is also inaccurate. I work as a Director and manage a level 3 CMMC supplier that deals heavily in risk management, risk identification, and risk analysis to secure DoD contracts and manufacturing, I'm not actually from New Zealand and I don't think I ever said that. \n\n\"And again war and covid are not the same. We are testing more, have vaccines coming, recovery for all infected is better than 99%, we wear masks and social distance. We are doing all that Trump said along with his experts. What more could anyone do?\" \n\nAgain you don't understand what logically consistent means, look it up. The examples don't need to be the safe thing, they only need to be logically consistent. This is how you evaluate claims like these. \n\n\"We both can be.\" This is very true, so how do we determine who is right? My vote would be for logical consistency, logical reasoning and evidence. \n\n\"However, for all your long winded response the only thing I needed to read was the fact you said Trump said Covid was a hoax. That left talking point has been debunked a while ago. You saying it here lets me know, like I've already pointed out, is that you suffer from TDS and it calls into question everything you said\" \n\nIt is on Youtube. He more or less says democrats claims about Coronavirus are \"their new hoax.\" It is in his own words and easily searchable. \n\nAs for TDS I didn't even know what that was until you said it. I don't see that I meet the requirements of that definition. Trump has done a few good things while in office. For example I thought the democrats complaining about Amy Coney Barrett was moronic and a waste of time. She will make a fine justice. \n\nWhatever you think about me you are probably wrong. I'm not a democrat and I judge people based on their own records and comments. \nIt is clear that Trump has an honesty problem, this is well documented and isn't really up for debate. I don't like liars, I don't tolerate them in my life or as my leaders. There are other criticism I have of Trump that I think are equally valid. \n\nLike the way he talked about McCains service, in my opinion that was well below what I would accept from any of my friends, or my leaders. \n\nBut even those opinions don't mean that everything Trump has done is bad. I don't think that at all. So whoever you think you are talking to, it clearly isn't me. \n\n\"However, for all your long winded response the only thing I needed to read was the fact you said Trump said Covid was a hoax\"\n\nThis is unfortunate because I have a lot to say and if that is the metric with which you will decide what is worth listening to you will have a very short field of view.", "time": 1604348194.0}, {"subreddit": "politics", "text": "I really don't like Trump but people only violate the law if they are found guilty of a crime. That is the definition of violating the law.", "time": 1604345776.0}, {"subreddit": "republicans", "text": "\"I guess my statement seems invalid to you but that doesn't make it so. And lets not fail to mention New Zealand is in one of their worst economic recessions since ever. So maybe they did well with Covid but at what cost? Many more will now suffer because of what they did to their economy and how long will it take for them to recover? So your country is far from a great example. Try again.\" \n\n25 deaths is a great example. Economies recover, dead people don't. Not to mention that New Zealand has had great social programs to help people during this recession, so it isn't really the same as millions of American's out of work with zero help from their government. I'm surprised that you don't find New Zealand's example something to aspire to. Fewer deaths and a better government handling of assistance to the citizenry.", "time": 1604345624.0}, {"subreddit": "republicans", "text": "\"1. I guess my statement seems invalid to you but that doesn't make it so.\"\nYou are absolutely correct. But that you find it valid also doesn't make it so. So we can likely agree on that. \n\n\"2. And talking about war is a different thing. Support for Vietnam war was fairly high initially. Im sire they spun it that way too. Only years later did the actual truth come out. But again it's not the same.\"\n\nIf it is logically consistent it doesn't matter what the topic is, it will be consistent regardless of the content. The consistency is in using your logic which I take to mean, \"I don't have an issue with a president being positive.\" If you think that being positive while American soldiers are dying and calling those deaths a hoax then you do have an issue with a president being positive. \n\nThe way this works is like this; I make a statement, \"I don't consider killing someone in self defense to be murder.\" To be consistent we need to be able to agree with in like but different scenarios, as such; Someone is trying to kill you will and axe and you kill them with a gun murder? No. Someone is trying to kill you will their hands and you kill them with a gun is that murder? No. This is logical consistency. \n\n\"You know for a fact positive attitudes can help in recovery from illness and the like.\" Again I agree with you, but we are not talking about helping people recover from an illness, we are talking about preventing people from getting an illness. These are two different things, obviously. \n\n\"Again you can't control a virus. Every year we don't control the flu and you know that.\"\n\nThis is somewhat misrepresenting this virus as we have plenty of risk management for the flu. We have regular vaccinations, many people have preexisting antibodies and we understand how to treat it. When you don't know about a risks existence there are was to prevent it from becoming a \"threat\". I work in IT security, we don't know about every threat that will come into existence. We do however had a lot of ways to identify and prevent the spread of computer viruses and malware that we are unaware of at the time. Then we contain it and identify it. It seems like Trump failed to perceive the threat while ignoring the risk. Risk management is basically the same across all disciplines so it isn't like there wasn't a opportunity to handle this event better. Again other countries have done a much better job controlling the virus. Going from high cases to extremely low cases. It is possible, it just doesn't seem to be in the U.S. \n\n\"The reason you don't see the correlation is because it doesn't fit your opinion of Trump or the narrative you want to follow. Maybe because of sever TDS\" I think the fact that I know a great deal about risk management and how to unbiasedly analyze data, as I did above should show you that this isn't about a narrative I want to follow. \n\n\"But I get it. You had a flat tire, blame Trump. It rained or didn't rain, blame Trump. TDS at its worse. You can't get past the fact he won the election and yet your side talks about accepting election results when in 4 years your side hasn't.\" This isn't my position at all and I'm not sure how you could had gotten it from anything I said. Perhaps you are trying to fit me into a narrative that you have already predefined for me? I can tell you this is not how I think about the world. \n\n\"Thinking the president could have done more or better about Covid is simply an opinion. There are no facts to back up this opinion. And our opinions differ. Leave it at that and try to gaslight or bully a 12 year old on another thread.\" \n\nAgain this is incorrect. We have examples of what could have been done and years of risk management, specifically with how to handle pandemics to show you might not know what you are talking about here. In the world right now there are countries that have done better than the U.S. in terms of containment of the virus and distribution of adequate information. We know what those countries did. If the Trump administration had the opportunity to act in a different manner and didn't, we would generally call that negligence or not responding to a threat. It appears like the Trump administration had access to all of the facts but chose not to act on them. The positive president comment is a representation of this. No one in charge of a pandemic would ever recommend that you dishonestly relay information to a population. Trump did this, and he has admitted so. \n\nForgive any typo's here, I am running out of time for lunch at work. \nLast  two questions... \n\nIs there anyway you think you could be wrong about your opinion? \nIs it a possibility that you don't know enough about the subject to have an educated opinion on the topic? \n\nThanks for your time.", "time": 1604344378.0}, {"subreddit": "republicans", "text": "lol because it was a fake the OP took down the post.", "time": 1604341975.0}, {"subreddit": "politics", "text": "Hillary Clinton is a poor loser and the NY Times and Democratic strategist continually bring up this junk like it means anything.   \nClinton lost an election to Donald Trump, think about that for a second. She was a bad candidate and didn't run an effective campaign. This is just the truth. Why do we even bother to even talk about her anymore? She is a nobody that many democrats didn't even like. Some liked her so little they voted for Trump instead. This is important.", "time": 1604341881.0}, {"subreddit": "politics", "text": "Fight over with no punches is a good analysis.", "time": 1604341111.0}, {"subreddit": "republicans", "text": "\"No one can control any virus.\" - New Zealand has done a wonderful job of it, so the statement you made seems generally invalid. \n\n\"I don't have an issue with the president being positive.\" This is an interesting statement. If we use this logic for another situation is is still okay? Here is an example; The President knew that sending military troops into a country would cause 230,000 American deaths. He was positive about it and said everyone would be safe and we had nothing to worry about. He went on to say that, not only don't we have anything to worry about but all of the news you are hearing to the contrary is just a hoax. In a situation like this would you still be okay with a logically consistent example like the above? \n\n\"A lot of people, including experts, said many conflicting thing. Polosi and others said all is well and not to worry about the virus. Fouci said masks aren't needed. Blah blah blah.\"\n\nYes it is true that data on the issue evolved as more information was available. I don't see what that has to do with anything Trump has said. His message has been pretty consistent regardless of the data, his position has been pretty clear.", "time": 1604341074.0}, {"subreddit": "politics", "text": "Assuming they both have the same skill level, which is probably very little if any fighting experience, Trump would win on weight alone. There are fights I would pay to see, this isn't one of them. No one over 50 should be getting in fights.", "time": 1604339605.0}], "republican_score": 79, "democrat_score": 0}