{"name": "quadriplegicjake", "posts": [{"subreddit": "republicans", "text": "That’s what’s frustrating to me. 306 vs 232 in 2016 IS THE SAME AS   306 vs 232 in 2020. You can’t just say “no it’s not the same” this time because “my side lost this time.” Lol", "time": 1607061285.0}, {"subreddit": "republicans", "text": " No it’s not the same because WAY MORE people voted for Biden", "time": 1607059781.0}, {"subreddit": "politics", "text": "Let trump start his own party, I’ve seen so many posts for a new Patriot Party on Parler. I hope that happens.", "time": 1607056127.0}, {"subreddit": "republicans", "text": "It’s the EXACT same electoral vote", "time": 1607055661.0}, {"subreddit": "republicans", "text": "No your guy lost. Again, that’s the only true evidence I’ve scene why you all are doing this. We were worried Hillary was gonna try and play the “let’s ignore the vote and send our own electors in” but she didn’t. He’s actually trying it , subverting a democratic process that has happened over 200 years now...", "time": 1607053578.0}, {"subreddit": "republicans", "text": "Trump won in 2016, just like Biden won 2020. Same “landslide” electoral victory too!", "time": 1607052462.0}, {"subreddit": "republicans", "text": "Seriously, normal losers don’t immediately go “I lost, it must be Fraud! Find me evidence of fraud” trumps is never going to think he lost. That is his problem. Everyone supporting him are as demented as they wrongly claimed Biden was.", "time": 1607051095.0}, {"subreddit": "republicans", "text": "Absolutely investigate, investigate for years if you have to. diaper dons term ends Jan 20 at noon regardless. He’s doesn’t get to stay in power. If there is no concession, no clear winner (which there is at this point: Joe Biden) Pelosi becomes president at 1201p that day.", "time": 1607050586.0}, {"subreddit": "republicans", "text": "I want the investigation absolutely, but I want you all to understand trumps term ends at noon Jan 20 regardless. If you guys want to drag this out, not concede, Pelosi becomes president at 12p noon that day...", "time": 1607050324.0}, {"subreddit": "republicans", "text": "But he could not prove it In court. I thought that was all of your hope, “ we will go to the courts, they’ll give it to trump”", "time": 1607048279.0}, {"subreddit": "republicans", "text": "Take your four years investigating. have fun. If you don’t concede by Jan 20, Pelosi becomes president...", "time": 1607048194.0}, {"subreddit": "republicans", "text": "And school drop-out Facebook groups, as well as welfare and food stamp lines are Republican and fascist indoctrination centers.", "time": 1607044185.0}, {"subreddit": "politics", "text": "My thoughts exactly!!! We have to lock all these Republicans up who are trying to steal this election from president-elect Joe Biden!", "time": 1607043837.0}, {"subreddit": "republicans", "text": "Why does he keep doing this in state legislatures AFTER he swore to a judge “we are not claiming any fraud” does he really think he’s going over the courts? Our system has three branches for a reason.", "time": 1607043489.0}, {"subreddit": "republicans", "text": "Oh man, fake news? I mean I uh I uh.. . In my entire history online I’ve never run across a more damning attack. I’m done. Time to delete my entire Reddit profile, Facebook, Parler, MySpace, and mp3.com accounts. I will be gone from the internet very shortly...", "time": 1607042727.0}, {"subreddit": "republicans", "text": "Maybe your car was repo? Maybe the ghosts who are stalking the truck driver who claims he saw “Lots” of ballots in his his trailer stole your car? Prove to me it’s not the ghost Or your whole argument is fraud!!! lol", "time": 1607015788.0}, {"subreddit": "republicans", "text": "How can Rudy not provide the evidence in court? When he said to judge “there is no fraud, we are lot claiming fraud”", "time": 1607013972.0}, {"subreddit": "republicans", "text": "This is one guys saying what another guys thinks he saw. Wow that’s incredible proof... of nothing. And I work in trucking and have booked these mail loads for my drivers.  They don’t get to got thru their shipment. They get loaded, drop off and leave. This is more bullshit fake news No fraud has been said by Barr and testified in court by Rudy!", "time": 1606976307.0}, {"subreddit": "republicans", "text": "Show them evidence of any crime, not words and conjecture and they might act. Their not here to protect your feelings when you’ve lost. Barr and Guliani have said on record no evidence of FRAUD!", "time": 1606966974.0}, {"subreddit": "republicans", "text": "Really? Are you the actual poll worker whistleblower ?  If not you didn’t get any info first hand ...", "time": 1606944071.0}, {"subreddit": "republicans", "text": "Really? why are you not believing Barr when he said no fraud? Or Rudy when he testified in court they are not alleging fraud?", "time": 1606934937.0}, {"subreddit": "republicans", "text": "Heard it in Gulianis own voice when he told judge “no we do not claim any fraud”", "time": 1606934861.0}, {"subreddit": "republicans", "text": "I can hold a press conference full of lies, doesn’t mean anything official, DEFINITELY doesn’t mean anything said is true or verifiable", "time": 1606922808.0}, {"subreddit": "republicans", "text": "Oh shit all CAPS? I’m scared how can I change my vote", "time": 1606917350.0}, {"subreddit": "republicans", "text": "You ARE FUBAR!", "time": 1606898164.0}, {"subreddit": "politics", "text": "Damnit we had that chance Nov 3 and we blew it", "time": 1606877556.0}, {"subreddit": "republicans", "text": "Out of state? That’s CLEARLY FRAUD! How do you think trump MAILED IN HIS BALLOT? Flew to FL first?", "time": 1606877309.0}, {"subreddit": "republicans", "text": "Fine, add dozens of affidavit votes to trump side and recalculate your votes. Biden still won", "time": 1606877120.0}, {"subreddit": "republicans", "text": "Barr says no widespread election fraud", "time": 1606877046.0}, {"subreddit": "republicans", "text": "People great less than one vote due to the Electoral College", "time": 1606876980.0}, {"subreddit": "republicans", "text": "Barr says no widespread election fraud", "time": 1606876951.0}, {"subreddit": "republicans", "text": "Barr says no widespread election fraud! Biden 2021!", "time": 1606876885.0}, {"subreddit": "republicans", "text": "There no systemic fraud! Just like you say there is no systemic racism in this country. Barr says no widespread election fraud", "time": 1606876855.0}, {"subreddit": "republicans", "text": "Barr says no widespread election fraud", "time": 1606876798.0}, {"subreddit": "republicans", "text": "Riveting testimony? In a hotel ballroom press conference? Barr says no widespread election fraud", "time": 1606876788.0}, {"subreddit": "republicans", "text": "Barr says no widespread election fraud", "time": 1606876749.0}, {"subreddit": "republicans", "text": "Barr says no widespread election fraud", "time": 1606876735.0}, {"subreddit": "republicans", "text": "Barr says no widespread election fraud", "time": 1606876716.0}, {"subreddit": "republicans", "text": "Barr says no widespread election fraud", "time": 1606876702.0}, {"subreddit": "republicans", "text": "Barr says no widespread election fraud", "time": 1606876665.0}, {"subreddit": "republicans", "text": "Ok leftists let’s add Mr_Gimli_ to that list of “trumpers to punish” card we all carry around with us to our protests and riots", "time": 1606828017.0}, {"subreddit": "republicans", "text": "You ignorant hayseeds are who we all have learned to ignore (without the media telling us to)", "time": 1606755310.0}, {"subreddit": "politics", "text": "Where do you expect to learn from if you don’t trust any source? Someday, just magically you will suddenly “Know the truth?”  By your logic you can’t trust even the Bible because someone else controlled that information...", "time": 1606755211.0}, {"subreddit": "republicans", "text": "We DONT COUNT COUNTIES or land!!!! We count votes people.", "time": 1606754135.0}, {"subreddit": "politics", "text": "Damn seriously? I totally would have changed my vote!", "time": 1606705955.0}, {"subreddit": "politics", "text": "Damn seriously? I totally would have changed my vote!", "time": 1606705797.0}, {"subreddit": "politics", "text": "Damn seriously? I totally would have changed my vote!", "time": 1606705773.0}, {"subreddit": "politics", "text": "Damn seriously? I totally would have changed my vote!", "time": 1606705746.0}, {"subreddit": "politics", "text": "Damn seriously? I totally would have changed my vote!", "time": 1606705714.0}, {"subreddit": "politics", "text": "Damn seriously? I totally would have changed my vote!", "time": 1606705692.0}, {"subreddit": "politics", "text": "Damn seriously? I totally would have changed my vote!", "time": 1606705682.0}, {"subreddit": "republicans", "text": "Finally a republican speaking his mind, not the red neck fake evangelical qAnon hive mind Bs!! I support you brother!", "time": 1606582365.0}, {"subreddit": "politics", "text": "Done", "time": 1606443327.0}, {"subreddit": "politics", "text": "Customerny is a dangerous moron too", "time": 1606438657.0}, {"subreddit": "politics", "text": "If the dems win the GA runoffs there will be no need, McConnell will no longer be Majority leader....", "time": 1606251873.0}, {"subreddit": "republicans", "text": "If you don’t like it you can leave!", "time": 1606148061.0}, {"subreddit": "politics", "text": "Are u be facetious? 7 million is the approximate total number of votes in PA. the trump campaign was asking it all not be counted", "time": 1606083970.0}, {"subreddit": "republicans", "text": " Why did no one share this before the election? I can’t undo my vote can I?", "time": 1605791342.0}, {"subreddit": "politics", "text": "It’s clearly dementia for a man his age to act this way. Drowsy Demented Uncle Don.", "time": 1605575754.0}, {"subreddit": "politics", "text": "He inciting them to die, everyone he convinces not to wear a mask that catches it and dies is blood on his hands! And trumps. Have we not all seen the people dying in South Dakota still saying on their deathbeds “this can be COVID, it’s not real!”", "time": 1605574266.0}, {"subreddit": "republicans", "text": "Good man. And a proper response", "time": 1605573779.0}, {"subreddit": "politics", "text": "Speak about politics or shut up - you fat shaming asshole are as bad as the trumpers", "time": 1605573246.0}, {"subreddit": "politics", "text": "Speak about politics or shut up - you fat shaming asshole are as bad as the trumpers", "time": 1605573124.0}, {"subreddit": "politics", "text": "Speak about politics or shut up - you fat shaming asshole are as bad as the trumpers", "time": 1605573116.0}, {"subreddit": "politics", "text": "Speak about politics or shut up - you fat shaming asshole are as bad as the trumpers", "time": 1605573110.0}, {"subreddit": "politics", "text": "Speak about politics or shut up - you fat shaming asshole are as bad as the trumpers", "time": 1605573104.0}, {"subreddit": "politics", "text": "As which saying goes ? You listed three - say what you mean please", "time": 1605572962.0}, {"subreddit": "republicans", "text": "If you weren’t a total asshole you would apologize for claiming you somehow “ know” Biden is unfit for office. A speech impediment is not debilitating dementia. Claiming dementia is the lowest, name-calling, baseless accusation. the only one lower is that this election was fraudulent because one side mailed in their votes. Trump will be the same AGE if he wants to run again in 2024 and you can bet I’ll be screaming “ he is a demented asshole who only cares about himself.” That won him enough in 2016 and almost enough this time.", "time": 1605468641.0}, {"subreddit": "politics", "text": "Two states that took corona seriously, that’s what is to be understood from this...", "time": 1605467456.0}, {"subreddit": "republicans", "text": "Is this r/republicans admitting Biden presidency is coming??", "time": 1605467371.0}, {"subreddit": "politics", "text": "Agreed. And when they are done same result Biden won", "time": 1605124547.0}, {"subreddit": "politics", "text": "The people do you ignorant in American asshat", "time": 1605021193.0}, {"subreddit": "politics", "text": "It ends like they announced on Saturday: Biden wins.", "time": 1605020786.0}, {"subreddit": "politics", "text": "All third trimester abortions are medical emergencies, it’s not allowed any other way. But pro lifers are portraying 3rd trimester abortions as “contraception “ what every woman is waiting until then decide...", "time": 1602536159.0}, {"subreddit": "republicans", "text": "I divorced 2 wives after cheating on them with next one. The current one I stayed with but payed a porn star for sex while she was nursing my 5 child from 3 different women.", "time": 1602272463.0}, {"subreddit": "politics", "text": "Yes but your own shared article states it is absolutely illegal in FL, NORTH CAROLINA, etc.... NC being specifically where trump told voters to do so", "time": 1599153903.0}], "republican_score": 47, "democrat_score": 0}