{"name": "jayko86", "posts": [{"subreddit": "republicans", "text": "What change is bad here? People freely expressing themselves with the clothing they wear? People being comfortable and open with their sexual identity?", "time": 1607076950.0}, {"subreddit": "republicans", "text": "The world is changing and it scares me!!!", "time": 1607025109.0}, {"subreddit": "politics", "text": "I’m not sure it’s hyperbole at all. Trump is very much attempting to “steal” the election. This has been a calculated plan for months. It’s important to remember the timeline leading up to the election:\n\n1. Trump casted doubt on mail in ballots for months, calling them fraudulent.\n2. He worked to sabotage the USPS to hinder their ability to handle the inevitable surge in mailed ballots\n3. He told his supporters to not vote by mail and to instead show up in person on Election Day to vote. (Causing the early polling numbers to favor trump)\n4. Republicans repeatedly blocked legislation that would allow states to expand early voting and allow mail in ballots to be counted early causing the mail in vote to only be counted AFTER polls closed on Election Day in multiple states.\n5. Republicans prioritized and rushed a SC confirmation in the final week before the election ensuring a conservative majority in the court.\n\nRemember trump even admitted his plan to challenge the election using the Supreme Court just a few days before the election. Republicans have known how this would turn out and have been preparing for it all year. Trump has foreseen his loss and knew his only path to reelection was through the Supreme Court.", "time": 1606118039.0}, {"subreddit": "politics", "text": "If trump was seeking litigation over a ~500 vote difference in a single state that would determine the outcome of the election, no one would be saying that. The situations are so far from being similar at all.", "time": 1606117063.0}, {"subreddit": "politics", "text": "That’s the Republican way! They’ll continue to be on the wrong side of history because they’re concerned with self preservation more than anything else", "time": 1606116931.0}, {"subreddit": "republicans", "text": "Gee sounds like we should really start working to transition away from oil then", "time": 1605312051.0}, {"subreddit": "republicans", "text": "True, it’s more likely he does these things intentionally", "time": 1605311932.0}, {"subreddit": "republicans", "text": "Yes, world leaders share responsibility for the state of the pandemic in their respective countries. That’s called being intellectually consistent. Realize that anything I would criticize trump for I would do the same for any world leader. I’m sorry if logic hurts your head but it doesn’t matter if it’s the president or anyone else.", "time": 1605311699.0}, {"subreddit": "republicans", "text": "No that’s why I didn’t vote for Trump", "time": 1605311607.0}, {"subreddit": "politics", "text": "Yeah he literally blamed all of it on Obama", "time": 1605305996.0}, {"subreddit": "republicans", "text": "Incredible", "time": 1605305668.0}, {"subreddit": "republicans", "text": "I’ve never seen anyone blaming trump for the reality of the pandemic in other countries, nor should they", "time": 1605304799.0}, {"subreddit": "republicans", "text": ">intending that depending on nonrenewable, destructive, and polluting fossil fuels as our primary source of energy is the correct path our country should be on", "time": 1605304742.0}, {"subreddit": "republicans", "text": "You’re acting as if that has not literally been trumps entire response. And if you do believe that, then your argument is “trump handled it terribly but hilliary would’ve don’t just as bad of a job!”\n\nCan you ever not  hide behind whataboutism and actually be capable of criticizing trump for his mistakes?", "time": 1605304624.0}, {"subreddit": "republicans", "text": "Much more people would have survived because she wouldn’t have dismantled Obama’s pandemic response team, she would have acknowledged the reality of the pandemic instead of pretending like it didn’t exist like trump did and does even to this day, she would’ve had an actual plan and described that to Americans, she would have listened to the scientists advising her and promoted their ideas, instead of firing anyone that won’t get with the program of downplaying and denial, she would not have mocked people for taking it seriously and openly encouraged her supporters to not follow safety measures, she then wouldn’t claim that is was over and that her administration had solved the problem during the highest spike in cases and a rising death rate.\n\nShe would have done a lot of things different that would have saved people’s lives. Trump not only failed to do things that would’ve protected people and stop this pandemic. He has openly encouraged action that has led to the greater spread of the virus and caused many more preventable deaths.", "time": 1605304148.0}, {"subreddit": "republicans", "text": "That sounds good to me", "time": 1605303663.0}, {"subreddit": "politics", "text": "“All media is biased except the ones that align with my preexisting worldview, then if any media I think is unbiased ever contradicts that then they must be biased now”\n\nHow are so many Americans truly this delusional", "time": 1604978708.0}, {"subreddit": "politics", "text": "Like trump supporters say “FOX NEWS SUCKS”\nFirst time I’ve agreed with them", "time": 1604978462.0}, {"subreddit": "politics", "text": "They are. The majority of Americans support progressive policies. Something like +75% support a public healthcare option yet 70m people vote for the party promising to eliminate the ACA with absolutely no plan to replace it. The GOP are the kings of marketing bad ideas and policies and using fear tactics to keep people away from the left.", "time": 1604867453.0}, {"subreddit": "republicans", "text": "Yeah it’s clear that his entire claim of election fraud is a farce. He’s claiming fraud and trying to stop the count of votes in states that he’s ahead and simultaneously hoping that the remaining votes being counted in states he’s behind will benefit him. And now that the only state he’s leading in currently is North Carolina, the push to stop the vote count holds even less merit.", "time": 1604692021.0}, {"subreddit": "republicans", "text": "That’s what it sounds like. I don’t think They don’t have any intention of actually finding fraud, it’s more about halting the vote count to buy the Trump legal team more time to come up with a case to get many of these mail in ballots thrown out. He’s already stated publicly that is his plan and if you look at trumps litigation history this is a common tactic he uses.", "time": 1604648147.0}, {"subreddit": "republicans", "text": "If I’m remembering correctly, The previous case the SC heard from PA was regarding allowing the deadline to receive ballots after Election Day be extended. This was challenged by republicans and lost in the state Supreme Court and the US Supreme Court dismissed it when brought to them.", "time": 1604647049.0}, {"subreddit": "republicans", "text": "Claiming that the courts being on your side secures the election for you is not a good look. This is how dictatorships are started.", "time": 1604646774.0}, {"subreddit": "republicans", "text": "Supposedly both parties including independents already do have representatives at every polling location that have been authorized to observe the ballot counting, as that is what is allowed by law. What trumps legal team has argued is that they don’t have “meaningful access”. We don’t know what that means yet but it is vague.", "time": 1604646695.0}, {"subreddit": "politics", "text": "For sure. Can’t say that I can blame democrats when the reason people are voting trump is “Biden is a socialist!?”. People that people these lies and propaganda cannot have their minds changed.", "time": 1604644251.0}, {"subreddit": "politics", "text": "Thank you! I’m glad someone else noticed that. Watched that moment live and couldn’t believe how quickly this dipshit pulled a 180 and put the stick back in his own ass to deny what his own party is responsible for. Was glad to see him called out for it though I just wish everyone else could see these people for what they really are.", "time": 1604644030.0}, {"subreddit": "politics", "text": "I’ve been watching ABC and this is literally the only correct thing he’s said, the entire rest of the time has been him bootlicking trump and the party.", "time": 1604643859.0}, {"subreddit": "politics", "text": "After he “called trump out” on ABC he was immediately called out on how republicans are the ones that blocked legislation to prepare out electorate and polling services and the USPS for what we are seeing tonight. He dismissed it completely. He’s only looking out for himself because this looks VERY bad on trump. But also failing to acknowledge it was his own party that caused the chaos we are dealing with right now. This could have been prevented, we could’ve been prepared, republicans said no.", "time": 1604643781.0}, {"subreddit": "politics", "text": "Don’t get your hopes up. I watched this live and immediately after this he blamed what we are seeing right now on the US not being prepared enough to handle this kind of election, and then quickly dismissed the points brought up of democrats pushing legislation to prepare polling places and the postal service for this exact scenario and that republicans at the local and federal level consistently blocked. \n\nDon’t forget that republicans are reaping what they’ve sowed and that they caused this mess that we are in by casting doubt on mail in voting, blocking legislation and funding to protect and prepare our voting process, sabotaging the postal service by cutting funding and dismantling mail sorting machines, and also reducing the number of polling locations among many other things. \n\nRepublicans didn’t want to expand mail in voting because they knew that more people voting means more people voting democrat. They tried to claim it was over fears of fraud and election interference, and saying that we weren’t prepared enough to deal with massive amounts of mail ballots. They refused and blocked efforts by democrats to actually IMPROVE the system to help solve these issues and eliminate those fears. And THEN they systematically worked to make voting difficult and cripple the postal service in order to sabotage the election process specifically with mail in voting.\n\nThe way we’re watching this election play out is a direct result of the trump administration and the Republican Party, this is clear and obvious to anyone that has been paying attention.\n\nAs an added bonus, this has all been going according to plan for them. Trump has known that the election was not looking good for him. He knew he was facing possibly record turnout in support to get him out of office, and with the push for mail in voting that was definitely possible. This is why he started sowing doubt into the election and about mail in votes very early. It’s why he pushed for his supporters to NOT vote by mail and to instead vote in person on Election Day. It’s why the GOP and trump forced the confirmation of a SC justice during the final week of an election ( which according to them shouldn’t be allowed within a YEAR before an election) instead of focusing on coronavirus relief and ending the pandemic.\n\nTrumps plan since this pandemic started and things started looking bad for him has always been to discredit the mail in and early votes, hope his supporters show up in person on Election Day so that their votes are counted first and seen as more legitimate, and then fight in the courts, all the way up to the Supreme Court which he has now installed justices who he thinks will help him, in order to get mail in ballots thrown out. This has been speculated and predicted for months. Trump himself admitted this as his plans the previous two weeks leading up to the election. Bernie sanders even saw this coming and publicly told people to be wary of it. And it’s happening exactly as everyone had thought.", "time": 1604643379.0}, {"subreddit": "politics", "text": "This is what I’m expecting as well, and if it happens MASSIVE civil unrest, protesting, and possibly rioting will follow. Trump has done everything in his power to cast doubt on the election and mail in voting, and has been systematically making an effort for months to sabotage the postal service and prepare to fight the results should he lose. He’s also not committed to a peaceful transition of power should that be the case. The only way I see this going smoothly at all is if there is a clear Biden landslide on Election Day.", "time": 1604191658.0}, {"subreddit": "politics", "text": "Trump has literally said that he doesn’t want ballots to be counted after Election Day, even calling it illegal, and has worked to suppress mail in voting, sabotage the postal service, claim mail in votes are fraudulent and will be used to steal the election, and has rushed to appoint a Supreme Court judge that will now make 3 SC justices who were part of the team that helped Bush prevent ballots from being recounted in 2000. Justice Kavanaugh also recently made an argument that ballots can’t be counted after Election Day because they will “flip” the results. All of this and yet conservatives push the narrative that democrats are trying to rig the election, are going to cheat and steal the election from trump, and that democrats will try to call the winner on Election Day without all the votes being counted.\n\nLiterally so separated from reality.", "time": 1604191420.0}], "republican_score": 17, "democrat_score": 0}