{"name": "Stout_Gamer", "posts": [{"subreddit": "republicans", "text": "They are blinded by rage. Sadly, it does make them sound immature.\n\nWe let those criminals commit their crime, and we will fight it in the Supreme Court. I am confident that justice will be served.", "time": 1607069324.0}, {"subreddit": "republicans", "text": "Yikes! I vaguely remember Hillary Clinton as Secretary of State under the Obama/Biden administration trying the \"Russia Reset,\" and it didn't end well...", "time": 1607069000.0}, {"subreddit": "republicans", "text": "You are welcome to express yourself, as long as you do not shove your perversities down our throats. We value freedom of religion. If I am a professional photographer and a perverted leftist tells me to take photographs of them while posing nude, I will get disgusted and decline. Doesn't mean I oppose freedom of expression--it means the pervert needs to leave me alone and keep their perversities to themselves.", "time": 1607039527.0}, {"subreddit": "republicans", "text": "First word is \"discourse.\"\n\nSounds like a boycott to the TDS \"course.\"", "time": 1606931761.0}, {"subreddit": "republicans", "text": "She looks like a female version of a George Soros... Spooky!", "time": 1606931622.0}, {"subreddit": "republicans", "text": "So did Biden, Bush, Obama, and McCain. We got hundreds of witnesses of voter fraud everywhere.", "time": 1606931241.0}, {"subreddit": "republicans", "text": "Title is incorrect. Bernie is not poor. He is very rich.\n\nIn fact, he is a millionaih. Conspired with the Democrat party to accept campaign contributions and give them all the power.", "time": 1606889646.0}, {"subreddit": "republicans", "text": "No. This world may be the kingdom of the devil, but he knows that his days are numbered. And he wants to take down as many with him.\n\nIf we truly believe in God and salvation, then we know that truth and righteousness will prevail in the end. We have nothing to fear, for God will be glorified in time.", "time": 1606729469.0}, {"subreddit": "republicans", "text": "Wait, another recount? I thought Giuliani had said the last one made no difference, because it did not include audit... 😶", "time": 1606112853.0}], "republican_score": 9, "democrat_score": 0}