{"name": "Atarru_", "posts": [{"subreddit": "republicans", "text": "This is why no one wants to be associated with the liberals.\n", "time": 1604935549.0}, {"subreddit": "republicans", "text": "I feel that you don’t have to be religious to be a conservative it’s just a more moral ideology group like liberals, they fight for more of morals than stuff like military and how the country should be run. I’m probably wrong but you associate religion with conservatism too much even though you are an atheist you can still like their moral ideas. Plus they still end up fighting for the Republican Party so conservative or not it’s still a win for the overall party.", "time": 1607091688.0}, {"subreddit": "republicans", "text": "Most republicans don’t appeal to emotions in general.", "time": 1606405899.0}, {"subreddit": "republicans", "text": "None get us some educated good looking man who can represent the GOP so it can take back the majority.", "time": 1606190867.0}, {"subreddit": "republicans", "text": "If we start trying to convert people instead of pushing them back then we may actually become the majority but after these ridiculous stunts it’s looking like it may be impossible. This party needs a reformation if it’s going to survive", "time": 1606099629.0}, {"subreddit": "republicans", "text": "The electoral college stops idiots from having their say basically, which is exactly what we need sooner or later instead of this country being ran on facts and logic it will be run on emotions.", "time": 1605674463.0}, {"subreddit": "republicans", "text": "They just want to hear what they want to hear. I’m a conservative myself but come on sooner or later you have to listen to news sources even if it sounds biased it’s unlikely for it to be fake but expect mishaps on their side. The GOP is dying, now is not the time to lose trust in our sources.", "time": 1605674000.0}, {"subreddit": "republicans", "text": "Just because its a possibility doesn't mean we should take insane amounts of time and create a ton of drama over it, Russians interfering well although it could have been possible that doesn't mean its actually probable even if it is a huge deal its just not believable but there should always be an investigation but come on something that big and only the democrats were saying it, at least miscount or voter fraud is much more believable than fucking Russians rigging the votes.", "time": 1605031868.0}, {"subreddit": "republicans", "text": "This is been an interesting experience based on the reactions people gave and the off topic useless comments have been interesting no matter what time only knows the victor so let’s wait. Those saying republicans are hypocrites, well maybe but if we are then think of it as showing you what it’s like having to listen to the random accusations of a rigged election such as the Russians interfering, nobody is winning from these comments or these elections.", "time": 1604976256.0}, {"subreddit": "republicans", "text": "Never said there was voter fraud I just stated the reactions.", "time": 1604975017.0}, {"subreddit": "republicans", "text": "Like I said I’m talking about the people’s reaction NOT the people running for presidency.", "time": 1604974902.0}, {"subreddit": "republicans", "text": "Technically I'm doing this to try to equal the parties its been looking rough for the republicans and they are slowly dissolving so we need to do something because the US can never have 1 party in control of the government. Its a rough way of trying to grow the party but without a voice you have to adapt to the circumstances.", "time": 1604960447.0}, {"subreddit": "republicans", "text": "Believe it or not, that was one of the biggest things I ever wanted except when I realized how diverse this country is in its beliefs and who wants power and who just wants what this country gets so mad over everything and some people ruin each other's parties and the ideas of a party have changed drastically nobody knows which party is which anymore and now people are being labeled for a party they don't want to be in and ect. It's just bad, maybe too bad to heal.", "time": 1604960250.0}, {"subreddit": "republicans", "text": "Mines threatening ww3", "time": 1604956805.0}, {"subreddit": "republicans", "text": "Just to make things clear I got nothing against Biden so far he hasn't done anything stupid and some of his ideas I can get behind but I'm just starting to hate what the democratic party has become, it's a mess compared to what it was.", "time": 1604944808.0}, {"subreddit": "republicans", "text": "You are shying away from the idea of the picture its to show the comparison of reactions between the two parties when two different political presidents became the winners of the races and from this the opposite parties got angry but one more than the other, its harder to compare the 2016 election one to the 2020 election because it was 4 years ago but it was bad and if the Democrats lost this election I would be sure there would be riots and talk of impeachments before he even gets in office, even though the republicans are mad they are not going to the extreme and of course there would be recounts and ect but that's a must in this day and age so this stance is relative to the reactions from the liberals when the race ended in 2016.", "time": 1604944521.0}, {"subreddit": "republicans", "text": "Also, this is a much more general meme but honestly, the Republican reaction in 2020 compared to the Democrat's in 2016 was very different.", "time": 1604938203.0}, {"subreddit": "republicans", "text": "Honestly, who knows anymore but one thing I cannot let go of is the idea of a bunch of liberals crying at the last election, and now they act like we are the babies just because we are wanting some recounts, plus as republicans are turning into the minority so we can't just let opportunities pass.", "time": 1604938074.0}], "republican_score": 18, "democrat_score": 0}