{"name": "philnotfil", "posts": [{"subreddit": "politics", "text": "I was a Republican, and I drew my red line too late. I’ll answer for my choices for years to come.\n", "time": 1596939344.0}, {"subreddit": "politics", "text": "The Jakarta Method: How the U.S. Used Mass Murder To Beat Communism\n", "time": 1596658557.0}, {"subreddit": "republicans", "text": "Do you want us to lose the Senate? Because this is how we lose the runoff elections.\n\nNewt Gingrich's tweet about what they are doing- https://twitter.com/newtgingrich/status/1334480959769620483\n\n>Lin Wood and Sidney Powell are totally destructive. Every Georgia conservative who cares about America MUST vote in the runoff. Their dont vote strategy will cripple America", "time": 1607000263.0}, {"subreddit": "republicans", "text": "I will be glad when he is no longer the face of the party. I hope that when he is gone, we can restore conservatism as the core of the party.", "time": 1607000030.0}, {"subreddit": "republicans", "text": "The alternative is worse for Republicans.", "time": 1606592565.0}, {"subreddit": "republicans", "text": "They are going to pull out all the stops to try and beat Loeffler and Perdue in these runoffs.", "time": 1606590683.0}, {"subreddit": "politics", "text": "Not just Virginia.", "time": 1606586498.0}, {"subreddit": "republicans", "text": ">Why should we vote for swamp creatures like Loeffler and Perdue?\n\nBiden is a compromiser. If we control the Senate we can stop him from doing the crazy stuff and we can still get some of our agenda. If we don't control the Senate then all bets are off the the leftists will push for everything they can get.", "time": 1606586212.0}, {"subreddit": "republicans", "text": "Sure, but we can't do anything about the general election at this point. However, we can still make sure Biden has a Republican Senate to deal with.\n\nBiden with a Republican Senate is a do-nothing president. Biden with a democrat Senate is a destructive force.\n\nWe can whine about the past, or we can take action to preserve the future. Only one of these makes a difference.", "time": 1606578947.0}, {"subreddit": "republicans", "text": ">These baseless claims have triggered a number of the president’s most ardent supporters to suggest writing in Mr Trump rather than the two incumbent Republican senators, Kelly Loeffler and David Perdue. The senators were both forced into runoff elections after failing to get more than 50 per cent of the vote, a requirement in Georgia. \n\nThis is incredibly short-sighted. Maybe they could have done more to help Trump win in Georgia, but control of the Senate is at stake here. If the democrats win these seats, they can force a tie in the Senate and the vice-president will be the tie-breaking vote. Which means we lose.\n\nPlease think strategically. Please think long term. Please support Loeffler and Perdue in Georgia.\n\n(personally I think Loeffler and Perdue should be in jail for insider trading, but since the rules don't work that way, we will run with what we have)", "time": 1606577453.0}, {"subreddit": "republicans", "text": "That seems kind of short-sighted. Because we lost the presidency in Georgia, we're going to go ahead and hand two more Senate seats to the democrats?\n\nHopefully they will have some time to cool off before the runoffs in January.", "time": 1606093609.0}], "republican_score": 8, "democrat_score": 0}