{"name": "kurlygurl", "posts": [{"subreddit": "politics", "text": "This bitch is drunk. Someone thought it was a good idea to give this detox candidate a microphone.", "time": 1607004558.0}, {"subreddit": "republicans", "text": "Hmm. How does it measure up to the 8 year campaign against Obama?", "time": 1606912334.0}, {"subreddit": "republicans", "text": "During China's cultural revolution,  the 1st people targeted were college graduates.  In Iran's revolution,  they 1st attacked college graduates.  In the Russian revolution,  they attacked college graduates.  When Cuba went off the map, they experienced a brain drain of educated people. In Lebanon,  they went after professors 1st. See a common thread?", "time": 1606910976.0}, {"subreddit": "republicans", "text": "YES!!!", "time": 1606910302.0}, {"subreddit": "republicans", "text": "Stand up guy.", "time": 1606910143.0}, {"subreddit": "republicans", "text": "Hilarious!", "time": 1606909890.0}, {"subreddit": "republicans", "text": "An opinion piece.  A shitty opinion, but there it is.", "time": 1606909670.0}, {"subreddit": "republicans", "text": "Basically he threatens civil war if his demands are not met. Someone should tell him about Africa. They often do what he suggests. He might be better suited to being a citizen of Africa. Or Venezuela.", "time": 1606907924.0}, {"subreddit": "politics", "text": "He's going to try to replace the electors in the 11th hour.", "time": 1605532718.0}, {"subreddit": "politics", "text": "My white mother is a Trump supporter.  She has 4 brown children who all vote Democrat. She doesn't get that we live in a different world than she does, even after witnessing the prejudice we suffered. \n\nI began school in an all white neighborhood in 1962, same as Ruby. The parents gathered to protest after seeing me. The kids beat me everyday after kindergarten, all the way through to 6th grade. \n\nI remind her of this and many other examples, even the fact that she banned my father from delivery rooms so she could get \"white\" put on our birth certificates. She just doesn't care.", "time": 1605187040.0}, {"subreddit": "politics", "text": "Every. Single. Fucking. Thread. Why do all roads lead to pussy?", "time": 1605025694.0}], "republican_score": 7, "democrat_score": 0}