{"name": "Distinct-Ad-3226", "posts": [{"subreddit": "republicans", "text": "Stop picking people for your cabinet based on sexual orientation and ethnicity, and start picking people based on there qualifications\n", "time": 1607149881.0}, {"subreddit": "republicans", "text": "Voter Fraud!!!😂😂😂\n", "time": 1606967471.0}, {"subreddit": "republicans", "text": "It just doesn't add up\n", "time": 1606876775.0}, {"subreddit": "republicans", "text": "We the People\n", "time": 1606875761.0}, {"subreddit": "politics", "text": "Clay: Why I'm Voting For Donald Trump\n", "time": 1605475756.0}, {"subreddit": "republicans", "text": "This is why Biden cant be elected\n", "time": 1605473783.0}, {"subreddit": "republicans", "text": "Biden is literally being funded by Japan and China\n", "time": 1605243269.0}, {"subreddit": "republicans", "text": "If you think about it Liberal companies like Disney make racial supporting movies because it makes them look good and it makes them more money, so that in turn makes them racist,because there using black people for money.\n", "time": 1604878719.0}, {"subreddit": "republicans", "text": "Really any community of race(black community Hispanic community Cuban community and LGBTQ+ community", "time": 1607157023.0}, {"subreddit": "republicans", "text": "This is one of the main reasons Mr. Biden cannot win, cause he will only pick people to please other communities  rather than pick people based on qualifications and you already know what those communities will say Your quote Racist or your quote homophobic cause they dont have any other excuse for the way there own narcissism has back fired on them", "time": 1607150267.0}, {"subreddit": "republicans", "text": "He's not certified yet because the electoral college doesn't meet till Dec. 14", "time": 1605631504.0}, {"subreddit": "republicans", "text": "Well Biden is trying to close schools and put teachers out of jobs all together", "time": 1605544933.0}, {"subreddit": "republicans", "text": "There's tons of voter fraud over here Trump is proving right now so the Democrats won't steal the election", "time": 1605475143.0}, {"subreddit": "republicans", "text": "You have a point, Fuck the Left and the Media, lets take back America and elect Donald Trump", "time": 1605243155.0}, {"subreddit": "republicans", "text": "Trump is the best president since Regan", "time": 1605224802.0}, {"subreddit": "republicans", "text": "Is this coming from a liberal", "time": 1604960200.0}], "republican_score": 15, "democrat_score": 0}