{"name": "POLYTICALpod", "posts": [{"subreddit": "republicans", "text": "New LEAKED video catches FRAUDSTERS red handed in Georgia\n", "time": 1607098551.0}, {"subreddit": "republicans", "text": "Project Veritas EXPOSE CNN corruption\n", "time": 1607015418.0}, {"subreddit": "republicans", "text": "Here's why Trump will DEFINITELY still be here in 2024\n", "time": 1606927165.0}, {"subreddit": "republicans", "text": "Joe Biden would let China GET AWAY with this\n", "time": 1606843720.0}, {"subreddit": "republicans", "text": "THIS is evidence of a Dominion COVER-UP\n", "time": 1606761910.0}, {"subreddit": "republicans", "text": "This was a MASSIVE win for Trump in court\n", "time": 1606591958.0}, {"subreddit": "republicans", "text": "These vote numbers for Biden are simply IMPOSSIBLE\n", "time": 1606515125.0}, {"subreddit": "republicans", "text": "Why radical leftists are trying to CENSOR Jordan Peterson again (Electio...\n", "time": 1606320145.0}, {"subreddit": "republicans", "text": "Did President Trump just concede the election? (NO)\n", "time": 1606232828.0}, {"subreddit": "republicans", "text": "DOMINION refuses to answer to Pennsylvania house committee\n", "time": 1605982098.0}, {"subreddit": "republicans", "text": "We did it Reddit! We defunded the police.\n", "time": 1605912858.0}, {"subreddit": "republicans", "text": "Michigan Democrats THREATEN GOP officials into certifying results\n", "time": 1605884096.0}, {"subreddit": "republicans", "text": "Democrats gained 200,000 votes EXPLOITING Wisconsin loophole\n", "time": 1605802010.0}, {"subreddit": "republicans", "text": "THOUSANDS of Trump votes found as NEW state set to recount\n", "time": 1605725337.0}, {"subreddit": "republicans", "text": "Georgia election audit EXPOSES hidden Trump votes\n", "time": 1605632268.0}, {"subreddit": "republicans", "text": "Democrat Georgia candidate makes OUTRAGEOUS remarks about Trump voters\n", "time": 1605562550.0}, {"subreddit": "republicans", "text": "The vast majority of these lawsuits weren't actually filed by Trump. Even if they were, it's not uncommon to throw all the lawsuits you can with the expectation to lose many, in fact it may be necessary to show you've exhausted all options. We haven't said for sure Trump is going to win, we're just withholding judgement until everything has been presented and all the lawsuits have run their course with all the evidence being presented. That never used to be a controversial opinion to have, anyone who can't see the media deliberately trying to build a narrative is delusional.", "time": 1606611081.0}, {"subreddit": "republicans", "text": "LOLOLOL Good one XD XD XD", "time": 1606593592.0}, {"subreddit": "republicans", "text": "The only racist undertones are the ones you've projected on to them, you have no way of knowing their motive or intent.", "time": 1605890840.0}, {"subreddit": "republicans", "text": "Absolutely. The trick is to not think of people as on a side and instead as an individual who is capable of being a bad or good actor. Reddit seems to be full of extremist \"ends justify the means\" type of characters who rational abhorrent behaviour, I hope it isn't reflective of our communities and just a symptom of the echo chamber.", "time": 1605890572.0}, {"subreddit": "republicans", "text": "> Alternate headline: GOP officials attempt to overturn will of voters. Voters make displeasure known. \n\nThat's what we call sugar coating like \"fiery but peaceful\" etc. In reality it's the canvassers job to insure the integrity of the votes, if they feel like there are discrepancies that need to be addressed they're within their right to vote not to certify. Enfranchising people means not only allowing everyone to vote but also making sure their vote isn't diluted by illegal ones so they could easily argue they are protecting the will of the voters.\n\n>  Don't play with fire and expect not to get burnt. \n\nJust because you wrap that up in a nice little platitude, it doesn't mean it isn't an extremists stance to take. You don't get to threaten people with death because you disagree with them. There is a process you can follow, that's what the rule of law is for, we don't have to become vigilantes.", "time": 1605889163.0}, {"subreddit": "republicans", "text": "Yes, that's called sarcasm because the media characterizes BLM and Antifa violence as mostly peaceful.\n\nBut you're right, you have identified two examples (there may be many more) of Trump supporters doing bad things. As a Trump supporter myself I am capable of condemning their acts of violence because I don't pretend that all 70 odd million people are all saints.\n\nNow, are you able to apply that same logic to BLM and Antifa, who I assume you support correct me if I'm wrong, or are you going pretend that they have been mostly peaceful?", "time": 1605473940.0}, {"subreddit": "republicans", "text": "He's only the president-elect by his own proclamation, he won't be officially until the electors make their vote. If he does become president though, it's clear by his choice of transition team, he will have the ear of the neo-cons who have influenced every administration up until Trumps for decades into starting new conflicts.", "time": 1605399680.0}, {"subreddit": "republicans", "text": "I understand how to click on a link, it's behind a paywall. I'm not going to jump through a bunch of hoop to see it. If you've got a point to make then make it.", "time": 1604189153.0}, {"subreddit": "republicans", "text": "This article is behind a paywall so I can't see it. How is it relevant exactly? What makes you feel compelled to come to a sub with clearly opposing views of your own to throw insults on 2 day old threads?\n\nAlso, this is obsessive behaviour, I'd take some deep breaths.\n\n[https://ibb.co/fNpqRgC](https://ibb.co/fNpqRgC)", "time": 1604188206.0}, {"subreddit": "republicans", "text": "Thanks for the feedback :)\n\nWhy are there so many democrats brigading this sub constantly?", "time": 1604187694.0}, {"subreddit": "republicans", "text": "It's in the video BrainDamage.", "time": 1604100776.0}, {"subreddit": "republicans", "text": "They have been corroborated most notably by Bobulinski, Hunter's ex business partner who was involved in the deals and the recipient of some of the emails. Also the DOJ are currently investigating Hunter Biden for money laundering.", "time": 1604061024.0}, {"subreddit": "republicans", "text": "I said go and watch the videos yourself as in go and make up your own mind, it seems you're dismissing them at hand. Have you watched them? The Texas gov has said an investigation has been opened, I'll withhold complete judgement until the authorities have determined there is wrongdoing. I'm not going to bury my head in the sand though either and it seems to me the person in the Texas fraud case could well be guilty of election fraud. It seems fairly indisputable that she was ballot harvesting and influencing a voter over 65 which are both illegal. How can we have a discussion about it though it you're just attacking the source instead of the content?", "time": 1603992317.0}, {"subreddit": "republicans", "text": "Peter, I love how you now come to this video after you lost the argument in the other.\n\nYou're going around a republican forum trying to discredit anything bad of Biden by posting irrelevant whataboutism, what exactly is your goal here?\n\nWhat does anything you posted have to do with mail fraud in Texas? Go and watch the Project Veritas videos yourself and tell me nothing wrong is happening there.", "time": 1603969537.0}, {"subreddit": "republicans", "text": "Right so the business deals of his children are relevant to his presidency? Gotcha.\n\nYou're not concerned about Hunter Biden though and him doing deals with the shadiest corrupt characters in China, Ukraine and Russia to name a few in an industry he knows nothing about and on behalf of his father.\n\nYou are more concerned about Trump doing business relevant to his company and decades of experience in real estate that is not out of place at all with a bank account he legitimately set up, paid tax from and then closed down? Give me a break. You clearly have no interest in anything except having your candidate win.", "time": 1603935087.0}, {"subreddit": "republicans", "text": "> It took me 10 seconds to find and provide links to reputable, cross-referenced evidence. You provided a shitty video equal parts opinion and bad recording that has no cross-verification.\n\nThe video is just talking about the latest audio leak from the laptop, it is far from the whole story.\n\n> I know why you're crying but her emails 2.0, the difference is it was done intentionally here and you can't even fabricate something plausible today.\n\nWhat does something in Bush's administration have to do with anything we're talking about here.\n\n> If you've got evidence, show it. The truth doesn't stay buried in qanon babblers if it's true. The best you've fronted is a blind man working at a tech shop claimed Hunter dropped off a laptop on the opposite side of the country from where he works and the FBI haven't come out to say \"this is bullshit, come back to us when you have real crap\" yet. By that level of evidence aliens in flying saucers must be playing fetch with my dog.\n\nWhat a biased take. Here's another way of looking at it. Hunter Biden, know crack addict, carelessly leaves his laptop at a store 5 miles from his father's home in Delaware. When the incriminating evidence on the laptop is leaked to the press, his lawyer requests the laptop back. The participants of the emails that are leaked corroborate the story and say they are genuine, one of whom was a former navy seal. The MSM and big tech firms scramble to cover up the story. The emails and texts not only show embarrassing photos and videos of Hunter's drug and sex escapades, they also show business deals in China with known corrupt agents of the CCP who are now in jail or missing. Again the emails detailing these deals have been corroborating by the people who took part in them. One of the emails details the equity split and how 10% of the deal was for Joe Biden. The Bidens refuse to even acknowledge the laptop, Joe ridiculously claims he doesn't even talk to his son about his work, which is laughable on it's own. This is a real scandal involving someone who may be involved in dodgy deals with the CCP, it's not some whack conspiracy theory, stop being a partisan hack and do your research.\n\n> Nothing to say about the broadly confirmed facts between Trump and China?\n\nI literally addressed them in my previous message, there is no evidence any wrong doing. Of course they're broadly confirmed, the bank account is a matter of public record, it isn't some secret. You're trying to make a story from nothing to deflect.", "time": 1603928880.0}, {"subreddit": "republicans", "text": "The amount of mental gymnastics coming from Biden supporters to try and dismiss this story is staggering. The only manufactured story is the one trying to make something of out of what are completely normal dealings of a global real estate businessman who's bank account in China was a matter of public record and not some secret stash.\n\nThe laptop and it's contents have been corroborated by Hunter's ex partners who were involved in the deals, everyday more and more evidence is coming out to validate it. The Bidens have no business doing multi billion dollar deals in areas of business they have zero experience. Since the refuse to explain themselves and are trying to dismiss the story as Russian disinformation, we have no way of knowing how compromised they might be.", "time": 1603922620.0}, {"subreddit": "republicans", "text": "Not really asking you to prove a negative, just simply discredit the laptop in some way. I assumed you would attempt to call it Russian disinformation or something along those lines.\n\nEven though I would call myself in the current climate conservative minded, I still spend an about equal time reading from biased left sources like the ones you mentioned as much as I do from biased sources such as Fox News etc.\n\nI would say your comment is generally unhinged the fact you think Trump being elected would turn the US in a police state is quite laughable in all honestly. Literally nothing you said actually has any substance to it, you've merely tried to shut me down by attempting to discredit my character.\n\nIf you want to have a discussion on why the laptop may or may not be real and what that does and doesn't say about Hunter or Joe then I'm all ears. I would also add though from your reply that you know nothing about the information in the video based upon your vague response to it calling it \"fake made up junk\" so I would say it's you that's trapped in the echo chamber.", "time": 1603777842.0}, {"subreddit": "republicans", "text": "I see so because some internet strangers dismiss uncomfortable news, that means you get to do it as well. Gotcha. I've checked the sources, there is a growing amount of evidence that validates the Biden laptop. If you think otherwise fine but provide your evidence or argument at least.", "time": 1603766600.0}, {"subreddit": "republicans", "text": "Why's that?\n\nYou don't get to just call something a lie and then it goes away.", "time": 1603765154.0}, {"subreddit": "republicans", "text": "Sorry if it came off that way! Was just a tongue in cheek reference to the 'Abraham Lincoln' comments during the debate - no trolling.", "time": 1603530209.0}, {"subreddit": "republicans", "text": "Happy to confirm that we're not bots and happy to also explain that covering a story is not 'pushing propaganda'. Suppressing the existence of a story to suit your political narrative (as in, picking and choosing your facts) is, ironically, more akin to propaganda.\n\nWould actually quite like to hear a left wing argument on this - I'm wondering why you're all rushing to support the corrupt son of a corrupt politician as he uses his last name to get hundreds of thousands of dollars a month and sell out the country to enrich himself. I thought you were all against this?", "time": 1603146165.0}, {"subreddit": "republicans", "text": "Thanks so much for taking the time both to engage in a serious manner and to watch the video, its good to see civil discourse still exists! :) I'll reply to all of your points in turn\n\nA) The evidence does exist - no one has disputed the already released e-mails and photos. As we examine in the videos, they've chosen to release the evidence in phases. so theres a lot more to come - Rudy Giuliani has been adamant that the evidence that he has seen (having been in possession of it much longer than anyone else) is massive and is referring to the Bidens as the 'Biden Crime Family'.\n\nThe 'cover up' comes from mainstream media and social media literally preventing this from being discussed - no one has denied that the already released evidence is true, it has not been disputed, and the only thing that the Biden family has done is use their lawyers to try and retrieve the laptop. Why, therefore, is this not eligible to be discussed in the public sphere? Why dont the American people deserve to know exactly whats going in in the Biden family before they go to vote?\n\nB) Sure, I agree, but I also think that the principle of two opposing candidates receiving equal treatment by the media during a presidential campaign is more important than the treatment itself. President Trump has had dozens of attacks on him, without proof, that have been vigorously disputed - his words on fallen soldiers, a sexual assault that allegedly happened 30 years ago, etc. If these rumours get widespread reporting, so does this.\n\nIn any case, the New York Post is staffed by veteran, professional journalists and is part of the Murdoch empire - theyre not some rag spreading nonsense. They've done their due dilligence and chosen to proceed with the story, so that should allay your fears. Also, the profile of a social media company is different to a media organisation, and the responsbility of due dilligence should rest with media companies - facebook and twitter shouldnt get to decide what is rumour and what is not, when its posted in a major news outlet and gone through the usual journalsitic processes.\n\nC) I dont think we did, if we wanted to compare Republicans to slave owners then we would have done. Using an example from the 1800s in which one side happened to own slaves is not comparing Republicans to slave owners.\n\nD) The story is not focused on Hunter's problems, tragic as they are. His status as an addict is simply to illustrate that he has no business on the board of a major international company (especially given that he has no experience in energy). The story is focused on Hunter's position on these boards, his receiving of money from hostile states, and his funnelling of money into the Biden family. Some of this took place while Biden was VP.\n\nE) But he has actively set up meetings between foreign interests and Joe for cash, he clearly represents a security risk - we dont know how far Biden is compromised, and this isnt helped by the fact that instead of transparently hiring a third party investigator or releasing the notes of these meetings or whatever, he is hiding in the basement. The story also notes a whatsapp conversation where Hunter admits that Joe requires the family to give 50% of their salary to him - Hunters salary, of course, being made up in part from China. So if you dont think Chinese money making its way into the hands of potentially the President, then you're very security lax.\n\nF) I'm not a lawyer so I'd like to do more research before I speculate on the legality of it - however, politically, the American people deserve to know the full truth of this story before they go to the polls. No matter how this would turn out in court, the people of the USA deserve to know.\n\nThe information you ask for is quite readily available, the store is called 'The Mac Shop', is located in Delaware, and an inebriated Hunter dropped it off one day to get it repaired for water damage and apparently forgot about it. The owner sent it to the FBI and made a copy of it, which worked its way into the hands of Rudy Giuliani. Part of the story is the American people needing to know why the FBI have apparently sat on this.\n\nThanks again for checking out the video and we do hope you consider subscribing and joining our little community, we actively welcome opposing opinions and part of our founding message was to create a space where you can have rational discussion without brigading, cancelling or doxxing :)", "time": 1603145723.0}, {"subreddit": "politics", "text": "Trump has condemned white supremacy half a dozen times. I know it destroys your narrative but it is what it is. But don't believe me, here are just a couple of times he did.\n\n [https://www.cnbc.com/2019/08/05/trump-condemns-racism-bigotry-and-white-supremacy.html](https://www.cnbc.com/2019/08/05/trump-condemns-racism-bigotry-and-white-supremacy.html) \n\n [https://www.npr.org/2017/08/14/543418468/trump-calls-out-kkk-white-supremacists-after-charlottesville-racism-is-evil](https://www.npr.org/2017/08/14/543418468/trump-calls-out-kkk-white-supremacists-after-charlottesville-racism-is-evil) \n\nHave a watch if you want to step outside your leftist echo chambers for once.", "time": 1601442730.0}, {"subreddit": "republicans", "text": "Thanks for the invitation. We're a new channel and we've been looking for some smaller communities that can help facilitate discussion and don't get drowned out so we'll definitely check it out.", "time": 1601380025.0}], "republican_score": 40, "democrat_score": 0}