{"name": "BreakdancingGorillas", "posts": [{"subreddit": "republicans", "text": "Are those mail-in ballots?", "time": 1607128467.0}, {"subreddit": "republicans", "text": "December 2019.", "time": 1607116558.0}, {"subreddit": "republicans", "text": "Project Veritas... No agenda at all. No bias either...\n/S\n\nHaving seen so many times their videos purposely edited to make things look bad, then seeing the full vid depicting nothing similar to their claims, it makes me suspicious of anything they release.", "time": 1607111985.0}, {"subreddit": "republicans", "text": "There's so many questions...\nFor example, why did everyone else leave? What makes moving boxes suspicious? The observers may be gone but the cameras aren't. What was in those boxes? Was it mail-in ballots that are usually counted after all the live ballots?\n\nWhy would I, were I a Georgia voter , ever vote again in an election if it's rigged? How do we know who these votes even went for? Would either party still stand behind their position if the votes were for their candidate?", "time": 1607110985.0}, {"subreddit": "republicans", "text": "You can't say you have evidence and then still say you're looking for it. Do they have it or do they not have it?  You must be trolling. I'm moving on.", "time": 1607058732.0}, {"subreddit": "republicans", "text": "So?", "time": 1607038382.0}, {"subreddit": "republicans", "text": "This is dangerous. I know the intention is to punish the two senators but shooting yourself in the foot hardly seems like it'll help later", "time": 1607001967.0}, {"subreddit": "republicans", "text": "Is it the media that made them not present cases of fraud in court when it was time to present it? Or is it something else?", "time": 1607001844.0}, {"subreddit": "republicans", "text": "They're all old as hell. No good options", "time": 1606879590.0}, {"subreddit": "republicans", "text": "Let's make this 1 person 1 vote. Forget this electoral college bs", "time": 1606753583.0}, {"subreddit": "republicans", "text": "Why don't they show things like this in court?", "time": 1606178636.0}], "republican_score": 11, "democrat_score": 0}