{"name": "shambol", "posts": [{"subreddit": "republicans", "text": "I see her  now.\n\nif those are the ballot papers they are very long so I don't think they are for the presidential race. (Maybe the senate?) looks to me like she is having problems feeding papers into the machine. first of all she tries to square off the papers on the desk taps on the screen tries to square it off again puts them in again eventually tries to curve them lengthways to get them to stay together. I say find someone who has worked at a count centre and ask them what they think she is doing.\n\n&#x200B;\n\nAlso we don't know what those papers are. She could be scanning in hours worked by the people there or some other administrative task. \n\nI think that the gap between what you are seeing and your interpretation of it is too big", "time": 1607133041.0}, {"subreddit": "republicans", "text": "I cannot see a woman in red at 44 minutes take a screenshot  put it up", "time": 1607107299.0}, {"subreddit": "republicans", "text": "Is this a dangerous escalation. or does he have a genuine grievance. if so where it the chair of the republican party", "time": 1606996714.0}, {"subreddit": "republicans", "text": ">The difficulty here is that you're not really smart enough to have a realistic notion of what is and is not evidence.  You're a mouthbreathing simpleton with an internet connection and a dearth of critical thinking skills.\n\nthere's no need for that. These kind of comments have no place in a serious discussion", "time": 1605143360.0}, {"subreddit": "republicans", "text": ">You won't hear it on mainstream media.\n\nAny that are not obviously pro-republican websites? It seems strange to me that the accusations of fraud are particularly lacking in any detail. Also the republican party is very large where were they ? where were their observers?", "time": 1605010447.0}, {"subreddit": "politics", "text": "I think there has been a lot of demonizing of other side in the election the democrats are 'communists' and the republicans are 'fascists' which is fine for an election so long as there is no long term damage. My worry is that there might be long term damage to US society.", "time": 1604767593.0}, {"subreddit": "politics", "text": "Can you explain that a bit more?", "time": 1604758112.0}, {"subreddit": "politics", "text": "I think it is fair to point out nearly 50% of the US voted for trump you need to stop thinking that they are just 'wrong' or 'stupid' and work out what they liked about him, what he meant to them.", "time": 1604703118.0}], "republican_score": 5, "democrat_score": 0}