{"name": "s_j_s_d", "posts": [{"subreddit": "republicans", "text": "🚨🚨🚨🚨🚨🚨🚨🚨HAPPENING!!! CALLING EVERY PEDE TO BUMP THIS NOW. FULL LIST OF VOTES SWITCHED OR ERASED BY DOMINION!!! AND ALL THE EVIDENCE!!! THIS IS A NUKE🚨🚨🚨🚨🚨🚨🚨🚨🚨 - TheDonald\n", "time": 1605049624.0}, {"subreddit": "republicans", "text": "Kemp is trying to say this is all normal process etc. and that these people are were supposedly to stay after everyone left and continue sorting ballots unsupervised. And his comment is what is used to by Twitter as a fact check\n\nHe also said that people were not told to go home when witnesses stated that the woman who pulled out the cases from under the table did indeed tell everyone to leave, this has totally gotten way out of hand, let's not even mention the illegal votes\n\n>2,506 felons voted.66,248 underage registered.2,423 voted w/out registration.1,043 address a Post-Office.4,926 registered late.10,315 dead people.395 cast ballots in another state.15,700 filed national change of address.40,279 moved.\n\n[https://twitter.com/KanekoaTheGreat/status/1334572762933805056](https://twitter.com/KanekoaTheGreat/status/1334572762933805056)", "time": 1607107909.0}, {"subreddit": "republicans", "text": "I'm Catholic and I say that in the true sense unlike many CINO you will encounter. Being so I didn't think so much of Trump for most of his term including the start of 2019 due to his infidelity insulting others etc. some Catholics and Christians from other denominations don't have problems with that, although true Catholics would.\n\nThat being said, this is not so much about me supporting Trump as being against the overwhelming deception of the media and various left groups to brainwash the people to accept their ideologies that would ultimately destroy this country and religious freedom as we know it, think the CCP Facade for example.\n\nThere is no doubt in my mind, or should there be for any sane person, that this election was stolen, the evidence has become insurmountable. Covid 19 has been weaponized to force complacence among the people and you have other leaders such as Canada's Prime Minister Justin Trudeau even stating that the \"pandemic provided an opportunity for a reset\".\n\nSo in short, even though I don't personally approve of Trump, he is the only hope against the oncoming communist agenda. Yes COMMUNIST AGENDA! That is what is coming if this election is allowed to be stolen, we will never see a free and fair election again if this is allowed unless something drastic and tragic such as a civil war takes place. The cost later to fix this would be too great so it must be fixed now to ensure it never happens again ! Additionally, the amount of resistance Trump saw from the left during his term would pale in comparison to what Biden would see since for most people he would have won only through multiple acts of treason.\n\n\\*edit\\*\n\nOne great positive that has come from his term though has been in forcing those hiding deceptively in the shadows to expose themselves openly. They have become so enraged that reason no longer applies to them and the same can be said for much of the Catholic hierarchy as we Catholics truly see them for what they are now.", "time": 1606331050.0}, {"subreddit": "republicans", "text": "📊📈 HARD EVIDENCE 📈📊, \n\nVotes switched from Trump to Biden, totals for 50 states: [archive.is/H79VF](https://archive.is/H79VF),   \nGW Pundit article released on the previous link: [tinyurl.com/y6pezac3](https://tinyurl.com/y6pezac3),   \nDeep Analysis from Dr. V.A. Shiva Ayyadurai ([vashiva.com/about-va-shiva-ayyadurai](https://vashiva.com/about-va-shiva-ayyadurai)) for Michigan, again votes switched from Trump To Biden: [youtu.be/Ztu5Y5obWPk](https://youtu.be/Ztu5Y5obWPk)\n\n🥊🥊 Game Over, Trump Wins 🥊🥊", "time": 1605064475.0}, {"subreddit": "republicans", "text": "newsmax is the closest fox replacement I guess", "time": 1604994619.0}, {"subreddit": "republicans", "text": "Um you obviously don't know the whole story and even if you did your argument means ... ? It doesn't change facts, when all Democrats have is trying misdirection or straw man arguments shows how they are always desperate\n\nHere is a little thing you are going to have to accept sometime in the near future. Joe will not be POTUS neither will Kamala. Joe will be lucky to escape going to jail\n\nThere has been a lot of number crunching that has exposed essentially mathematical impossibilities but here is the gold: [tinyurl.com/yxl3a7uh](https://tinyurl.com/yxl3a7uh)\n\nBenford's law is one of primary ways used to detect fraud : [tinyurl.com/y6z7ag7o](https://tinyurl.com/y6z7ag7o)", "time": 1604908622.0}, {"subreddit": "republicans", "text": "Here I'll also throw in a bonus [https://youtu.be/pqZ7DPjCZjU](https://youtu.be/pqZ7DPjCZjU)", "time": 1604905882.0}, {"subreddit": "republicans", "text": "Google isn't hard\n\n[https://youtu.be/DKXMypeXnAU](https://youtu.be/DKXMypeXnAU)", "time": 1604905519.0}, {"subreddit": "republicans", "text": "I heard they discovered 450K ballots with only Joe Biden", "time": 1604904135.0}, {"subreddit": "republicans", "text": "Rumor has it that the hammer&scorecard was disabled/sabotaged in the 2016 election so not being able to steal it allowed Trump to win. As a result they fellback on all the other ways they attempted \n\nThis is coming from the interview with Lt. Gen Thomas Mcinerney posted on banned video  \n[tinyurl.com/y6kdgncu](https://tinyurl.com/y6kdgncu)", "time": 1604883571.0}, {"subreddit": "republicans", "text": "ok so not so sure about that Charlie Ward guy", "time": 1604727298.0}, {"subreddit": "republicans", "text": "I was digging deeper , I know there is a lot of disinformation in twitter but the two people in the videos are legit, I mean they are putting reputable careers on the line if what they said wasn't true\n\nAlso found a link to the patent for the QFS blockchain voting system which was published on Aug. 13 2020\n\n[tinyurl.com/y338x244](https://tinyurl.com/y338x244)", "time": 1604727063.0}, {"subreddit": "republicans", "text": "Well some interesting info that just came out that will supersede everything else\n\n[https://rumble.com/vay72h-2020-election-sting-operation-donald-trump-blockchain-security-steve-piecze.html](https://rumble.com/vay72h-2020-election-sting-operation-donald-trump-blockchain-security-steve-piecze.html)\n\n[https://youtu.be/zIAplxv\\_y40](https://youtu.be/zIAplxv_y40)\n\nCheck out twitter it should be trending by now\n\n\\*edit\\* guess it late yesterday not just today", "time": 1604725843.0}, {"subreddit": "republicans", "text": "They are", "time": 1604707012.0}, {"subreddit": "republicans", "text": "This is the first time the election has been done on at this level and Pennsylvania is historically notorious for fraud!\n\nThe Trafalgar Group, the only pollster to come close, raised a red flag on this: [https://www.newsbreak.com/news/2085372489930/trafalgar-group-pollster-issues-voter-fraud-red-flag-in-pennsylvania](https://www.newsbreak.com/news/2085372489930/trafalgar-group-pollster-issues-voter-fraud-red-flag-in-pennsylvania)\n\nThis is just one case\n\n \n\nI don't think anyone is in disagreement with every vote being counted\n\nI think everyone must be in agreement that every vote should be verified for authenticity !\n\nWe have seen numerous videos, photos , reporting etc. of invalid ballads, last minute dumps early in the morning, people having their votes stolen etc.", "time": 1604690956.0}, {"subreddit": "republicans", "text": "Why was this crazy in mass mail in ballot scheme permitted ?\n\nThere was already numerous proven cases for much smaller samples so it would only be expected to be massive at this level. Even Fauci and that other Dr. (cant remember his name) said voting in person could be done safely and no need to go this route .", "time": 1604631675.0}, {"subreddit": "republicans", "text": "Yeah pretty sad, no it's not the deaths, no its not the looting, burning and rioting, no its not the numerous innocent families who have had their livelihoods destroyed, no it's because it is showing in the polls and that they might lose\n\nThese people are absolutely disgusting as is the entire Democratic party", "time": 1598515507.0}, {"subreddit": "republicans", "text": "And you don't think Wall Street would impacted negatively by Biden winning ?\n\nIt won't be Joe running the country given his state, it will be his VP whoever that is \n\nIs it possible some form of power vacuum forms as AOC and her squad challenge Nancy Pelosi? No, I think the outcome of Biden winning means a very far left government which would be very bad news for Wall Street", "time": 1596786383.0}, {"subreddit": "republicans", "text": "I don't disagree; however, if episodes we are seeing in Portland spread across the country and BLM has free reign to extort businesses like they actually did in Kentucky that would be significantly worse. If the US is in a constant state of putting out fires and dedicating a majority of its resources to domestic issues (yes there is a lot of this now but it can be much worse) that is the case I'm talking about", "time": 1596785961.0}, {"subreddit": "republicans", "text": "I hope this is a sign of things to come, I don't think I have ever been this anxious/concerned ever before over any political event as I am for this election. If the Democrats win this Nov. not only will it not bold well for the country but the ripple effects it will have across the globe will be severe. A weakened US having to deal with such things as growing domestic terrorism will only emboldened China and make our allies more vulnerable", "time": 1596764429.0}], "republican_score": 20, "democrat_score": 0}